
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ДоступностьОтбора = ОбщегоНазначенияВызовСервера.ДоступностьПараметраОтбораДокументов(ТекущийПользователь);

	Если Не ДоступностьОтбора = Неопределено Тогда
		Элементы.ПодразделениеОтбор.Доступность = ДоступностьОтбора.Подразделение;
		Элементы.ОтветственныйОтбор.Доступность = ДоступностьОтбора.Ответственный;
		Если РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Или РольДоступна("мп_БригадирТОиР") Тогда
			ЭтотОбъект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
			ЭтотОбъект.Ответственный = ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;

	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);

	ЭтотОбъект.СтатусОбмена = ОбщегоНазначенияВызовСервера.ПерсональнаяНастройка(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ПриЗакрытииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ОбщегоНазначенияВызовСервера.СохранитьПерсональнуюНастройку(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбранныеПодразделения = ОбщегоНазначенияВызовСервера.ПодразделенияПользователей();
	
	Если ВыбранныеПодразделения.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ВыбранныеПодразделения);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборПриИзменении(Элемент)

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйОтборПриИзменении(Элемент)

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Асинх Процедура СтатусОбменаОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = ОбщегоНазначенияКлиент.СтатусыОбменаКлиент(ЭтотОбъект.СтатусОбмена);

	ВыбранноеЗначение = Ждать СписокВыбора.ОтметитьЭлементыАсинх("Выберите статусы");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ЭтотОбъект.СтатусОбмена.Очистить();
	Для Каждого ТекСтатус Из ВыбранноеЗначение Цикл
		Если ТекСтатус.Пометка Тогда
			ЭтотОбъект.СтатусОбмена.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтатусОбменаОтборУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Для Каждого ТекИдентификатор Из Идентификаторы Цикл
		УдаляемыйЭлемент = ЭтотОбъект.СтатусОбмена.НайтиПоИдентификатору(ТекИдентификатор);
		ЭтотОбъект.СтатусОбмена.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборОчистка(Элемент, СтандартнаяОбработка)
	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если ПраваДоступа.БригадирТОиР Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборСпискаНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", ЭтотОбъект.Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ЭтотОбъект.Ответственный);

	СтатусыОбменаВЗапрос = Новый Массив;
	Для Каждого ТекСтатус Из ЭтотОбъект.СтатусОбмена Цикл
		СтатусыОбменаВЗапрос.Добавить(ТекСтатус.Значение);
	КонецЦикла;

	Список.Параметры.УстановитьЗначениеПараметра("СтатусыОбмена", СтатусыОбменаВЗапрос);

КонецПроцедуры

#КонецОбласти