#Область ПрограммныйИнтерфейс

Процедура ПроверкаСтатусаНарядаНаРемонт(ДокументИсточник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мп_НарядНаРемонтРаботы.Ссылка КАК НарядНаРемонт
	|ПОМЕСТИТЬ вт_НарядНаРемонт
	|ИЗ
	|	Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(&ДокументИсточник) = ТИП(Документ.мп_ЗаданиеНаРемонт)
	|				ТОГДА (ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.мп_ЗаданиеНаРемонт)) = &ДокументИсточник
	|			ИНАЧЕ (ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.РегистрацияДефекта)) = &ДокументИсточник
	|		КОНЕЦ
	|	И НЕ мп_НарядНаРемонтРаботы.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	мп_НарядНаРемонтРаботы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрацияДефекта.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт_РегистрацияДефекта
	|ИЗ
	|	вт_НарядНаРемонт КАК вт_НарядНаРемонт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрацияДефекта КАК РегистрацияДефекта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|			ПО ((ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.РегистрацияДефекта)) = РегистрацияДефекта.Ссылка)
	|		ПО (вт_НарядНаРемонт.НарядНаРемонт.Ссылка = мп_НарядНаРемонтРаботы.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_РегистрацияДефекта.Ссылка КАК РегистрацияДефекта,
	|	СУММА(1) КАК ВсегоСтрокДефекта,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрацияДефектаДефекты.ДефектУстранен = 1
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Устранены
	|ПОМЕСТИТЬ вт_РегистрацияУстранен
	|ИЗ
	|	Документ.РегистрацияДефекта.Дефекты КАК РегистрацияДефектаДефекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РегистрацияДефекта КАК вт_РегистрацияДефекта
	|		ПО (вт_РегистрацияДефекта.Ссылка = РегистрацияДефектаДефекты.Ссылка)
	|ГДЕ
	|	вт_РегистрацияДефекта.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Устранен)
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_РегистрацияДефекта.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_НарядНаРемонт.НарядНаРемонт КАК НарядНаРемонт,
	|	мп_НарядНаРемонтРаботы.Работа КАК Работа,
	|	СУММА(1) КАК СтрокНаряда,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(мп_НарядНаРемонтРаботы.Работа) = ТИП(Документ.РегистрацияДефекта)
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(вт_РегистрацияУстранен.Устранены = вт_РегистрацияУстранен.ВсегоСтрокДефекта, ЛОЖЬ)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОГДА ТИПЗНАЧЕНИЯ(мп_НарядНаРемонтРаботы.Работа) = ТИП(Документ.мп_ЗаданиеНаРемонт)
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.мп_ЗаданиеНаРемонт).ВыполнениеОперации = """"""Да"""""", ЛОЖЬ)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Исполнено
	|ИЗ
	|	вт_НарядНаРемонт КАК вт_НарядНаРемонт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ вт_РегистрацияУстранен КАК вт_РегистрацияУстранен
	|			ПО ((ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.РегистрацияДефекта)) = вт_РегистрацияУстранен.РегистрацияДефекта)
	|		ПО вт_НарядНаРемонт.НарядНаРемонт = мп_НарядНаРемонтРаботы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_НарядНаРемонт.НарядНаРемонт,
	|	мп_НарядНаРемонтРаботы.Работа
	|ИТОГИ ПО
	|	НарядНаРемонт";
	
	Запрос.УстановитьПараметр("ДокументИсточник", ДокументИсточник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНарядНаРемонт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНарядНаРемонт.Следующий() Цикл
		НарядНаРемонтОбъект = ВыборкаНарядНаРемонт.НарядНаРемонт.ПолучитьОбъект();
		Если ВыборкаНарядНаРемонт.СтрокНаряда = ВыборкаНарядНаРемонт.Исполнено Тогда
			НарядНаРемонтОбъект.Статус = Перечисления.СтатусыНарядаНаРемонт.Выполнен;
			НарядНаРемонтОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
		ИначеЕсли ВыборкаНарядНаРемонт.Исполнено > 0 Тогда
			НарядНаРемонтОбъект.Статус = Перечисления.СтатусыНарядаНаРемонт.ВРаботе;
			НарядНаРемонтОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
		Иначе
			НарядНаРемонтОбъект.Статус = Перечисления.СтатусыНарядаНаРемонт.Создан;
			НарядНаРемонтОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;
		КонецЕсли;
		НарядНаРемонтОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
