#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначенияКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ЭтотОбъект.ВыбранныйСклад = ЗначенияКонстант["ГруппаСкладовОбменаДанными"];
	УстановкаПараметроСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбранныйСкладПриИзменении(Элемент)
	
	УстановкаПараметроСписка();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановкаПараметроСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьСклад", ЗначениеЗаполнено(ЭтотОбъект.ВыбранныйСклад));
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйСклад", ЭтотОбъект.ВыбранныйСклад);

КонецПроцедуры

#КонецОбласти