#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполняетсяПроведение;

&НаКлиенте
Перем ИменаСтраниц;

&НаКлиенте
Перем ТекущийИндексСтраницы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	АдминТОиР = ОбщегоНазначенияВызовСервера.АдминистраторТОиР();
	Если АдминТОиР Тогда
		Если РегистрацияДефектаЛокализация.УсловиеОтбораДокумента(
		Объект.Статус, Объект.Источник, Объект.СтатусОбмена)
		Или Объект.Источник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.КИС") Тогда
			ПоказатьПредупреждение(,
				"Вы находитесь в режиме администрирования. Будьте аккуратны при изменении реквизитов документа", 30)
		КонецЕсли;
	КонецЕсли;
	ВыполняетсяПроведение = Ложь;

	ИменаСтраниц = Новый Массив;
	ИменаСтраниц.Добавить("Основная");
	ИменаСтраниц.Добавить("ГруппаДефекты");
	ИменаСтраниц.Добавить("ГруппаКомментарий");

	ЭтотОбъект.КоличествоСтраниц = ИменаСтраниц.Количество() - 1;

	ТекущийИндексСтраницы = 0;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда

		РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
		Объект.Организация = РеквизитыКонстант["ОрганизацияПользователя"];
		Объект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
		Объект.Ответственный = РеквизитыКонстант["ТекущийПользователь"];
		Объект.ОтветственныйЗаУстранение = РеквизитыКонстант["ТекущийПользователь"];
		Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;
		Объект.Источник = Перечисления.мп_ИсточникиДокументов.МечелТОиР;
		Объект.Статус = Перечисления.СтатусыДефектов.Зарегистрирован;
	Иначе

		Если Параметры.Свойство("ОткрытИзНаряда") Тогда
			ЭтотОбъект.ОткрытИзНаряда = Параметры.ОткрытИзНаряда;
		КонецЕсли;
		Если Параметры.Свойство("НомерСтрокиНаряда") Тогда
			ЭтотОбъект.НомерСтрокиНаряда = Параметры.НомерСтрокиНаряда;
		КонецЕсли;
		УстановитьДоступность = 
			РегистрацияДефектаЛокализация.УсловиеОтбораДокумента(Объект.Статус, Объект.Источник, Объект.СтатусОбмена);
			
		АдминТОиР = ОбщегоНазначенияВызовСервера.АдминистраторТОиР();

		СтатусТолькоПросмотр = 
			Не РедактированиеФормыДокументаТОиР(
				Объект.Подразделение, Объект.Ответственный, Объект.СтатусОбмена, Объект.Источник, Объект.Статус);

		Если УстановитьДоступность Тогда
			Если Не АдминТОиР Тогда
				Если СтатусТолькоПросмотр И Объект.Проведен Тогда
					ЭтотОбъект.ТолькоПросмотр = СтатусТолькоПросмотр;
				КонецЕсли;
				ДоступностьРеквизитов();
			КонецЕсли;
		Иначе
			Если Объект.Источник = Перечисления.мп_ИсточникиДокументов.КИС Тогда
				Если Не АдминТОиР Тогда
					Если СтатусТолькоПросмотр И Объект.Проведен Тогда
						ЭтотОбъект.ТолькоПросмотр = СтатусТолькоПросмотр;
					КонецЕсли;
					ДоступностьРеквизитов();
				КонецЕсли;
			Иначе
				Если СтатусТолькоПросмотр И Объект.Проведен И Не Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан Тогда
					ЭтотОбъект.ТолькоПросмотр = СтатусТолькоПросмотр;
				КонецЕсли;
				ДоступностьРеквизитов();
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	ВидимостьРеквизитов();

	ЧтениеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Документ.РегистрацияДефекта.Форма.ФормаСтрокиДефекта" Тогда

		ДанныеСтроки = Объект.Дефекты.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ИсточникВыбора.СохранитьИзменения Тогда
			
			Модифицированность = Истина;
			
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ИсточникВыбора);
			ДанныеСтроки.ЭтоНоваяСтрока = Ложь;
			ИзменитьТаблицуФиксацииДефекта(ИсточникВыбора.ИдентификаторСтроки, ИсточникВыбора.ФиксацияДефекта);
			ИзменитьТаблицуУстраненияДефекта(ИсточникВыбора.ИдентификаторСтроки, ИсточникВыбора.ФиксацияУстранения);

			ЧтениеНаСервере();
		Иначе

			Если ДанныеСтроки.ЭтоНоваяСтрока Тогда
				НомерСтроки = Объект.Дефекты.Количество();
				Объект.Дефекты.Удалить(НомерСтроки - 1);
			КонецЕсли;
	
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИзменитьТаблицуУстраненияДефекта(Знач ИдентификаторСтроки, Знач ФиксацияУстраненияИзФормы = Неопределено)

	Если ФиксацияУстраненияИзФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УдалитьУстранениеДефекта(ИдентификаторСтроки);

	Для Каждого ТекСтрока Из ФиксацияУстраненияИзФормы Цикл
		НоваяСтрока = Объект.ФиксацияУстранения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ИзменитьТаблицуФиксацииДефекта(Знач ИдентификаторСтроки, Знач ФиксацияДефектаИзФормы = Неопределено)
	
	Если ФиксацияДефектаИзФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УдалитьФиксациюДефекта(ИдентификаторСтроки);

	Для Каждого ТекСтрока Из ФиксацияДефектаИзФормы Цикл
		НоваяСтрока = Объект.ФиксацияДефекта.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЧтениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЧтениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроведениеДокументаАдминистратором(РезультатВопроса, ПараметрыЗаписи) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяПроведение = Истина;
		РежимПроведения = Новый Структура;
		РежимПроведения.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ПроверкаДокумента = ПроверитьЗаполнение();
		Если ПроверкаДокумента Тогда
			Записать(РежимПроведения);
			Закрыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ВерсияДанныхЕРП = "";
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		АдминТОиР = ОбщегоНазначенияВызовСервера.АдминистраторТОиР();
		Если РегистрацияДефектаЛокализация.УсловиеОтбораДокумента(
			Объект.Статус, Объект.Источник, Объект.СтатусОбмена) Тогда

			Если АдминТОиР Тогда
				Если Не ВыполняетсяПроведение Тогда
					Отказ = Истина;
					СтрСообщение = "Изменение документа в статусе %1 запрещено для пользователей с обычными правами. "
					+ "Внося изменения в документ, вы осознаёте риск искажения и рассинхронизации информации. Продолжить?";
					СтрСообщение = СтрШаблон(СтрСообщение, Объект.Статус);

					ПоказатьВопрос(Новый ОписаниеОповещения("ПроведениеДокументаАдминистратором", ЭтотОбъект),
						СтрСообщение, РежимДиалогаВопрос.ДаНет);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		УстановкаОтветственногоБригадира();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЭтотОбъект.ОткрытИзНаряда Тогда
		ЗначениеФормы = Новый Структура;
		ЗначениеФормы.Вставить("ОткрытИзНаряда", ЭтотОбъект.ОткрытИзНаряда);
		ОповеститьОВыборе(ЗначениеФормы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановкаОтветственногоБригадира()

	Если РольДоступна("мп_БригадирТОиР") Тогда
		Если Объект.Ответственный = Справочники.Пользователи.ПустаяСсылка() 
			И Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС Тогда

			РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
			Объект.Ответственный= РеквизитыКонстант["ТекущийПользователь"];

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТехнологическоеМестоОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЕстьТабличнаяЧасть() Тогда
		Оповещение =
			Новый ОписаниеОповещения("ОчиститьТабличнуюЧасть", ЭтотОбъект, ВыбранноеЗначение);
		ПоказатьВопрос(Оповещение, "Очистить дефекты?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЭтотОбъект.ТехнологическоеМесто = ВыбранноеЗначение;
		ТехнологическоеМестоПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ЕстьТабличнаяЧасть() Тогда
		Оповещение =
			Новый ОписаниеОповещения("ОчиститьТабличнуюЧасть", ЭтотОбъект, ВыбранноеЗначение);
		ПоказатьВопрос(Оповещение, "Очистить дефекты?", РежимДиалогаВопрос.ДаНет);
		СтандартнаяОбработка = Ложь;
	Иначе
		ЭтотОбъект.ТехнологическоеМесто = ТехнологическоеМестоОбъектаЭксплуатации(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтветственныйПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекущийИндексСтраницы = ИменаСтраниц.Найти(ТекущаяСтраница.Имя);
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура Страница1(Команда)
	НовыйИндекс = Макс(ТекущийИндексСтраницы - 1, 0);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура Страница2(Команда)
	НовыйИндекс = Мин(ТекущийИндексСтраницы + 1, ЭтотОбъект.КоличествоСтраниц);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДефекты

&НаКлиенте
Процедура ДобавитьДефект(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.Дефекты.Добавить();
	Строка.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	Строка.ЭтоНоваяСтрока = Истина;

	ОткрытьФормуРедактирования(Строка);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтрокуДефекта(Команда)

	Строка = Элементы.Дефекты.ТекущиеДанные;
	Строка.ЭтоНоваяСтрока = Ложь;
	ОткрытьФормуРедактирования(Строка);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуДефекта(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Элементы.Дефекты.ТекущиеДанные.ИдентификаторСтроки;
	УдалитьФиксациюДефекта(ИдентификаторСтроки);
	ИндексСтроки = Элементы.Дефекты.ТекущиеДанные.НомерСтроки - 1;
	Объект.Дефекты.Удалить(ИндексСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ДефектыПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьТабличнуюЧасть(РезультатВопроса, ПараметрыЗаписи) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьТабличнуюЧастьНаСервере();
		Если ТипЗнч(ПараметрыЗаписи) = Тип("СправочникСсылка.Мечел_ТехнологическиеМеста") Тогда
			ЭтотОбъект.ТехнологическоеМесто = ПараметрыЗаписи;
			ТехнологическоеМестоПриИзмененииНаСервере();
		КонецЕсли;
		Если ТипЗнч(ПараметрыЗаписи) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
			Объект.ОбъектЭксплуатации = ПараметрыЗаписи;
			ЭтотОбъект.ТехнологическоеМесто = ТехнологическоеМестоОбъектаЭксплуатации(Объект.ОбъектЭксплуатации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличнуюЧастьНаСервере()
	Объект.Дефекты.Очистить();
	Объект.ФиксацияДефекта.Очистить();
	Объект.ФиксацияУстранения.Очистить();
КонецПроцедуры

&НаСервере
Функция ЕстьТабличнаяЧасть()
	Возврат ?(Объект.Дефекты.Количество(), Истина, Ложь);
КонецФункции

&НаСервере
Процедура УдалитьФиксациюДефекта(Знач ИдентификаторСтроки)

	Модифицированность = Истина;

	ПоискИдентификатора = Новый Структура;
	ПоискИдентификатора.Вставить("ИдентификаторСтрокиДефекта", ИдентификаторСтроки);

	СтрокиФиксаций = Объект.ФиксацияДефекта.НайтиСтроки(ПоискИдентификатора);
	Для Каждого ТекСтрока Из СтрокиФиксаций Цикл
		Объект.ФиксацияДефекта.Удалить(ТекСтрока);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УдалитьУстранениеДефекта(Знач ИдентификаторСтроки)

	Модифицированность = Истина;
	
	ПоискИдентификатора = Новый Структура;
	ПоискИдентификатора.Вставить("ИдентификаторСтрокиДефекта", ИдентификаторСтроки);

	СтрокиФиксаций = Объект.ФиксацияУстранения.НайтиСтроки(ПоискИдентификатора);
	Для Каждого ТекСтрока Из СтрокиФиксаций Цикл
		Объект.ФиксацияУстранения.Удалить(ТекСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактирования(Строка)
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("ОбъектЭксплуатации", Объект.ОбъектЭксплуатации);
	ДанныеСтроки.Вставить("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
	ДанныеСтроки.Вставить("Узел", Строка.Узел);
	ДанныеСтроки.Вставить("Дефект", Строка.Дефект);
	ДанныеСтроки.Вставить("СпособУстранения", Строка.СпособУстранения);
	ДанныеСтроки.Вставить("ДефектУстранен", Строка.ДефектУстранен);
	ДанныеСтроки.Вставить("ДатаУстранения", Строка.ДатаУстранения);
	ДанныеСтроки.Вставить("ОписаниеУстранения", Строка.ОписаниеУстранения);
	ДанныеСтроки.Вставить("НомерСтроки", Строка.ПолучитьИдентификатор());
	ДанныеСтроки.Вставить("ФиксацияДефекта", Объект.ФиксацияДефекта);
	ДанныеСтроки.Вставить("ФиксацияУстранения", Объект.ФиксацияУстранения);
	ДанныеСтроки.Вставить("ТолькоПросмотр", ЭтотОбъект.ТолькоПросмотр);
	ДанныеСтроки.Вставить("СтатусОбмена", Объект.СтатусОбмена);
	ДанныеСтроки.Вставить("Источник", Объект.Источник);

	ОткрытьФорму("Документ.РегистрацияДефекта.Форма.ФормаСтрокиДефекта",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаСервере
Процедура ЧтениеНаСервере()
	
	ЭтотОбъект.ТехнологическоеМесто = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектЭксплуатации, "ТехнологическоеМесто");

	Для Каждого СтрокаДефекта Из Объект.Дефекты Цикл
		Если СтрокаДефекта.ДефектУстранен > 2 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДефекта.ДефектУстраненСтрока = 
			Элементы.ДефектыДефектУстранен.СписокВыбора[СтрокаДефекта.ДефектУстранен];
		
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТехнологическоеМестоОбъектаЭксплуатации(Знач ОбъектЭксплуатации)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЭксплуатации, "ТехнологическоеМесто");
КонецФункции

&НаСервере
Процедура ВидимостьРеквизитов()

	Если РольДоступна("мп_АдминистрированиеТОиР") Или РольДоступна("мп_БригадирТОиР") Тогда
		ВидимостьОтветственныйЗаУстранение = Истина;
	ИначеЕсли РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Тогда
		ВидимостьОтветственныйЗаУстранение = Ложь;
	Иначе
		ВидимостьОтветственныйЗаУстранение = Истина;
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОтветственныйЗаУстранение", "Видимость", ВидимостьОтветственныйЗаУстранение);
КонецПроцедуры

&НаСервере
Процедура ДоступностьРеквизитов()

	ИменаЭлементов = "ДефектыДобавитьДефект, ДефектыКонтекстноеМенюУдалитьСтрокуДефекта, ТехнологическоеМесто";
	ТолькоПросмотр = ЭтотОбъект.ТолькоПросмотр;
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ИменаЭлементов, "Доступность", Не ТолькоПросмотр);
	
	Если Объект.Источник = Перечисления.мп_ИсточникиДокументов.КИС Тогда

		ДоступноДляРедактирования = Новый Массив;
		ДоступноДляРедактирования.Добавить("СтатусОбмена");
		ДоступноДляРедактирования.Добавить("ФормаКоманднаяПанель");
		ДоступноДляРедактирования.Добавить("ФормаПровестиИЗакрыть");
		ДоступноДляРедактирования.Добавить("ГруппаСтраницы");
		ДоступноДляРедактирования.Добавить("Основная");
		ДоступноДляРедактирования.Добавить("ГруппаДефекты");
		ДоступноДляРедактирования.Добавить("ГруппаКомментарий");
		ДоступноДляРедактирования.Добавить("Дефекты");
		ДоступноДляРедактирования.Добавить("ДефектыКонтекстноеМеню");
		ДоступноДляРедактирования.Добавить("ДефектыНомерСтроки");
		ДоступноДляРедактирования.Добавить("ДефектыГруппаУзел");
		ДоступноДляРедактирования.Добавить("ДефектыУзел");
		ДоступноДляРедактирования.Добавить("ДефектыДефект");
		ДоступноДляРедактирования.Добавить("ДефектыСпособУстранения");
		ДоступноДляРедактирования.Добавить("ГруппаНомер");
		ДоступноДляРедактирования.Добавить("Статус");
		ЭтоАдминТОиР = ОбщегоНазначенияВызовСервера.АдминистраторТОиР();
		Если ЭтоАдминТОиР Тогда
			ДоступноДляРедактирования.Добавить("ТехнологическоеМесто");
			ДоступноДляРедактирования.Добавить("ОбъектЭксплуатации");
			ДоступноДляРедактирования.Добавить("СпособУстранения");
			ДоступноДляРедактирования.Добавить("ВидДефекта");
			ДоступноДляРедактирования.Добавить("Критичность");
		КонецЕсли;
		Если РольДоступна("мп_БригадирТОиР") Или ЭтоАдминТОиР Тогда
			ДоступноДляРедактирования.Добавить("ГруппаОтветсвенный");
			ДоступноДляРедактирования.Добавить("Ответственный");
			ДоступноДляРедактирования.Добавить("ОтветственныйЗаУстранение");
			ДоступноДляРедактирования.Добавить("Подразделение");
		КонецЕсли;
		Если РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Тогда
			ДоступноДляРедактирования.Добавить("ГруппаОтветсвенный");
		КонецЕсли;
		ЗакрытьДляРедактирования = Новый Массив;
		ЗакрытьДляРедактирования = 
			ОбщегоНазначения.ЗапрещаемыеЭлементы(Элементы, ДоступноДляРедактирования, ЗакрытьДляРедактирования);
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ДоступноДляРедактирования, "Доступность", Истина);
			
		ЗакрытьДляРедактирования.Добавить("ДефектыКонтекстноеМенюУдалитьСтрокуДефекта");
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ЗакрытьДляРедактирования, "Доступность", Ложь);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТехнологическоеМестоПриИзмененииНаСервере()

	ОбъектЭксплуатации = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
		ЭтотОбъект.ТехнологическоеМесто, Истина);

	Если ТипЗнч(ОбъектЭксплуатации) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		Объект.ОбъектЭксплуатации = ОбъектЭксплуатации;
	Иначе
		Объект.ОбъектЭксплуатации = ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция РедактированиеФормыДокументаТОиР(
	Знач Подразделение, Знач Ответственный, Знач СтатусОбмена, Знач Источник, Знач Статус)
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("мп_АдминистрированиеТОиР") Тогда
		Возврат Истина;
	ИначеЕсли РольДоступна("мп_ПросмотрДокументовТОиР") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ПодразделениеПользователя = РеквизитыКонстант["ПодразделениеПользователя"];
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	
	РедактированиеПоСтатусам = Ложь;
	Если Источник = Перечисления.мп_ИсточникиДокументов.КИС Тогда
		//Статусы = Новый Массив;
		//Статусы.Добавить(Перечисления.СтатусыДефектов.Отклонен);
		//Статусы.Добавить(Перечисления.СтатусыДефектов.Устранен);
		//Статусы.Добавить(Перечисления.СтатусыДефектов.ОтложеноУстранение);

		//Если Статусы.Найти(Статус) = Неопределено Тогда
		//	РедактированиеПоСтатусам = Истина;
		//Иначе
		//	РедактированиеПоСтатусам = Ложь;
		//КонецЕсли;
		Статусы = Новый Массив;
		Статусы.Добавить(Перечисления.СтатусыДефектов.Устранен);
		
		Если Статусы.Найти(Статус) = Неопределено Тогда
			РедактированиеПоСтатусам = Истина;
		Иначе
			
			СтатусыДляРедактирования = Новый Массив;
			СтатусыДляРедактирования.Добавить(Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС);
			Если Не СтатусыДляРедактирования.Найти(Статус) = Неопределено Тогда
				РедактированиеПоСтатусам = Истина;
			Иначе
				РедактированиеПоСтатусам = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		СтатусыДляРедактирования = Новый Массив;
		СтатусыДляРедактирования.Добавить(Перечисления.мп_СтатусыОбмена.ВыгруженВКИС);
		СтатусыДляРедактирования.Добавить(Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС);
		Если (СтатусыДляРедактирования.Найти(СтатусОбмена) = Неопределено) Тогда
			РедактированиеПоСтатусам = Истина;
		Иначе
			РедактированиеПоСтатусам = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если РольДоступна("мп_БригадирТОиР") Тогда
		Если ПодразделениеПользователя = Подразделение 
			И (Перечисления.мп_СтатусыОбмена.Создан = СтатусОбмена) Тогда
			Возврат Истина;
		ИначеЕсли ПодразделениеПользователя = Подразделение И РедактированиеПоСтатусам Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Если РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Тогда
		Если ПодразделениеПользователя = Подразделение И ТекущийПользователь = Ответственный И РедактированиеПоСтатусам Тогда
			Возврат Истина;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаСервере
Процедура ОтветственныйПриИзмененииНаСервере()

	Если Не ЗначениеЗаполнено(Объект.Подразделение) И ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ответственный, "Подразделение");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы)
	ИмяСтраницы = ИменаСтраниц[ТекущийИндексСтраницы];
	Страница = Элементы.Найти(ИмяСтраницы);
	Если Страница = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ПредставлениеСтраницы.Заголовок = Страница.Заголовок;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	ЗаголовокГруппыСтраниц = СтрШаблон("Всего: %1 этапа", ЭтотОбъект.КоличествоСтраниц + 1);
	Элементы.ГруппаКнопкиСтраниц.Заголовок = ЗаголовокГруппыСтраниц;
КонецПроцедуры

#КонецОбласти