#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗаказНаРемонт(РеквизитыЗаказНаРемонт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказНаРемонт.Ссылка КАК Заказ,
	|	ЗаказНаРемонт.ВерсияДанныхЕРП = &ВерсияДанныхЕРП КАК ВерсияСовпадает
	|ИЗ
	|	Справочник.ЗаказНаРемонт КАК ЗаказНаРемонт
	|ГДЕ
	|	ЗаказНаРемонт.УИД = &ЗаказНаРемонтУИД
	|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЗаказНаРемонт.Ссылка) = &ЗаказНаРемонтСпрУИД";
	
	Запрос.УстановитьПараметр("ВерсияДанныхЕРП", РеквизитыЗаказНаРемонт.ЗаказНаРемонтВерсияДанныхЕРП);
	Запрос.УстановитьПараметр("ЗаказНаРемонтУИД", РеквизитыЗаказНаРемонт.ЗаказНаРемонтУИД);
	Запрос.УстановитьПараметр("ЗаказНаРемонтСпрУИД"
		, Новый УникальныйИдентификатор(РеквизитыЗаказНаРемонт.ЗаказНаРемонтУИД));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ЗаказНаРемонт = Справочники.ЗаказНаРемонт.ПустаяСсылка();
		Возврат ИзменитьЭлемент(ЗаказНаРемонт, РеквизитыЗаказНаРемонт);
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Если Выборка.ВерсияСовпадает Тогда
		Возврат Выборка.Заказ;
	Иначе
		Возврат ИзменитьЭлемент(Выборка.Заказ, РеквизитыЗаказНаРемонт);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзменитьЭлемент(Знач ЗаказНаРемонт, РеквизитыЗаказНаРемонт)

	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(ЗаказНаРемонт) Тогда
		ОбъектРедактирования = ЗаказНаРемонт.ПолучитьОбъект();
	Иначе
		ОбъектРедактирования = Справочники.ЗаказНаРемонт.СоздатьЭлемент();
		УИДСпр = Новый УникальныйИдентификатор(РеквизитыЗаказНаРемонт.ЗаказНаРемонтУИД);
		СсылкаНового = Справочники.ЗаказНаРемонт.ПолучитьСсылку(УИДСпр);
		ОбъектРедактирования.УстановитьСсылкуНового(СсылкаНового);
	КонецЕсли;
	ОбъектРедактирования.Код = РеквизитыЗаказНаРемонт.ЗаказНаРемонтНомер;
	ОбъектРедактирования.Наименование = РеквизитыЗаказНаРемонт.ЗаказНаРемонтПредставление;
	ОбъектРедактирования.УИД = РеквизитыЗаказНаРемонт.ЗаказНаРемонтУИД;
	ОбъектРедактирования.Дата = РеквизитыЗаказНаРемонт.ЗаказНаРемонтДата;
	ОбъектРедактирования.Проведен = РеквизитыЗаказНаРемонт.ЗаказНаРемонтПроведен;
	ОбъектРедактирования.ВерсияДанныхЕРП = РеквизитыЗаказНаРемонт.ЗаказНаРемонтВерсияДанныхЕРП;
	ОбъектРедактирования.ПометкаУдаления = РеквизитыЗаказНаРемонт.ЗаказНаРемонтПометкаУдаления;
	ОбъектРедактирования.Записать();

	Возврат ОбъектРедактирования.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли