#Область ПрограммныйИнтерфейс

Функция ЗаменяемыеВидыНоменклатуры() Экспорт

	ЗаменяемыеВидыНоменклатуры = Новый Массив;

	ВидыНоменклатурыИсклИзАнализаПоИндНомерам 
		= Справочники.ОбщиеНастройки.ПолучитьЗначениеНастройки(
			"ВидыНоменклатурыИсклИзАнализаПоИндНомерам");

	Если ТипЗнч(ВидыНоменклатурыИсклИзАнализаПоИндНомерам) = Тип("СписокЗначений") Тогда
		Для Каждого ТекСтрока Из ВидыНоменклатурыИсклИзАнализаПоИндНомерам Цикл
			ЗаменяемыеВидыНоменклатуры.Добавить(ТекСтрока.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ВидыНоменклатурыИсклИзАнализаПоИндНомерамВРН
		= Константы.ВидыНоменклатурыИсклИзАнализаПоИндНомерамВРН.Получить();
		
	Если ВидыНоменклатурыИсклИзАнализаПоИндНомерамВРН Тогда
		ВидыНоменклатурыУказаниеЗаменяемойТМЦ 
			= Справочники.ОбщиеНастройки.ПолучитьЗначениеНастройки(
				"ВидыНоменклатурыУказаниеЗаменяемойТМЦ");

		Если ТипЗнч(ВидыНоменклатурыУказаниеЗаменяемойТМЦ) = Тип("СписокЗначений") Тогда
			Для Каждого ТекСтрока Из ВидыНоменклатурыУказаниеЗаменяемойТМЦ Цикл
				ЗаменяемыеВидыНоменклатуры.Добавить(ТекСтрока.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Возврат ЗаменяемыеВидыНоменклатуры;

КонецФункции

Процедура ЗаполнитьСписокИзменяемыхВидовНоменклатуры(ФормаОбъекта) Экспорт

	ЗаменяемыеВидыНоменклатуры = ЗаменяемыеВидыНоменклатуры();
	Для Каждого ТекСтрока Из ЗаменяемыеВидыНоменклатуры Цикл
		ФормаОбъекта.ЗаменяемыеВидыНоменклатуры.Добавить(ТекСтрока);
	КонецЦикла;

КонецПроцедуры

Функция ЭтоИзменяемаяНоменклатура(Номенклатура, ЗаменяемыеВидыНоменклатуры, ЗаменаНоменклатура) Экспорт

	Если ЗначениеЗаполнено(ЗаменаНоменклатура) Тогда
		Результат = Истина;
	ИначеЕсли ЗначениеЗаполнено(Номенклатура) Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Номенклатура, "ВидНоменклатуры");
		Если ЗаменяемыеВидыНоменклатуры.НайтиПоЗначению(ВидНоменклатуры) = Неопределено Тогда
			Результат = Ложь;
		Иначе
			Результат = Истина;
		КонецЕсли;
	Иначе
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция КонтрольОстатковМатериаловСписания(Знач МатериалыКСписанию, Знач НаДату) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗСписаниеМатериалов", МатериалыКСписанию);
	Запрос.УстановитьПараметр("НаДату", НаДату);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Склад КАК Справочник.Склады) КАК Склад,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.ЗаменаНоменклатура КАК Справочник.Номенклатура) КАК ЗаменаНоменклатура,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.ЗаменаХарактеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК ЗаменаХарактеристика,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.ЗаменаСерия КАК Справочник.СерииНоменклатуры) КАК ЗаменаСерия,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.План КАК ЧИСЛО(15, 3)) КАК План,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Факт КАК ЧИСЛО(15, 3)) КАК Факт
	|ПОМЕСТИТЬ вт_СписаниеМатериалов
	|ИЗ
	|	&ТЗСписаниеМатериалов КАК ТЗСписаниеМатериало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_СписаниеМатериалов.Номенклатура КАК Номенклатура,
	|	вт_СписаниеМатериалов.Характеристика КАК Характеристика,
	|	вт_СписаниеМатериалов.Серия КАК Серия,
	|	вт_СписаниеМатериалов.Склад КАК Склад,
	|	вт_СписаниеМатериалов.ЗаменаНоменклатура КАК ЗаменаНоменклатура,
	|	вт_СписаниеМатериалов.ЗаменаХарактеристика КАК ЗаменаХарактеристика,
	|	вт_СписаниеМатериалов.ЗаменаСерия КАК ЗаменаСерия,
	|	СУММА(вт_СписаниеМатериалов.План) КАК План,
	|	СУММА(вт_СписаниеМатериалов.Факт) КАК Факт
	|ПОМЕСТИТЬ вт_СписаниеМатераловГруппировка
	|ИЗ
	|	вт_СписаниеМатериалов КАК вт_СписаниеМатериалов
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_СписаниеМатериалов.Номенклатура,
	|	вт_СписаниеМатериалов.Характеристика,
	|	вт_СписаниеМатериалов.Серия,
	|	вт_СписаниеМатериалов.Склад,
	|	вт_СписаниеМатериалов.ЗаменаНоменклатура,
	|	вт_СписаниеМатериалов.ЗаменаХарактеристика,
	|	вт_СписаниеМатериалов.ЗаменаСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоНоменклатуреСрезПоследних.Номенклатура КАК Номенклатура,
	|	ОстаткиПоНоменклатуреСрезПоследних.Характеристика КАК Характеристика,
	|	ОстаткиПоНоменклатуреСрезПоследних.Склад КАК Склад,
	|	ОстаткиПоНоменклатуреСрезПоследних.Серия КАК Серия,
	|	СУММА(ОстаткиПоНоменклатуреСрезПоследних.ВНаличии) КАК ВНаличии,
	|	СУММА(ОстаткиПоНоменклатуреСрезПоследних.КОтгрузке) КАК КОтгрузке,
	|	СУММА(ОстаткиПоНоменклатуреСрезПоследних.Остаток) КАК Остаток
	|ПОМЕСТИТЬ втОСтатки
	|ИЗ
	|	РегистрСведений.ОстаткиПоНоменклатуре.СрезПоследних(
	|			&НаДату,
	|			Номенклатура В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						вт_СписаниеМатераловГруппировка.Номенклатура КАК Номенклатура
	|					ИЗ
	|						вт_СписаниеМатераловГруппировка КАК вт_СписаниеМатераловГруппировка
	|					СГРУППИРОВАТЬ ПО
	|						вт_СписаниеМатераловГруппировка.Номенклатура)
	|				И Характеристика В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						вт_СписаниеМатераловГруппировка.Характеристика КАК Характеристика
	|					ИЗ
	|						вт_СписаниеМатераловГруппировка КАК вт_СписаниеМатераловГруппировка
	|					СГРУППИРОВАТЬ ПО
	|						вт_СписаниеМатераловГруппировка.Характеристика)
	|				И Серия В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						вт_СписаниеМатераловГруппировка.Серия КАК Серия
	|					ИЗ
	|						вт_СписаниеМатераловГруппировка КАК вт_СписаниеМатераловГруппировка
	|					СГРУППИРОВАТЬ ПО
	|						вт_СписаниеМатераловГруппировка.Серия)
	|				И Склад В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						вт_СписаниеМатераловГруппировка.Склад КАК Склад
	|					ИЗ
	|						вт_СписаниеМатераловГруппировка КАК вт_СписаниеМатераловГруппировка
	|					СГРУППИРОВАТЬ ПО
	|						вт_СписаниеМатераловГруппировка.Склад)) КАК ОстаткиПоНоменклатуреСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоНоменклатуреСрезПоследних.Номенклатура,
	|	ОстаткиПоНоменклатуреСрезПоследних.Характеристика,
	|	ОстаткиПоНоменклатуреСрезПоследних.Склад,
	|	ОстаткиПоНоменклатуреСрезПоследних.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(вт_СписаниеМатераловГруппировка.Номенклатура) КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(вт_СписаниеМатераловГруппировка.Характеристика) КАК Характеристика,
	|	вт_СписаниеМатераловГруппировка.Склад КАК Склад,
	|	вт_СписаниеМатераловГруппировка.Серия КАК Серия,
	|	вт_СписаниеМатераловГруппировка.Факт КАК Факт,
	|	ЕСТЬNULL(втОСтатки.Остаток, 0) КАК Остаток
	|ИЗ
	|	вт_СписаниеМатераловГруппировка КАК вт_СписаниеМатераловГруппировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОСтатки КАК втОСтатки
	|		ПО (втОСтатки.Номенклатура = вт_СписаниеМатераловГруппировка.Номенклатура)
	|			И (втОСтатки.Характеристика = вт_СписаниеМатераловГруппировка.Характеристика)
	|			И (втОСтатки.Серия = вт_СписаниеМатераловГруппировка.Серия)
	|			И (втОСтатки.Склад = вт_СписаниеМатераловГруппировка.Склад)
	|ГДЕ
	|	вт_СписаниеМатераловГруппировка.Факт > ЕСТЬNULL(втОСтатки.Остаток, 0)";

	Результат = Запрос.Выполнить();

	СписокОшибок = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Ошибка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		СписокОшибок.Добавить(Ошибка);
	КонецЦикла;
	
	Возврат СписокОшибок;
	
КонецФункции

#КонецОбласти
