#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "АвторизацияПользователя" И глАвторизацияВыполнена = Истина Тогда
		ЗаблокироватьРабочийСтол(Ложь);
		ИнтервалОбмена = ИнтервалОбменаСинхронизация();
		Если ИнтервалОбмена > 0 Тогда
			ПодключитьОбработчикОжидания("ЗапускФоновогоЗадания", 45, Ложь);
		КонецЕсли;

	КонецЕсли;

	Если ИмяСобытия = "ПолучитьОстаткиФоном" И глПолучитьОстаткиФоном = Истина Тогда

		ПодключитьОбработчикОжидания("СостояниеОбновленияДанных", 30, Ложь);

		ИнтервалПолученияОстатковТМЦ = ИнтервалПолученияОстатковТМЦ();
		Если ИнтервалПолученияОстатковТМЦ > 0 Тогда
			ПодключитьОбработчикОжидания("ЗапускЗагрузкиОстатковТМЦ", 190, Ложь);
		КонецЕсли;

		ПолучитьОстаткиПриАвторизации();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтотОбъект.ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЭтотОбъект.СлужебныйПользователь = ОбщегоНазначенияВызовСервера.СоздатьСлужебногоПользователя();
	РеквизитыКонстант = ОбщегоНазначенияВызовСервера.ПолучитьЗначенияКонстант();
	Элементы.ТекущийСклад.Заголовок = "Склад: " + РеквизитыКонстант["ГруппаСкладовОбменаДанными"];
	ЗаблокироватьРабочийСтол(Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выход(Команда)
	
	ЗавершитьРаботуСистемы(Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ОбщиеНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)

	ОткрытьФорму("ОбщаяФорма.ОбновлениеДанных");

КонецПроцедуры

&НаКлиенте
Процедура Синхронизация(Команда)
	
	Результат = СинхронизацияНаСервере();
	ПроверитьРезультат(Результат, "Синхронизация");
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоОбмена(Команда)
	ОткрытьФорму("ПланОбмена.мп_ОбменМобильноеПриложениеТОИР.ФормаСписка");
КонецПроцедуры

&НаСервере
Функция СинхронизацияНаСервере()
	
	Возврат ОбменСервер.Синхронизация();
	
КонецФункции

&НаКлиенте
Процедура НаработкиЭксплуатации(Команда)
	
	ОткрытьФорму("Документ.НаработкаОбъектовЭксплуатации.Форма.ФормаСписка", , ЭтотОбъект, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияПроверокОборудования(Команда)

	ОткрытьФорму("Документ.мп_РегистрацияПроверокОборудования.Форма.ФормаСписка", , ЭтотОбъект, Новый УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура РегистрацияДефектов(Команда)

	ОткрытьФорму("Документ.РегистрацияДефекта.Форма.ФормаСписка", , ЭтотОбъект, Новый УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьРезультат(Результат, ВидПроцедуры)
	
	Информация = "";
	Если Результат = Истина Тогда
		Информация = СтрШаблон("%1 завершилась успешно", ВидПроцедуры);
	Иначе
		Информация = СтрШаблон("%1 завершилась с ошибками. %2 Смотрите журнал результатов.", ВидПроцедуры, Символы.ПС);
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(Информация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстаткиПриАвторизации()

	ЗапускФоновогоЗаданияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СостояниеОбновленияДанных()
	Элементы.СтатусОбновленияНоменклатуры.Заголовок = ДатаОбновленияНоменклатуры();
	Элементы.СтатусОбновленияДокументов.Заголовок = ДатаСинхронизацииДокументов();
	Элементы.СтатусОбновленияОстатковТМЦ.Заголовок = ДатаСинхронизацииОстатковТМЦ();
	Элементы.КачествоСвязи.Заголовок = КачествоСвязи();
КонецПроцедуры

&НаКлиенте
Процедура ЗапускФоновогоЗадания()

	СостояниеОбмена = СостояниеОбмена();

	Если СостояниеОбмена.Синхронизация Тогда
		ФоновыеЗаданияВызовСервера.ЗапуститьФоновыйОбмен();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеОбмена()

	ДатаПоследнейСинхронизации = Константы.ДатаПоследнейСинхронизации.Получить();
	ИнтервалОбмена = ИнтервалОбменаСинхронизация();
	Синхронизация = (ТекущаяДатаСеанса() >= (ДатаПоследнейСинхронизации + ИнтервалОбмена));

	ДатаПолученияОстатковТМЦ = Константы.ДатаПолученияОстатковТМЦ.Получить();
	ИнтервалПолученияОстатковТМЦ = ИнтервалПолученияОстатковТМЦ();

	ПолучитьОстаткиТМЦ = (ТекущаяДатаСеанса() >= (ДатаПолученияОстатковТМЦ + ИнтервалПолученияОстатковТМЦ));

	Результат = Новый Структура;
	Результат.Вставить("Синхронизация", Синхронизация);
	Результат.Вставить("ПолучитьОстаткиТМЦ", ПолучитьОстаткиТМЦ);

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ЗапускЗагрузкиОстатковТМЦ()

	СостояниеОбмена = СостояниеОбмена();
	Если СостояниеОбмена.ПолучитьОстаткиТМЦ Тогда
		ЗапускЗагрузкиОстатковТМЦНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапускЗагрузкиОстатковТМЦНаСервере()
	ФоновыеЗадания.Выполнить("ФоновыеЗаданияВызовСервера.ОстаткиТМЦ");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаОбновленияНоменклатуры()
	ДатаОбновления = Константы.ДатаОбновленияНоменклатуры.Получить();
	Если ДатаОбновления = Дата(1, 1, 1) Тогда
		Возврат "Остатки номенклатуры устарели";
	Иначе
		Возврат "Остатки номенклатуры актуальны на: " + Строка(ДатаОбновления);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ДатаСинхронизацииДокументов()
	ДатаОбновления = Константы.ДатаПоследнейСинхронизации.Получить();
	Если ДатаОбновления = Дата(1, 1, 1) Тогда
		Возврат "Синхронизация документов не производилась";
	Иначе
		Возврат "Дата синхронизация документов: " + Строка(ДатаОбновления);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ДатаСинхронизацииОстатковТМЦ()
	ДатаОбновления = Константы.ДатаПолученияОстатковТМЦ.Получить();
	Если ДатаОбновления = Дата(1, 1, 1) Тогда
		Возврат "Синхронизация остатков ТМЦ не производилась";
	Иначе
		Возврат "Дата синхронизация остатков ТМЦ: " + Строка(ДатаОбновления);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗапускФоновогоЗаданияНаСервере()
	
	ДатаОбновленияНоменклатуры = КонецДня(Константы.ДатаОбновленияНоменклатуры.Получить());
	ТекДата = КонецДня(ТекущаяДатаСеанса());
	
	Если ТекДата > ДатаОбновленияНоменклатуры  Тогда
		ФоновыеЗадания.Выполнить("ФоновыеЗаданияВызовСервера.ОбновлениеНоменклатуры");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПользователиВБазе()
	
	Возврат Справочники.Пользователи.ЕстьПользователиВБазе();
	
КонецФункции

&НаКлиенте
Процедура ЗаданиеНаРемонт(Команда)
	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаСписка", , ЭтотОбъект, Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура НарядНаРемонт(Команда)
	ОткрытьФорму("Документ.мп_НарядНаРемонт.Форма.ФормаСписка", , ЭтотОбъект, Новый УникальныйИдентификатор);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнтервалПолученияОстатковТМЦ()
	
	Возврат ОбщегоНазначенияПовтИсп.ИнтервалПолученияОстатковТМЦ();
	
КонецФункции

&НаСервереБезКонтекста
Функция ИнтервалОбменаСинхронизация()
	ЗначенияКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	Возврат ЗначенияКонстант["ИнтервалОбмена"];
КонецФункции

&НаСервереБезКонтекста
Функция КачествоСвязи()

#Если МобильноеПриложениеСервер Тогда

	Инфо = Новый ИнформацияОбИнтернетСоединении;
	Скорость = Инфо.ПолучитьОжидаемуюСкоростьСоединения(); // kbps

	Если Скорость < 64 Тогда
		КачествоСоединения = "Нет связи";
	ИначеЕсли Скорость < 128 Тогда
		КачествоСоединения = "Очень медленно (≈2G)";
	ИначеЕсли Скорость < 512 Тогда
		КачествоСоединения = "Медленно (слабый интернет)";
	ИначеЕсли Скорость < 2048 Тогда
		КачествоСоединения = "Средне (≈3G)";
	ИначеЕсли Скорость < 10000 Тогда
		КачествоСоединения = "Хорошо (≈4G)";
	Иначе
		КачествоСоединения = "Отлично";
	КонецЕсли;

	Возврат "Связь: " + КачествоСоединения;

#Иначе

	Возврат "";

#КонецЕсли

КонецФункции

&НаСервере
Процедура ЗаблокироватьРабочийСтол(Знач УстановитьПросмотр)
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, "ГруппаИнформация, ГруппаКоманды, ГруппаКнопки", "Доступность", Не УстановитьПросмотр, Истина);
КонецПроцедуры

#КонецОбласти