#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//// Выбрать Склады мобильного приложения
////
//// Возвращаемое значение:
////  РезультатЗапроса, Неопределено - Результат запроса.
//Функция ВыбратьСклады() Экспорт

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Склады.Ссылка КАК Ссылка,
//		|	Склады.мп_ГруппаСкладовДляТОиР КАК мп_ГруппаСкладовДляТОиР
//		|ИЗ
//		|	Справочник.Склады КАК Склады";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, Выборка.Ссылка);
//	КонецЦикла;
//	
//	Возврат РезультатЗапроса;
//	
//КонецФункции

#КонецОбласти

#КонецЕсли