////////////////////////////////////////////////////////////////////////////////
// ОбщегоНазначенияСервер: Процедуры и функции выполняемые на сервере
// Copyright (c) 2023, ООО "Мечел-Инфотех"
// Все права защищены.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Константы

Функция ПолучитьЗначенияКонстант() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("ТекущийПользователь", Константы.ТекущийПользователь.Получить());
	Результат.Вставить("ОрганизацияПользователя", Константы.ОрганизацияПользователя.Получить());
	Результат.Вставить("ПодразделениеПользователя", Константы.ПодразделениеПользователя.Получить());
	Результат.Вставить("ГруппаСкладовОбменаДанными", Константы.ГруппаСкладовОбменаДанными.Получить());
	Результат.Вставить("РаботатьОффлайн", Константы.РаботатьОффлайн.Получить());
	Результат.Вставить("МаксимальныйРазмерФото", Константы.МаксимальныйРазмерФото.Получить());
	Результат.Вставить("УИДУзелОбменаОстатков", Константы.УИДУзелОбменаОстатков.Получить());
	Результат.Вставить("ID", Константы.ID.Получить());
	ИнтервалОбмена = Константы.ИнтервалОбмена.Получить();
	Результат.Вставить("ИнтервалОбмена", ИнтервалОбмена * 60);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьЗначенияКонстант(Данные) Экспорт
	
	Для Каждого ЗначениеКонстанты Из Данные Цикл
		Константы[ЗначениеКонстанты.Ключ].Установить(ЗначениеКонстанты.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияУстройства

Функция ПолучитьИнформациюОбУстройстве() Экспорт
	
	Информация = Новый Соответствие;
	
	Инфо = Новый СистемнаяИнформация;
	Информация.Вставить("ВерсияОС", Строка(Инфо.ВерсияОС));
	Информация.Вставить("ВерсияПриложения", Строка(Инфо.ВерсияПриложения));
	Информация.Вставить("ИдентификаторКлиента", Строка(Инфо.ИдентификаторКлиента));
	Информация.Вставить("ОперативнаяПамять", Строка(Инфо.ОперативнаяПамять));
	Информация.Вставить("Процессор", Строка(Инфо.Процессор));
	Информация.Вставить("ТипПлатформы", Строка(Инфо.ТипПлатформы));
	
	Информация.Вставить("Конфигурация", Строка(Метаданные.Имя));
	Информация.Вставить("Версия", Строка(Метаданные.Версия));
	Информация.Вставить("ID", Константы.ID.Получить());
	Информация.Вставить("ГруппаСкладов", Строка(Константы.ГруппаСкладовОбменаДанными.Получить()));

	ИнформацияСтруктура = Новый Структура;
	ИнформацияСтруктура.Вставить("ВерсияОС", Строка(Инфо.ВерсияОС));
	ИнформацияСтруктура.Вставить("ВерсияПриложения", Строка(Инфо.ВерсияПриложения));
	ИнформацияСтруктура.Вставить("ИдентификаторКлиента", Строка(Инфо.ИдентификаторКлиента));
	ИнформацияСтруктура.Вставить("ОперативнаяПамять", Строка(Инфо.ОперативнаяПамять));
	ИнформацияСтруктура.Вставить("Процессор", Строка(Инфо.Процессор));
	ИнформацияСтруктура.Вставить("ТипПлатформы", Строка(Инфо.ТипПлатформы));
	
	ИнформацияСтруктура.Вставить("Конфигурация", Строка(Метаданные.Имя));
	ИнформацияСтруктура.Вставить("Версия", Строка(Метаданные.Версия));
	ИнформацияСтруктура.Вставить("ID", Константы.ID.Получить());
	ИнформацияСтруктура.Вставить("ГруппаСкладов", Строка(Константы.ГруппаСкладовОбменаДанными.Получить()));
	
//	Возврат Информация;
	
	Возврат ИнформацияСтруктура;
	
КонецФункции

Функция ПараметрыСинхронизации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеСинхронизации = Новый Структура;
	УИДГруппаСкладовОбменаДанными = "";
	Склад = Константы.ГруппаСкладовОбменаДанными.Получить();
	Если ЗначениеЗаполнено(Склад) Тогда
		УИДГруппаСкладовОбменаДанными = Строка(Склад.УникальныйИдентификатор());
	КонецЕсли;
	ДанныеСинхронизации.Вставить("УИДГруппаСкладовОбменаДанными", УИДГруппаСкладовОбменаДанными);

	Возврат ДанныеСинхронизации;
	
КонецФункции

#КонецОбласти

#Область Связь

Функция СоединениеВозможно() Экспорт
	
	#Если МобильноеПриложениеСервер Тогда
		ИнформацияОбСоединении = Новый ИнформацияОбИнтернетСоединении;
		ТипСоединения = ИнформацияОбСоединении.ПолучитьТипСоединения();
		Если ТипСоединения = ТипИнтернетСоединения.НетСоединения Тогда
			Возврат Ложь;
		Иначе
			СкоростьСоединения = ИнформацияОбСоединении.ПолучитьОжидаемуюСкоростьСоединения();
			Если СкоростьСоединения > 100 Тогда
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	#Иначе
		Возврат Истина;
	#КонецЕсли
	
КонецФункции

Функция ПолучитьОжидаемуюСкоростьСоединения() Экспорт
	
	#Если МобильноеПриложениеСервер Тогда
		ИнформацияОбСоединении = Новый ИнформацияОбИнтернетСоединении;
		Возврат ИнформацияОбСоединении.ПолучитьОжидаемуюСкоростьСоединения();
	#Иначе
		Возврат 1000;
	#КонецЕсли
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ТОиР

Функция ЗапретПометкиУдаленияДокументовТОиР(Знач СтатусОбмена, Знач Источник = Неопределено) Экспорт
	
	Если Не Источник = Неопределено Тогда
		Если Перечисления.мп_ИсточникиДокументов.КИС = Источник Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмеетПолныеПраваТОиР() Тогда
		Возврат Ложь;
	КонецЕсли;

		
	ДоступныеСтатусы = Новый Массив;
	ДоступныеСтатусы.Добавить(Перечисления.мп_СтатусыОбмена.Создан);

	Возврат ДоступныеСтатусы.Найти(СтатусОбмена) = Неопределено;
	
КонецФункции

Функция ИмеетПолныеПраваТОиР() Экспорт
	
	Если РольДоступна("мп_АдминистрированиеТОиР") Или РольДоступна("ПолныеПрава") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#Область Справочники

Функция ЗапретОткрытияЭлементаФормы() Экспорт

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если ПраваДоступа.АдминТОиР Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ОткрытиеПросмотр() Экспорт

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если ПраваДоступа.АдминТОиР Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецОбласти