
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "НомерСтроки, ТехнологическоеМесто, ОбъектЭксплуатации, УзелОбъектаЭксплуатации,"
		+ "ВидПроверки, Комментарий, РезультатПроверки";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ИменаЭлементов + ", ФормаЗаписать", "Доступность", Не Параметры.ТолькоПросмотр);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЭтотОбъект.СохранитьИзменения Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("ТехнологическоеМесто", ЭтотОбъект.ТехнологическоеМесто);
	ЗначенияСтроки.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	ЗначенияСтроки.Вставить("УзелОбъектаЭксплуатации", ЭтотОбъект.УзелОбъектаЭксплуатации);
	ЗначенияСтроки.Вставить("ВидПроверки", ЭтотОбъект.ВидПроверки);
	ЗначенияСтроки.Вставить("Комментарий", ЭтотОбъект.Комментарий);
	ЗначенияСтроки.Вставить("РезультатПроверки", ЭтотОбъект.РезультатПроверки);

	ОповеститьОВыборе(ЗначенияСтроки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТехнологическоеМестоПриИзменении(Элемент)
	
	ОбъектЭксплуатации = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
		ЭтотОбъект.ТехнологическоеМесто, Истина);
	
	Если ТипЗнч(ОбъектЭксплуатации) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		ЭтотОбъект.ОбъектЭксплуатации = ОбъектЭксплуатации;
	Иначе
		ЭтотОбъект.ОбъектЭксплуатации =
			ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)

	ЭтотОбъект.ТехнологическоеМесто = ТехнологическоеМестоПоОЭ(ЭтотОбъект.ОбъектЭксплуатации);

КонецПроцедуры

&НаКлиенте
Процедура УзелОбъектаЭксплуатацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбъектЭксплуатации = ЭтотОбъект.ОбъектЭксплуатации;

	МассивЭлементов = Новый Массив;
	Если ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда
		
		УзлыОбъектов = ОбщегоНазначенияВызовСервера.УзлыОбъектаЭксплуатации(ОбъектЭксплуатации);
		Если Не УзлыОбъектов = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", УзлыОбъектов);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПроверкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Узел = ЭтотОбъект.УзелОбъектаЭксплуатации;
	Если Не ЗначениеЗаполнено(Узел) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	ВидыПроверок = ВидыПроверокПоУзлу(Узел);
	
	Если ВидыПроверок = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	Иначе
		МассивЭлементов = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ВидыПроверок);
		МассивЭлементов.Добавить(НовыйПараметр);
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ПустойУзел = ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");
	Если ЭтотОбъект.УзелОбъектаЭксплуатации = ПустойУзел Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите узел объекта эксплуатации", , "УзелОбъектаЭксплуатации");
		Возврат;
	КонецЕсли;
	Если ЭтотОбъект.ВидПроверки = ПредопределенноеЗначение("Справочник.мп_ВидыПроверокОборудования.ПустаяСсылка") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите вид проверки", , "ВидПроверки");
		Возврат;
	КонецЕсли;
	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТехнологическоеМестоПоОЭ(Знач ОбъектЭксплуатации)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЭксплуатации, "ТехнологическоеМесто");
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидыПроверокПоУзлу(Знач Узел)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УзлыОбъектовЭксплуатации.Класс КАК Класс
	|ПОМЕСТИТЬ вт_КлассУзла
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|ГДЕ
	|	УзлыОбъектовЭксплуатации.Ссылка = &Узел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассыОбъектовЭксплуатациимп_ВидыПроверок.ВидПроверокОборудования КАК ВидПроверокОборудования
	|ИЗ
	|	Справочник.КлассыОбъектовЭксплуатации.мп_ВидыПроверок КАК КлассыОбъектовЭксплуатациимп_ВидыПроверок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_КлассУзла КАК вт_КлассУзла
	|		ПО (вт_КлассУзла.Класс = КлассыОбъектовЭксплуатациимп_ВидыПроверок.Ссылка)";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВидПроверокОборудования");
	КонецЕсли;

КонецФункции

#КонецОбласти