
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокОбновлений();
 КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОбновлений

&НаКлиенте
Процедура ТаблицаОбновленийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСписок(Команда)

	Результат = СписокОбновлений();
	
	Если Не Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка подключения к списку обновлений");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбновитьПриложение(Команда)
	ИмяФайла = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.ИмяФайла;
	Адрес = ОбновитьПриложениеНаСервере(ИмяФайла);
	Ждать ЗапуститьПриложениеАсинх(Адрес, , Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбновитьПриложениеНаСервере(Знач ИмяФайла)

	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();
	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();

	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);

	Если СоединениеHTTP.Защищенное Тогда
		Схема = "https://";
	Иначе
		Схема = "http://";
	КонецЕсли;
	Адрес = Схема + СоединениеHTTP.Сервер + "/mp_toir_update/" + ИмяФайла;
	
	Возврат Адрес;

КонецФункции

&НаСервере
Функция СписокОбновлений()

	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();
	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
	Если ПараметрыПодключения = Неопределено Тогда
		HTTPCore.ЗаписатьМобильнуюОшибку("Регистрация | Не заполнены параметры подключения.", СтруктураДанных);
		Возврат Ложь;
	КонецЕсли;

	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);

	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
	КонецЕсли;

	ЗапросHTTP = Новый HTTPЗапрос(ПараметрыПодключения["HTTP"] + "/apklist");

	Попытка

		СтрокаXML = HTTPCore.СформироватьПакетОтвета(СтруктураДанных);
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаXML);

		Ответ = СоединениеHTTP.Получить(ЗапросHTTP);

		Тело = Ответ.ПолучитьТелоКакСтроку();
		Если Не Ответ = Неопределено Тогда
			Если ТипЗнч(Ответ) = Тип("HTTPОтвет")  Тогда
				Если Не Ответ.КодСостояния = 200 Тогда
					HTTPCore.ЗаписатьИнформациюВЖурналСтрокой(
						"ОбменСервер.ПроверкаСвязи", "Код состояния = " + Ответ.КодСостояния + Символы.ПС + Тело);
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Сообщить(Строка(ОписаниеОшибки()));
		Если Не Ответ = Неопределено Тогда
			HTTPCore.ЗаписатьМобильнуюОшибку(
				"ОбменСервер.СписокПриложений | Ошибка обработки данных с сервера. Код состояния = " + Ответ.КодСостояния,
				СтруктураДанных, , ОписаниеОшибки());
		Иначе
			HTTPCore.ЗаписатьМобильнуюОшибку(
				"ОбменСервер.СписокПриложений | Ошибка обработки данных с сервера. Код состояния = " + "неизвестный код",
				СтруктураДанных, , ОписаниеОшибки());
		КонецЕсли;
	КонецПопытки;

	Если НЕ Ответ.КодСостояния = 200 Тогда

		Возврат Ложь;

	КонецЕсли;

	ОбновитьТаблицуФормы(Тело);

	Возврат Истина;

КонецФункции

&НаСервере
Процедура ОбновитьТаблицуФормы(Тело)

	ТЗ = ЭтотОбъект.ТаблицаОбновлений.Выгрузить();
	ТЗ.Очистить();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(Тело);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();

	Пока Чтение.Прочитать() Цикл
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "Item" Тогда
			НоваяСтрока = ТЗ.Добавить();

			Пока Чтение.Прочитать() Цикл
				Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					ИмяЭлемента = Чтение.Имя;
					Чтение.Прочитать();
					ЗначениеЭлемента = Чтение.Значение;

					Если ИмяЭлемента = "Version" Тогда
						НоваяСтрока.Версия = ЗначениеЭлемента;
					ИначеЕсли ИмяЭлемента = "Description" Тогда
						НоваяСтрока.Описание = ЗначениеЭлемента;
					ИначеЕсли ИмяЭлемента = "FileName" Тогда
						НоваяСтрока.ИмяФайла = ЗначениеЭлемента;
					КонецЕсли;

				ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента
					И Чтение.Имя = "Item" Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	ЭтотОбъект.ТаблицаОбновлений.Загрузить(ТЗ);

КонецПроцедуры

#КонецОбласти