
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗначениеНастройка = ТекущийОбъект.Значение.Получить(); 
	Если ТипЗнч(ЗначениеНастройка) = ТИП("СписокЗначений")  Тогда
		Для каждого ЗначенияНастройкиТЧ из ЗначениеНастройка Цикл
			НоваяСтрока = ЗначенияТЧ.Добавить();
			НоваяСтрока.Значение = ЗначенияНастройкиТЧ.Значение;
		КонецЦикла;
		Объект.ЭтоСписокЗначений =Истина;
	Иначе	
		Значение = ЗначениеНастройка; 
		Объект.ЭтоСписокЗначений =Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ОбщегоНазначенияСервер.ОткрытиеПросмотр() Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
