////////////////////////////////////////////////////////////////////////////////
// ОбщегоНазначенияПовтИсп: Процедуры и функции выполняемые на сервере
//  с повторным использованием на время сеанса.
// Copyright (c) 2023, ООО "Мечел-Инфотех"
// Все права защищены.
//
////////////////////////////////////////////////////////////////////////////////

// @skip-check public-method-caching
#Область ПрограммныйИнтерфейс

// Кэшированное значение узла центральной базы
//
// Возвращаемое значение:
//  ПланОбменаСсылка.мп_ОбменМобильноеПриложениеТОИР - Узел центральной базы (по-умолчанию "ЦБ")
Функция ПолучитьУзелЦентральнойБазы() Экспорт
	
	Возврат ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.НайтиПоКоду("ЦБ");
	
КонецФункции

#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс
#Область Права

Функция ДоступныеПрава() Экспорт
	ПраваТОиР = Новый Структура;
	ПраваТОиР.Вставить("АдминТОиР", РольДоступна("мп_АдминистрированиеТОиР"));
	ПраваТОиР.Вставить("БригадирТОиР", РольДоступна("мп_БригадирТОиР"));
	ПраваТОиР.Вставить("МеханикТОиР", РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР"));
	ПраваТОиР.Вставить("ПросмотрТОиР", РольДоступна("мп_ПросмотрДокументовТОиР"));
	Возврат ПраваТОиР;
КонецФункции

#КонецОбласти
// Функция - Совпадает версия данных ЕРП
//
// Параметры:
//  ВерсияДанныхМП	 - Строка - Версия данных в МП
//  ВерсияДанныхЕРП	 - Строка - Версия данных в ЕРП
// 
// Возвращаемое значение:
//  Булево - Тип Булево
//
Функция СовпадаетВерсияДанныхЕРП(ВерсияДанныхМП, ВерсияДанныхЕРП) Экспорт

	Если ИспользоватьПроверкуВерсииДанныхЕРП() Тогда
		Возврат СокрЛП(ВерсияДанныхМП) = СокрЛП(ВерсияДанныхЕРП);
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ИнтервалПолученияОстатковТМЦ() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ИнтервалВМинутах = Константы.ИнтервалПолученияОстатковТМЦ.Получить();

	Возврат ИнтервалВМинутах * 60;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользоватьПроверкуВерсииДанныхЕРП()
	
	Возврат Константы.ИспользоватьВерсиюДанныхЕРП.Получить();
	
КонецФункции

#КонецОбласти