
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "Подразделение,Статус";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);
	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	Для Каждого ТекСтрока Из Параметры.ИсключаемыеДокументы Цикл
		ЭтотОбъект.ИсключаемыеДокументы.Добавить(ТекСтрока);
	КонецЦикла;
	
	ЭтотОбъект.Статус.Добавить(Перечисления.СтатусыДефектов.Зарегистрирован);
	ЭтотОбъект.Статус.Добавить(Перечисления.СтатусыДефектов.Признан);

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЭтотОбъект.ВыбранныеДокументы.Очистить();
	Для Каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ЭтотОбъект.ВыбранныеДокументы.Добавить(ТекСтрока);
	КонецЦикла;
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("ВыбранныеДокументы", ЭтотОбъект.ВыбранныеДокументы);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ОповеститьОВыборе(ЗначенияСтроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерКИСПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЗаУстранениеПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборСпискаНаСервере()

	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", ЭтотОбъект.Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ЭтотОбъект.Ответственный);
	Список.Параметры.УстановитьЗначениеПараметра("ОтветственныйЗаУстранение", ЭтотОбъект.ОтветственныйЗаУстранение);
	СтатусыДефекта = Новый Массив;
	Для Каждого ТекСтрока Из ЭтотОбъект.Статус Цикл
		СтатусыДефекта.Добавить(ТекСтрока.Значение);
	КонецЦикла;
	Список.Параметры.УстановитьЗначениеПараметра("Статус", СтатусыДефекта);
	Список.Параметры.УстановитьЗначениеПараметра("ИсключаемыеДокументы", ЭтотОбъект.ИсключаемыеДокументы);
	Список.Параметры.УстановитьЗначениеПараметра("НомерКИС", ЭтотОбъект.НомерКИС);
	
	СортировкаПоДате();
	
КонецПроцедуры

&НаСервере
Процедура СортировкаПоДате()
	Порядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		Список.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Дата");
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование = Истина;
	ОбновитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()

	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти
