
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ОбъектЭксплуатации = Параметры.ОбъектЭксплуатации;
	ЭтотОбъект.Узел = Параметры.ВыбранныйУзел;
	ЭтотОбъект.ЗаменяемыеВидыНоменклатуры = Параметры.ЗаменяемыеВидыНоменклатуры;
	ТЗМатериалыКОприходованию = Параметры.МатериалыКОприходованию.Выгрузить();
	ТЗМатериалыКСписанию = Параметры.МатериалыКСписанию.Выгрузить();
	ТЗУстановленныеТМЦ = 
		Документы.мп_ЗаданиеНаРемонт.УстановленныеТМЦ(
			Параметры.ОбъектЭксплуатации, Параметры.ВыбранныйУзел
			, ТЗМатериалыКОприходованию, ТЗМатериалыКСписанию, ЭтотОбъект.ЗаменяемыеВидыНоменклатуры);
			
	ЭтотОбъект.УстановленныеТМЦ.Загрузить(ТЗУстановленныеТМЦ);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("ВыбраннаяНоменклатура", ЭтотОбъект.ВыбраннаяНоменклатура);
	ЗначенияСтроки.Вставить("ВыбраннаяХарактеристика", ЭтотОбъект.ВыбраннаяХарактеристика);
	ЗначенияСтроки.Вставить("ВыбраннаяСерия", ЭтотОбъект.ВыбраннаяСерия);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ОповеститьОВыборе(ЗначенияСтроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

Процедура УстановленныеТМЦПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеТМЦПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)

	ЭтотОбъект.ВыбраннаяНоменклатура = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Номенклатура;
	ЭтотОбъект.ВыбраннаяХарактеристика = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Характеристика;
	ЭтотОбъект.ВыбраннаяСерия = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Серия;
	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПросмотрЗаписи(Команда)

	Данные = Новый Структура;
	Данные.Вставить("Номенклатура", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Номенклатура);
	Данные.Вставить("Характеристика", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Характеристика);
	Данные.Вставить("Серия", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Серия);
	Данные.Вставить("Количество", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Количество);

	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаРасшифровкаУстановленныеТМЦ",
		Данные, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти