
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "Номенклатура, Характеристика, Серия, Склад, Количество, НоменклатураВозврат, ХарактеристикаВозврат"
		+ ", СерияВозврат, СтатусУказанияСерий, Источник, СтатусОбмена, ТолькоПросмотр, НомерСтроки, ОбъектЭксплуатации"
		+ ", ВыбранныйУзел";

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);
	ЭтотОбъект.МатериалыКОприходованию.Загрузить(Параметры.МатериалыКОприходованию.Выгрузить());
	ЭтотОбъект.МатериалыКСписанию.Загрузить(Параметры.МатериалыКСписанию.Выгрузить());
	
	ЗаданиеНаРемонтВызовСервераЛокализация.ЗаполнитьСписокИзменяемыхВидовНоменклатуры(ЭтотОбъект);

	ДоступностьРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
	ЗначенияСтроки.Вставить("Характеристика", ЭтотОбъект.Характеристика);
	ЗначенияСтроки.Вставить("Серия", ЭтотОбъект.Серия);
	ЗначенияСтроки.Вставить("Склад", ЭтотОбъект.Склад);
	ЗначенияСтроки.Вставить("НоменклатураВозврат", ЭтотОбъект.НоменклатураВозврат);
	ЗначенияСтроки.Вставить("ХарактеристикаВозврат", ЭтотОбъект.ХарактеристикаВозврат);
	ЗначенияСтроки.Вставить("Количество", ЭтотОбъект.Количество);
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ОповеститьОВыборе(ЗначенияСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.мп_ЗаданиеНаРемонт.Форма.ФормаУстановленныеТМЦ" Тогда
		Если ИсточникВыбора.СохранитьИзменения Тогда
			ЭтотОбъект.Номенклатура = ИсточникВыбора.ВыбраннаяНоменклатура;
			ЭтотОбъект.Характеристика = ИсточникВыбора.ВыбраннаяХарактеристика;
			ЭтотОбъект.Серия = ИсточникВыбора.ВыбраннаяСерия;
			Если Не ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
				СписокВосстановление = СписокНоменклатурыБрак(ЭтотОбъект.Номенклатура);
				Если СписокВосстановление.Количество() = 1 Тогда
					ЭтотОбъект.НоменклатураВозврат = СписокВосстановление[0];
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) И Не ЗначениеЗаполнено(ЭтотОбъект.ХарактеристикаВозврат) Тогда
				Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.НоменклатураВозврат);
				Если Не Характеристики = Неопределено Тогда
					ЭтотОбъект.ХарактеристикаВозврат = ЭтотОбъект.Характеристика;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		МассивЭлементов = Новый Массив;
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		Если Не Характеристики = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Характеристики);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		МассивЭлементов = Новый Массив;
		Серии = ОбщегоНазначенияВызовСервера.СерииПоНоменклатуре(ЭтотОбъект.Номенклатура);
		Если Не Серии = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Серии);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерияВозвратНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
		МассивЭлементов = Новый Массив;
		Серии = ОбщегоНазначенияВызовСервера.СерииПоНоменклатуре(ЭтотОбъект.НоменклатураВозврат);
		Если Не Серии = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Серии);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Склады = ОбщегоНазначенияВызовСервера.СкладыПоКонстанте();
	Если Склады = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Склады);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ПустаяНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ЭтоЗаменяемаяНоменклатура = ЗаданиеНаРемонтВызовСервераЛокализация.ЭтоИзменяемаяНоменклатура(
		ВыбранноеЗначение, ЭтотОбъект.ЗаменяемыеВидыНоменклатуры, ПустаяНоменклатура);

	Если ЭтоЗаменяемаяНоменклатура Тогда

		ВидНоменклатуры = ПредставлениеВидаНоменклатуры(ВыбранноеЗначение);
		ТекстСообщения = СтрШаблон("Номенклатуру с видом %1 нужно указывать в качестве заменяемой на закладке Материалы к списанию", ВидНоменклатуры);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		СтандартнаяОбработка = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СписокВосстановление = СписокНоменклатурыБрак(ЭтотОбъект.Номенклатура);

	Если СписокВосстановление.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", СписокВосстановление);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратПриИзменении(Элемент)
	ДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаВозвратНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
		МассивЭлементов = Новый Массив;
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.НоменклатураВозврат);
		Если Не Характеристики = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Характеристики);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	Если ПроверкаЗаполнения() Тогда
		ЭтотОбъект.СохранитьИзменения = Истина;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеТМЦ(Команда)
	Данные = Новый Структура;
	Данные.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	Данные.Вставить("ВыбранныйУзел", ЭтотОбъект.ВыбранныйУзел);
	Данные.Вставить("МатериалыКОприходованию", ЭтотОбъект.МатериалыКОприходованию);
	Данные.Вставить("МатериалыКСписанию", ЭтотОбъект.МатериалыКСписанию);
	Данные.Вставить("ЗаменяемыеВидыНоменклатуры", ЭтотОбъект.ЗаменяемыеВидыНоменклатуры);

	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаУстановленныеТМЦ",
		Данные, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверкаЗаполнения()

	Ошибки = Неопределено;
	ДоступностьВыбораХарактеристики = Ложь;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Номенклатура", "Укажите номенклатуру");
	Иначе
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбораХарактеристики = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;
	
	Если ДоступностьВыбораХарактеристики И Не ЗначениеЗаполнено(ЭтотОбъект.Характеристика) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Характеристика", "Укажите характеристику");
	КонецЕсли;

	ДоступностьСерий = ОбщегоНазначенияВызовСервера.СерииПоНоменклатуре(ЭтотОбъект.Номенклатура);
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Серия) И Не ДоступностьСерий = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Серия", "Укажите серию");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Склад", "Укажите склад");
	КонецЕсли;
	
	Если ЭтотОбъект.Количество = 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Количество", "Укажите количество");
	КонецЕсли;

	Если Не Ошибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеВидаНоменклатуры(Знач Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(Номенклатура.ВидНоменклатуры) КАК ВидНоменклатурыПредставление
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ВидНоменклатурыПредставление;

КонецФункции

&НаСервере
Процедура ДоступностьРеквизитов()

	Если ЭтотОбъект.ТолькоПросмотр Тогда

		РазрешеноИзменять =Новый Массив;
		ЗапрещеноИзменять = Новый Массив;
		ЗапрещеноИзменять = 
			ОбщегоНазначения.ЗапрещаемыеЭлементы(Элементы, РазрешеноИзменять, ЗапрещеноИзменять);

		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, РазрешеноИзменять, "Доступность", Истина);

		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ЗапрещеноИзменять, "Доступность", Ложь);
		Возврат;
	КонецЕсли;

	ДоступностьХарактеристики();
	ДоступностьСерий();
	ДоступностьРеквизитовБрак();

КонецПроцедуры

&НаСервере
Процедура ДоступностьХарактеристики()

	ДоступностьВыбора = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбора = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Характеристика", "Доступность", ДоступностьВыбора);

КонецПроцедуры

&НаСервере
Процедура ДоступностьСерий()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыбраннаяНоменклатура", ЭтотОбъект.Номенклатура);
	Запрос.УстановитьПараметр("ВыбраннаяНоменклатураВозврат", ЭтотОбъект.НоменклатураВозврат);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|			И (ВидыНоменклатуры.ИспользоватьСерии)
	|			И (Номенклатура.Ссылка = &ВыбраннаяНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|			И (Номенклатура.Ссылка = &ВыбраннаяНоменклатураВозврат)
	|			И (ВидыНоменклатуры.ИспользоватьСерии)";

	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ИндексПоследнегоПакета = ПакетРезультатов.ВГраница();
	
	Результат1 = ПакетРезультатов[ИндексПоследнегоПакета - 1];
	ДоступностьСерии = Не Результат1.Пустой();
	
		
	Результат2 = ПакетРезультатов[ИндексПоследнегоПакета];
	ДоступностьЗаменаСерии = Не Результат2.Пустой();

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Серия", "Доступность", ДоступностьСерии);
		
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СерияВозврат", "Доступность", ДоступностьЗаменаСерии);

КонецПроцедуры

&НаСервере
Процедура ДоступностьРеквизитовБрак()

	СписокБрака = СписокНоменклатурыБрак(ЭтотОбъект.Номенклатура);
	ДоступностьОткрытияБрака = СписокБрака.Количество();
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НоменклатураВозврат", "Доступность", ДоступностьОткрытияБрака);
		
	ДоступностьВыбора = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.НоменклатураВозврат) Тогда
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбора = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ХарактеристикаВозврат", "Доступность", ДоступностьВыбора);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокНоменклатурыБрак(Знач НоменклатураНовая)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыДругогоКачества.НоменклатураБрак КАК НоменклатураБрак
	|ИЗ
	|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТоварыДругогоКачества.Номенклатура = СпрНоменклатура.Ссылка
	|			И (НЕ ТоварыДругогоКачества.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый))
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &НоменклатураНовая
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = ВЫРАЗИТЬ(&НоменклатураНовая КАК Справочник.Номенклатура).ВидНоменклатуры
	|			И Номенклатура.Мечел_БУ
	|			И НЕ Номенклатура.ЭтоГруппа
	|			И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НоменклатураНовая", НоменклатураНовая);
	
	РезультатЗапроса = Запрос.Выполнить();
	НоменклатураБрак = ОбщегоНазначения.ВыгрузитьКолонку(РезультатЗапроса.Выгрузить(), "НоменклатураБрак", Истина);
	Если НоменклатураБрак.Найти(НоменклатураНовая) = Неопределено Тогда
		НоменклатураБрак.Добавить(НоменклатураНовая);
	КонецЕсли;
	Возврат НоменклатураБрак;

КонецФункции

#КонецОбласти