#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выбрать изменения (регистрация) документа ОрдерНаОтражениеИзлишковТоваров
//
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Результат запроса.
//
Функция ВыбратьИзменения() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаработкаОбъектовЭксплуатацииИзменения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НаработкаОбъектовЭксплуатации.Изменения КАК НаработкаОбъектовЭксплуатацииИзменения
	|ГДЕ
	|	НаработкаОбъектовЭксплуатацииИзменения.Ссылка.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли