////////////////////////////////////////////////////////////////////////////////
// HTTPExchange: Обмен с HTTP сервисом
// Copyright (c) 2023, ООО "Мечел-Инфотех"
// Все права защищены.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область HTTPСервис

Функция ПолучитьПараметрыСоединения() Экспорт
	
	ПараметрыПодключения = Новый Соответствие;
	
	Login				  =	Константы.Login.Получить();
	Password			  =	Константы.Password.Получить();
	СтрокаПодключенияHTTP =	Константы.СтрокаПодключенияHTTP.Получить();
	СтрокаПодключенияIP	  =	Константы.СтрокаПодключенияIP.Получить();
	СтрокаПодключенияПорт =	Константы.СтрокаПодключенияПорт.Получить();
	
	Если Не ЗначениеЗаполнено(Login) Или Не ЗначениеЗаполнено(Password) Или Не ЗначениеЗаполнено(СтрокаПодключенияHTTP)
		Или Не ЗначениеЗаполнено(СтрокаПодключенияIP) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПодключения.Вставить("Login", Login);
	ПараметрыПодключения.Вставить("Password", Password);
	ПараметрыПодключения.Вставить("HTTP", СтрокаПодключенияHTTP);
	ПараметрыПодключения.Вставить("IP", СтрокаПодключенияIP);
	ПараметрыПодключения.Вставить("Порт", СтрокаПодключенияПорт);
	
	Возврат ПараметрыПодключения;
	
КонецФункции

Функция ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения) Экспорт
	
	СоединениеHTTP = Неопределено;

	Если Константы.ИспользоватьПодключениеSSL.Получить() Тогда
		SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	Иначе
		SSL = Неопределено;
	КонецЕсли;
	ПортПодключения = ?( ПараметрыПодключения["Порт"] = 0, Неопределено,  ПараметрыПодключения["Порт"]);

	СоединениеHTTP = Новый HTTPСоединение(ПараметрыПодключения["IP"], ПортПодключения,
		ПараметрыПодключения["Login"], ПараметрыПодключения["Password"], , , SSL);
	
	Возврат СоединениеHTTP;
	
КонецФункции

Процедура DataTransferHTTP(ФункцияHTTP, СтруктураДанных, СоединениеHTTP, ПараметрыПодключения) Экспорт
	
	Попытка
		ЗапросHTTP = Новый HTTPЗапрос(ПараметрыПодключения["HTTP"] + "/" + ФункцияHTTP);
		СтрокаXML = HTTPCore.СформироватьПакетОтвета(СтруктураДанных);
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаXML);
		
		Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		СтруктураДанных.КодОтветаHTTP = Ответ.КодСостояния;
		
		Попытка
			Тело = Ответ.ПолучитьТелоКакСтроку();
			HTTPCore.ПолучитьПакетИзВходящихДанных(Тело, СтруктураДанных);
			Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
				HTTPCore.ЗаписатьОшибкиВЖурнал(СтруктураДанных);
				Возврат;
				
			КонецЕсли;
			
			Если НЕ СтруктураДанных.КодОтветаHTTP = 200 Тогда
				ВызватьИсключение "";
				
			КонецЕсли;
			
		Исключение
			HTTPCore.ЗаписатьМобильнуюОшибку(
				"DataTransferHTTP | Ошибка обработки данных с сервера (Код состояния = "
				+ СтруктураДанных.КодОтветаHTTP + ").", СтруктураДанных, , ОписаниеОшибки());
			
		КонецПопытки;
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку("DataTransferHTTP | ", СтруктураДанных, , ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти