#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция УстановленныеТМЦ(
	ОбъектЭксплуатации, ВыбранныйУзел, МатериалыКОприходованию, МатериалыКСписанию, ЗаменяемыеВидыНоменклатуры) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);
	Запрос.УстановитьПараметр("МатериалыКСписанию", МатериалыКСписанию);
	Запрос.УстановитьПараметр("МатериалыКОприходованию", МатериалыКОприходованию);
	Запрос.УстановитьПараметр("ВыбранныйУзел", Справочники.УзлыОбъектовЭксплуатации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЗаменяемыеВидыНоменклатуры", ЗаменяемыеВидыНоменклатуры);
	Запрос.УстановитьПараметр("УчитыватьЗаменяемыеВидыНоменклатуры"
		, ?(ЗаменяемыеВидыНоменклатуры.Количество()> 0, Истина, Ложь));

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Объект КАК ОбъектЭксплуатации,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Узел КАК Узел,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Номенклатура КАК Номенклатура,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Характеристика КАК Характеристика,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Серия КАК Серия,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрСведений.Мечел_ТМЦВЭксплуатацииСписанныеНаРасходы.СрезПоследних(
	|			,
	|			Объект = &ОбъектЭксплуатации
	|				И ВЫБОР
	|					КОГДА &ВыбранныйУзел = ЗНАЧЕНИЕ(Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ &ВыбранныйУзел = Узел
	|				КОНЕЦ) КАК Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(МатериалыКСписанию.ЗаменаНоменклатура КАК Справочник.Номенклатура) КАК ЗаменаНоменклатура,
	|	ВЫРАЗИТЬ(МатериалыКСписанию.ЗаменаХарактеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК ЗаменаХарактеристика,
	|	ВЫРАЗИТЬ(МатериалыКСписанию.ЗаменаСерия КАК Справочник.СерииНоменклатуры) КАК ЗаменаСерия,
	|	ВЫРАЗИТЬ(МатериалыКСписанию.Факт КАК ЧИСЛО(15, 2)) КАК Факт
	|ПОМЕСТИТЬ вт_МатериалыКСписанию
	|ИЗ
	|	&МатериалыКСписанию КАК МатериалыКСписанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_МатериалыКСписанию.ЗаменаНоменклатура КАК ЗаменаНоменклатура,
	|	вт_МатериалыКСписанию.ЗаменаХарактеристика КАК ЗаменаХарактеристика,
	|	вт_МатериалыКСписанию.ЗаменаСерия КАК ЗаменаСерия,
	|	СУММА(вт_МатериалыКСписанию.Факт) КАК Факт
	|ПОМЕСТИТЬ вт_МатериалыКСписаниюСводная
	|ИЗ
	|	вт_МатериалыКСписанию КАК вт_МатериалыКСписанию
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_МатериалыКСписанию.ЗаменаНоменклатура,
	|	вт_МатериалыКСписанию.ЗаменаХарактеристика,
	|	вт_МатериалыКСписанию.ЗаменаСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Количество КАК ЧИСЛО(15, 3)) КАК Количество
	|ПОМЕСТИТЬ вт_МатериалыКОприходованию
	|ИЗ
	|	&МатериалыКОприходованию КАК МатериалыКОприходованию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_МатериалыКОприходованию.Номенклатура КАК Номенклатура,
	|	вт_МатериалыКОприходованию.Характеристика КАК Характеристика,
	|	вт_МатериалыКОприходованию.Серия КАК Серия,
	|	СУММА(вт_МатериалыКОприходованию.Количество) КАК Количество
	|ПОМЕСТИТЬ вт_МатериалыКОприходованиюСводная
	|ИЗ
	|	вт_МатериалыКОприходованию КАК вт_МатериалыКОприходованию
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_МатериалыКОприходованию.Номенклатура,
	|	вт_МатериалыКОприходованию.Характеристика,
	|	вт_МатериалыКОприходованию.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Остатки.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
	|	вт_Остатки.Узел КАК Узел,
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	вт_Остатки.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.Код КАК Код,
	|	вт_Остатки.Характеристика КАК Характеристика,
	|	вт_Остатки.Серия КАК Серия,
	|	СУММА(вт_Остатки.Количество - ЕСТЬNULL(вт_МатериалыКСписаниюСводная.Факт, 0) - ЕСТЬNULL(вт_МатериалыКОприходованиюСводная.Количество, 0)) КАК Количество
	|ИЗ
	|	вт_Остатки КАК вт_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_МатериалыКСписаниюСводная КАК вт_МатериалыКСписаниюСводная
	|		ПО вт_Остатки.Номенклатура = вт_МатериалыКСписаниюСводная.ЗаменаНоменклатура
	|			И вт_Остатки.Характеристика = вт_МатериалыКСписаниюСводная.ЗаменаХарактеристика
	|			И вт_Остатки.Серия = вт_МатериалыКСписаниюСводная.ЗаменаСерия
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_МатериалыКОприходованиюСводная КАК вт_МатериалыКОприходованиюСводная
	|		ПО вт_Остатки.Номенклатура = вт_МатериалыКОприходованиюСводная.Номенклатура
	|			И вт_Остатки.Характеристика = вт_МатериалыКОприходованиюСводная.Характеристика
	|			И вт_Остатки.Серия = вт_МатериалыКОприходованиюСводная.Серия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО вт_Остатки.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &УчитыватьЗаменяемыеВидыНоменклатуры
	|				ТОГДА НЕ СпрНоменклатура.ВидНоменклатуры В ИЕРАРХИИ (&ЗаменяемыеВидыНоменклатуры)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Остатки.ОбъектЭксплуатации,
	|	вт_Остатки.Узел,
	|	вт_Остатки.Номенклатура,
	|	вт_Остатки.Характеристика,
	|	вт_Остатки.Серия,
	|	СпрНоменклатура.ВидНоменклатуры,
	|	СпрНоменклатура.Код
	|
	|ИМЕЮЩИЕ
	|	СУММА(вт_Остатки.Количество - ЕСТЬNULL(вт_МатериалыКСписаниюСводная.Факт, 0) - ЕСТЬNULL(вт_МатериалыКОприходованиюСводная.Количество, 0)) > 0";

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();

КонецФункции

Функция СостояниеВыполнениеОперации(ВыполнениеОперации) Экспорт

	ФлагиВыполнения = Новый Массив;
	ФлагиВыполнения.Добавить("""Да""");
	ФлагиВыполнения.Добавить("""Нет""");
	Возврат ?(ФлагиВыполнения.Найти(ВыполнениеОперации) = Неопределено, Ложь, Истина);

КонецФункции

// Выбрать изменения (регистрация) документа 
//
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Результат запроса.
//
Функция ВыбратьИзменения() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	мп_ЗаданиеНаРемонтИзменения.Ссылка КАК Ссылка,
	|	мп_ЗаданиеНаРемонт.ЗаказНаРемонт.УИД КАК ЗаказНаРемонтУИД
	|ИЗ
	|	Документ.мп_ЗаданиеНаРемонт.Изменения КАК мп_ЗаданиеНаРемонтИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_ЗаданиеНаРемонт КАК мп_ЗаданиеНаРемонт
	|		ПО мп_ЗаданиеНаРемонтИзменения.Ссылка = мп_ЗаданиеНаРемонт.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли