#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Ошибки = Неопределено;
	
	АдминТОиР = РольДоступна("мп_АдминистрированиеТОиР");
	Если АдминТОиР Тогда
		Возврат;
	КонецЕсли;
	
	СписокОшибок = ЗапретПроведения();
	
	ПС = Символы.ПС;
	Таб = " ~";
	
	//Если СписокОшибок.МатериалыКОприходованию Тогда
	//	ОшибкаМатериалыКОприходованию = "Ошибки в оприходовании:";
	//	Для Каждого СтрОшибка Из СписокОшибок.ОшибкиОприходования Цикл
	//		ОшибкаМатериалыКОприходованию = ОшибкаМатериалыКОприходованию +ПС + Таб + СтрОшибка;
	//	КонецЦикла;
	//	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ОшибкаМатериалыКОприходованию);
	//КонецЕсли;
	
	Если СписокОшибок.НетВидПроверки Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Укажите вид проверки");
	КонецЕсли;
	
	Если СписокОшибок.НетРезультатПроверки Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Укажите результат проверки");
	КонецЕсли;

	Если СписокОшибок.НетЗаменыНоменклатуры Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Укажите заменяемую номенклатуру в материалах для списания:");
		Для Каждого ТекСтрока Из СписокОшибок.НоменклатураДляЗамены Цикл
			СтрОшибка = Таб +ТекСтрока;
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , СтрОшибка);
		КонецЦикла;
	КонецЕсли;
	
	Если Не СписокОшибок.ЕстьФото Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Прикрепите фото");
	КонецЕсли;

	Если Не Ошибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НарядНаРемонтВызовСервераЛокализация.ПроверкаСтатусаНарядаНаРемонт(Ссылка);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ЭтотОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ВыполнениеОперации = "";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапретПроведения()
	СписокОшибок = Новый Структура;
	СписокОшибок.Вставить("НетВидПроверки", Ложь);
	
	Если ЗначениеЗаполнено(НаименованиеРабот)  Тогда
		Мечел_ИзмерениеОбязательно = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НаименованиеРабот, "Мечел_ИзмерениеОбязательно");
		Если Мечел_ИзмерениеОбязательно Тогда
			СписокОшибок.НетВидПроверки = Не ЗначениеЗаполнено(ВидПроверки);
		КонецЕсли;
	КонецЕсли;
	
	СписокОшибок.Вставить("НетРезультатПроверки", Ложь);
	Если ЗначениеЗаполнено(ВидПроверки) Тогда
		СписокОшибок.НетРезультатПроверки = Не РезультатПроверки;
	КонецЕсли;

	ЗаменяемыеВидыНоменклатуры = 
		ЗаданиеНаРемонтВызовСервераЛокализация.ЗаменяемыеВидыНоменклатуры();
	СписокОшибок.Вставить("НетЗаменыНоменклатуры", Ложь);
	Если ЗаменяемыеВидыНоменклатуры.Количество() Тогда
		Результат = НоменклатураБезЗамены(ЗаменяемыеВидыНоменклатуры);
		СписокОшибок.НетЗаменыНоменклатуры = Не Результат.Пустой();
		НоменклатураДляЗамены = Новый Массив;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоменклатураДляЗамены.Добавить(Выборка.Номенклатура);
		КонецЦикла;
		СписокОшибок.Вставить("НоменклатураДляЗамены", НоменклатураДляЗамены);
	КонецЕсли;
	
	СписокОшибок.Вставить("ЕстьФото", ЕстьФото());

	//Результат = ПроверкаМатериаловКОприходованию();
	//
	//СписокОшибок.Вставить("МатериалыКОприходованию", Не Результат.Пустой());
	//ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ОшибкиОприходования = Новый Массив;
	//Пока ВыборкаНоменклатура.Следующий() Цикл
	//	
	//	ИмяНоменклатуры = СокрЛП(ВыборкаНоменклатура.Номенклатура.Наименование);
	//	ОшибкиСтроки = Новый Массив;
	//	ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		ОшибкиСтроки.Добавить(ВыборкаДетальныеЗаписи.Ошибка);
	//	КонецЦикла;
	//	ОшибкиОприходования.Добавить(ИмяНоменклатуры 
	//		+ ":  " +СтрСоединить(ОшибкиСтроки, ", "));
	//КонецЦикла;
	
	//СписокОшибок.Вставить("ОшибкиОприходования", ОшибкиОприходования);
	
	Возврат СписокОшибок;

КонецФункции

Функция ЕстьФото()

	Если Не ФотоотчетОбязателен Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фотографии.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Фотографии.УдалитьСтроку КАК УдалитьСтроку
	|ПОМЕСТИТЬ вт_Фотографии
	|ИЗ
	|	&Фотографии КАК Фотографии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьФото
	|ИЗ
	|	вт_Фотографии КАК вт_Фотографии
	|ГДЕ
	|	НЕ вт_Фотографии.УдалитьСтроку";
	
	Запрос.УстановитьПараметр("Фотографии", Фотографии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

Функция НоменклатураБезЗамены(ЗаменяемыеВидыНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаменяемыеВидыНоменклатуры", ЗаменяемыеВидыНоменклатуры);
	Запрос.УстановитьПараметр("ТЗСписаниеМатериалов", МатериалыКСписанию);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Склад КАК Справочник.Склады) КАК Склад,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.ЗаменаНоменклатура КАК Справочник.Номенклатура) КАК ЗаменаНоменклатура,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.ЗаменаХарактеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК ЗаменаХарактеристика,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.ЗаменаСерия КАК Справочник.СерииНоменклатуры) КАК ЗаменаСерия,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.План КАК ЧИСЛО(15, 3)) КАК План,
	|	ВЫРАЗИТЬ(ТЗСписаниеМатериало.Факт КАК ЧИСЛО(15, 3)) КАК Факт
	|ПОМЕСТИТЬ вт_СписаниеМатериалов
	|ИЗ
	|	&ТЗСписаниеМатериалов КАК ТЗСписаниеМатериало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(вт_СписаниеМатериалов.Номенклатура) КАК Номенклатура
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_СписаниеМатериалов КАК вт_СписаниеМатериалов
	|		ПО ВидыНоменклатуры.Ссылка = вт_СписаниеМатериалов.Номенклатура.ВидНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.Ссылка В(&ЗаменяемыеВидыНоменклатуры)
	|	И вт_СписаниеМатериалов.ЗаменаНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";

	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе

	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли

