////////////////////////////////////////////////////////////////////////////////
// ОбменСервер: Обмен данными с центральной базой
// Copyright (c) 2023, ООО "Мечел-Инфотех"
// Все права защищены.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ИдентификацияПользователяОС

 Функция Идентификация(ПараметрыВхода) Экспорт
	
	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();
	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
	Если ПараметрыПодключения = Неопределено Тогда
		HTTPCore.ЗаписатьМобильнуюОшибку("ОбменСервер.Регистрация | Не заполнены параметры подключения.",
			СтруктураДанных);
		
	КонецЕсли;
	
	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
	СтруктураДанных.ИдентификацияПользователя = ПараметрыВхода;
	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);
	
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	HTTPExchange.DataTransferHTTP("identification", СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Регистрация

Функция Регистрация(СписокОбновленийДанных = Неопределено) Экспорт

	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();
	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
	Если ПараметрыПодключения = Неопределено Тогда
		HTTPCore.ЗаписатьМобильнуюОшибку("ОбменСервер.Регистрация | Не заполнены параметры подключения.",
			СтруктураДанных);
		
	КонецЕсли;
	
	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
	СтруктураДанных.СписокОбновленийДанных = СписокОбновленийДанных;
	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
	СтруктураДанных.ПользователиМП = Справочники.Пользователи.АктуальныеПользователиМП();
	СтруктураДанных.ДанныеПользователя = Справочники.Пользователи.ДанныеПользователя();
	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);
	
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	ФункцияHTTP = "registration";
	HTTPExchange.DataTransferHTTP(ФункцияHTTP, СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	Если НЕ Константы.ID.Получить() = СтруктураДанных.ИнформацияОбУстройстве["ID"] Тогда
		Константы.ID.Установить(СтруктураДанных.ИнформацияОбУстройстве["ID"]);
		
	КонецЕсли;
	УИДУзелОбменаОстатков = СтруктураДанных.ПланОбменаОстатки.УИДУзелОбменаОстатков;
	
	Если НЕ Константы.УИДУзелОбменаОстатков.Получить() = УИДУзелОбменаОстатков Тогда
		Константы.УИДУзелОбменаОстатков.Установить(УИДУзелОбменаОстатков);
		
	КонецЕсли;
	
	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ИнициализацияПланаОбмена(СтруктураДанных);

	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	ПрочитатьПакетСервер(СтруктураДанных, ФункцияHTTP);
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	Если НЕ Справочники.Пользователи.ЕстьПользователиВБазе() Тогда
		HTTPCore.ЗаписатьОшибкуВЖурналСтрокой(
			"ОбменСервер.Регистрация", "Не смог загрузить пользователей. Повторите процедуру регистрации.");
		Возврат Ложь;
		
	КонецЕсли;
	
	Константы.ДатаПоследнейСинхронизации.Установить(ТекущаяДатаСеанса());
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Синхронизация

Функция Синхронизация(ГруппаСкладов = Неопределено) Экспорт

	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();

	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
	
	Если ПараметрыПодключения = Неопределено Тогда
		HTTPCore.ЗаписатьМобильнуюОшибку("Синхронизация | Не заполнены параметры подключения.", СтруктураДанных);
	КонецЕсли;
	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
	СтруктураДанных.ПараметрыСинхронизации = ОбщегоНазначенияСервер.ПараметрыСинхронизации();
	СтруктураДанных.ПользователиМП = Справочники.Пользователи.АктуальныеПользователиМП();
	СтруктураДанных.ДанныеПользователя = Справочники.Пользователи.ДанныеПользователя();
	
	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	Результат = ОтправитьДанныеНаСервер(СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
	
	Константы.ДатаПоследнейСинхронизации.Установить(ТекущаяДатаСеанса());
	Константы.ОшибкаСинхронизацииДокументов.Установить(Не Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ОбновлениеОстатков(ФункцияHTTP) Экспорт
	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();
	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
	
	Если ПараметрыПодключения = Неопределено Тогда
		HTTPCore.ЗаписатьМобильнуюОшибку("ОбменСервер.ОбновлениеОстатковТМЦ | Не заполнены параметры подключения.",
			СтруктураДанных);
	КонецЕсли;

	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
	СтруктураДанных.ПараметрыСинхронизации = ОбщегоНазначенияСервер.ПараметрыСинхронизации();
	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);
	
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
	КонецЕсли;
	HTTPExchange.DataTransferHTTP(ФункцияHTTP, СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	//Если НЕ Константы.ID.Получить() = СтруктураДанных.ИнформацияОбУстройстве["ID"] Тогда
	//	Константы.ID.Установить(СтруктураДанных.ИнформацияОбУстройстве["ID"]);
	//	
	//КонецЕсли;
	
	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПрочитатьПакетСервер(СтруктураДанных, ФункцияHTTP);
	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	Если НЕ Справочники.Пользователи.ЕстьПользователиВБазе() Тогда
		HTTPCore.ЗаписатьОшибкуВЖурналСтрокой(
			"ОбменСервер.updateinformationregisters", "Не смог загрузить пользователей. Повторите процедуру регистрации.");
		Возврат Ложь;
		
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ОбновлениеНоменклатуры() Экспорт
//	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();
//	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
//	Если ПараметрыПодключения = Неопределено Тогда
//		HTTPCore.ЗаписатьМобильнуюОшибку("ОбменСервер.Регистрация | Не заполнены параметры подключения.",
//			СтруктураДанных);
//	КонецЕсли;

//	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
//	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
//	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
//	СтруктураДанных.ПараметрыСинхронизации = ОбщегоНазначенияСервер.ПараметрыСинхронизации();
//	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);
//	
//	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
//		Возврат Ложь;
//		
//	КонецЕсли;
//	ФункцияHTTP = "updatecatalogs";
//	HTTPExchange.DataTransferHTTP(ФункцияHTTP, СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
//	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
//		Возврат Ложь;
//		
//	КонецЕсли;
//	
//	Если НЕ Константы.ID.Получить() = СтруктураДанных.ИнформацияОбУстройстве["ID"] Тогда
//		Константы.ID.Установить(СтруктураДанных.ИнформацияОбУстройстве["ID"]);
//		
//	КонецЕсли;
//	
//	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
//	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
//		Возврат Ложь;
//		
//	КонецЕсли;
//	
//	ПрочитатьПакетСервер(СтруктураДанных, ФункцияHTTP);
//	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
//		Возврат Ложь;
//		
//	КонецЕсли;
//	
//	Если НЕ Справочники.Пользователи.ЕстьПользователиВБазе() Тогда
//		HTTPCore.ЗаписатьОшибкуВЖурналСтрокой(
//			"ОбменСервер.Регистрация", "Не смог загрузить пользователей. Повторите процедуру регистрации.");
//		Возврат Ложь;
//		
//	КонецЕсли;
//	
////	Константы.ДатаПоследнейСинхронизации.Установить(ТекущаяДатаСеанса());
//	
//	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПроверкаСвязи

Функция ПроверкаСвязи(Знач Шаблон = "") Экспорт

	СтруктураДанных = HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных();
	ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
	Если ПараметрыПодключения = Неопределено Тогда
		HTTPCore.ЗаписатьМобильнуюОшибку("Регистрация | Не заполнены параметры подключения.", СтруктураДанных);
	КонецЕсли;

	ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ДанныеПланаОбмена(СтруктураДанных);
	СтруктураДанных.ИнформацияОбустройстве = ОбщегоНазначенияСервер.ПолучитьИнформациюОбУстройстве();
	СтруктураДанных.БазаЕРП = XmlСтрока(Константы.БазаЕРП.Получить());
	СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);

	Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(Шаблон) Тогда
		Шаблон = "echo";
	КонецЕсли;
	ЗапросHTTP = Новый HTTPЗапрос(ПараметрыПодключения["HTTP"] + "/" + Шаблон);

	Попытка

		СтрокаXML = HTTPCore.СформироватьПакетОтвета(СтруктураДанных);
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаXML);
		Если Шаблон = "echoapi" Тогда
			Ответ = СоединениеHTTP.ВызватьHTTPМетод("GET", ЗапросHTTP);
		ИначеЕсли Шаблон = "echo" Тогда
			Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		ИначеЕсли Не ПустаяСтрока(СтруктураДанных.БазаЕРП) Тогда
			Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		Иначе
			Ответ = СоединениеHTTP.ВызватьHTTPМетод("GET", ЗапросHTTP);
		КонецЕсли;
		
		Тело = Ответ.ПолучитьТелоКакСтроку();
		Если Не Ответ = Неопределено Тогда
			Если ТипЗнч(Ответ) = Тип("HTTPОтвет")  Тогда
				Если Не Ответ.КодСостояния = 200 Тогда
					HTTPCore.ЗаписатьИнформациюВЖурналСтрокой(
						"ОбменСервер.ПроверкаСвязи", "Код состояния = " + Ответ.КодСостояния + Символы.ПС + Тело);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Сообщить(Строка(ОписаниеОшибки()));
		Если Не Ответ = Неопределено Тогда
			HTTPCore.ЗаписатьМобильнуюОшибку(
				"ОбменСервер.ПроверкаСвязи | Ошибка обработки данных с сервера. Код состояния = " + Ответ.КодСостояния,
				СтруктураДанных, , ОписаниеОшибки());
		Иначе
			HTTPCore.ЗаписатьМобильнуюОшибку(
				"ОбменСервер.ПроверкаСвязи | Ошибка обработки данных с сервера. Код состояния = " + "неизвестный код",
				СтруктураДанных, , ОписаниеОшибки());
		КонецЕсли;
	КонецПопытки;
	
	Если НЕ Ответ.КодСостояния = 200 Тогда

		Возврат Ложь;

	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РеквизитСправочникаПоУИД(Знач ИмяСправочника, Знач ЗначениеРеквизита)

	Элемент = Справочники[ИмяСправочника].ПолучитьСсылку(
		Новый УникальныйИдентификатор(ЗначениеРеквизита));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Элемент);
	Если Не СсылкаСуществует Тогда
		Элемент = Справочники[ИмяСправочника].ПустаяСсылка();
	КонецЕсли;
	Возврат Элемент;

КонецФункции

Функция РеквизитДокументаПоУИД(Знач ИмяДокумента, Знач ЗначениеРеквизита)

	Элемент = Документы[ИмяДокумента].ПолучитьСсылку(
		Новый УникальныйИдентификатор(ЗначениеРеквизита));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Элемент);
	Если Не СсылкаСуществует Тогда
		Элемент = Документы[ИмяДокумента].ПустаяСсылка();
	КонецЕсли;
	Возврат Элемент;

КонецФункции

Функция ТаблицаЗначенийИзДвоичныхДанных(ОбъектXDTO, ИмяЭлемента)
	ДвоичныеДанные = Base64Значение(ОбъектXDTO[ИмяЭлемента]);
	РезультатСтрBase64 = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные,"UTF-8");
	РезультатХранилище = XMLЗначение(Тип("ХранилищеЗначения"), РезультатСтрBase64);
	ТЗРезультат = РезультатХранилище.Получить();
	Возврат ТЗРезультат;
	
КонецФункции

Функция ОтправитьДанныеНаСервер(СтруктураДанных, СоединениеHTTP, ПараметрыПодключения)
	
	ВыгрузкаПрошлаБезОшибок = Истина;
	
	РезультатНаработкиЭксплуатации = Документы.НаработкаОбъектовЭксплуатации.ВыбратьИзменения();
	ОтправитьДанныеНаСерверОбработкаРезультатов(
		СтруктураДанных, СоединениеHTTP, ПараметрыПодключения, ВыгрузкаПрошлаБезОшибок, РезультатНаработкиЭксплуатации);
		
	РезультатРегистрацияПроверокОборудования = Документы.мп_РегистрацияПроверокОборудования.ВыбратьИзменения();
	ОтправитьДанныеНаСерверОбработкаРезультатов(
		СтруктураДанных, СоединениеHTTP, ПараметрыПодключения, ВыгрузкаПрошлаБезОшибок, РезультатРегистрацияПроверокОборудования);
		
	РегистрацияДефекта = Документы.РегистрацияДефекта.ВыбратьИзменения();
	ОтправитьДанныеНаСерверОбработкаРезультатов(
		СтруктураДанных, СоединениеHTTP, ПараметрыПодключения, ВыгрузкаПрошлаБезОшибок, РегистрацияДефекта);
		
	ЗаданиеНаРемонт = Документы.мп_ЗаданиеНаРемонт.ВыбратьИзменения();
	ОтправитьДанныеНаСерверОбработкаРезультатов(
		СтруктураДанных, СоединениеHTTP, ПараметрыПодключения, ВыгрузкаПрошлаБезОшибок, ЗаданиеНаРемонт);
		
	НарядНаРемонт = Документы.мп_НарядНаРемонт.ВыбратьИзменения();
	ОтправитьДанныеНаСерверОбработкаРезультатов(
		СтруктураДанных, СоединениеHTTP, ПараметрыПодключения, ВыгрузкаПрошлаБезОшибок, НарядНаРемонт);
	
	Если ВыгрузкаПрошлаБезОшибок Тогда
		HTTPCore.ОчиститьСодержимоеПакетов(СтруктураДанных);
		
		ЗаписатьПакетКлиент(СтруктураДанных);
		Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
			ВыгрузкаПрошлаБезОшибок = Ложь;
			Возврат ВыгрузкаПрошлаБезОшибок;
		КонецЕсли;
		ФункцияHTTP = "dataformobile";
		HTTPExchange.DataTransferHTTP(ФункцияHTTP, СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
		Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
			HTTPCore.ЗаписатьОшибкиВЖурнал(СтруктураДанных);
			ВыгрузкаПрошлаБезОшибок = Ложь;
		КонецЕсли;
		
		Если СтруктураДанных.КодОтветаHTTP = 200 Тогда
 			ПрочитатьПакетСервер(СтруктураДанных, ФункцияHTTP);
		КонецЕсли;
		
	КонецЕсли;

	Возврат ВыгрузкаПрошлаБезОшибок;

КонецФункции

Процедура ОтправитьДанныеНаСерверОбработкаРезультатовПачкой(
		СтруктураДанных,
		Знач СоединениеHTTP,
		Знач ПараметрыПодключения,
		ВыгрузкаПрошлаБезОшибок,
		РезультатЗапроса,
		ОтветДляКИС = Ложь)
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		ОбъектыОтвета = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		HTTPCore.ОчиститьСодержимоеПакетов(СтруктураДанных);
			
		ЗаписатьПакетКлиентПачкой(СтруктураДанных, ОбъектыОтвета, ОтветДляКИС);
		Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
			ВыгрузкаПрошлаБезОшибок = Ложь;
			Возврат;
		КонецЕсли;
		ФункцияHTTP = "synchronization";
		HTTPExchange.DataTransferHTTP(ФункцияHTTP, СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
		Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
			HTTPCore.ЗаписатьОшибкиВЖурнал(СтруктураДанных);
			ВыгрузкаПрошлаБезОшибок = Ложь;
			
		КонецЕсли;
			
		Если СтруктураДанных.КодОтветаHTTP = 200 Тогда
			
			УзелОбмена = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ОбъектыОтвета);
			
			ПрочитатьПакетСервер(СтруктураДанных, ФункцияHTTP);
			
		КонецЕсли;

		Если ВыгрузкаПрошлаБезОшибок Тогда
			Попытка
				ЭтотУзел = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ЭтотУзел();
				УзелОбъект = ЭтотУзел.ПолучитьОбъект();
				УзелОбъект.ДатаВремяПоследнегоОбмена = ТекущаяДатаСеанса();
				УзелОбъект.Записать();
			Исключение
				
			КонецПопытки;
		КонецЕсли;

КонецПроцедуры

Процедура ОтправитьДанныеНаСерверОбработкаРезультатов(
		СтруктураДанных,
		Знач СоединениеHTTP,
		Знач ПараметрыПодключения,
		ВыгрузкаПрошлаБезОшибок,
		РезультатЗапроса)
	
	Если РезультатЗапроса.Пустой() Тогда
		
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			HTTPCore.ОчиститьСодержимоеПакетов(СтруктураДанных);
			
			ЗаписатьПакетКлиент(СтруктураДанных, Выборка.Ссылка);
			Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
				ВыгрузкаПрошлаБезОшибок = Ложь;
				Продолжить;
				
			КонецЕсли;
			ФункцияHTTP = "synchronization";
			HTTPExchange.DataTransferHTTP(ФункцияHTTP, СтруктураДанных, СоединениеHTTP, ПараметрыПодключения);
			Если HTTPCore.ЕстьОшибка(СтруктураДанных) Тогда
				HTTPCore.ЗаписатьОшибкиВЖурнал(СтруктураДанных);
				ВыгрузкаПрошлаБезОшибок = Ложь;
				
			КонецЕсли;
			
			Если СтруктураДанных.КодОтветаHTTP = 200 Тогда
		//		ПрочитатьПакетСервер(СтруктураДанных, ФункцияHTTP);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВыгрузкаПрошлаБезОшибок Тогда
			ВыгруженВКИС = Перечисления.мп_СтатусыОбмена.ВыгруженВКИС;
			Попытка
				УзелОбмена = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
				ВыгруженныеДокументы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
				
				Для Каждого ВыгруженныйДокумент Из ВыгруженныеДокументы Цикл
					ДокументОбъект = ВыгруженныйДокумент.ПолучитьОбъект();
					ТипДокумента = ТипЗнч(ДокументОбъект);
					Если ТипДокумента = Тип("ДокументОбъект.НаработкаОбъектовЭксплуатации") Тогда
						ДокументОбъект.мп_СтатусОбмена = ВыгруженВКИС;
					ИначеЕсли ТипДокумента = Тип("ДокументОбъект.мп_РегистрацияПроверокОборудования") Тогда
						ДокументОбъект.СтатусОбмена = ВыгруженВКИС;
					ИначеЕсли ТипДокумента = Тип("ДокументОбъект.РегистрацияДефекта") Тогда
						ДокументОбъект.СтатусОбмена = ВыгруженВКИС;
					ИначеЕсли ТипДокумента = Тип("ДокументОбъект.мп_ЗаданиеНаРемонт") Тогда
						ДокументОбъект.СтатусОбмена = ВыгруженВКИС;
					ИначеЕсли ТипДокумента = Тип("ДокументОбъект.мп_НарядНаРемонт") Тогда
						ДокументОбъект.СтатусОбмена = ВыгруженВКИС;
					КонецЕсли;
					ДокументОбъект.ОбменДанными.Загрузка = Истина;
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЦикла;
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ВыгруженныеДокументы);
				УзелОбмена = УзелОбмена.ПолучитьОбъект();
				УзелОбмена.ДатаВремяПоследнегоОбмена = ТекущаяДатаСеанса();
				УзелОбмена.Записать();
			Исключение
				
			КонецПопытки;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры


#Область ЧтениеЗаписьПакетов

Процедура ЗаписатьНастройкиВидовНаоменклатуры(ТаблицаНастроекВидыНоменклатуры)

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ТаблицаНастроекВидыНоменклатуры", ТаблицаНастроекВидыНоменклатуры);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНастроекВидыНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ТаблицаНастроекВидыНоменклатуры.КодНастройки КАК КодНастройки,
	|	ТаблицаНастроекВидыНоменклатуры.УИДНастройки КАК УИДНастройки,
	|	ТаблицаНастроекВидыНоменклатуры.ВерсияДанныхЕРП КАК ВерсияДанныхЕРП
	|ПОМЕСТИТЬ вт_таблица
	|ИЗ
	|	&ТаблицаНастроекВидыНоменклатуры КАК ТаблицаНастроекВидыНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_таблица.КодНастройки КАК Код,
	|	вт_таблица.КодНастройки КАК Наименование,
	|	вт_таблица.УИДНастройки КАК УИДНастройки,
	|	вт_таблица.ВерсияДанныхЕРП КАК ВерсияДанныхЕРП
	|ИЗ
	|	вт_таблица КАК вт_таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_таблица.ВидНоменклатуры КАК ВидНоменклатуры,
	|	вт_таблица.КодНастройки КАК Код,
	|	вт_таблица.КодНастройки КАК Наименование,
	|	вт_таблица.УИДНастройки КАК УИДНастройки,
	|	вт_таблица.ВерсияДанныхЕРП КАК ВерсияДанныхЕРП
	|ИЗ
	|	вт_таблица КАК вт_таблица";

	ПакетРезультатов = Запрос.ВыполнитьПакет();

	ИндексПоследнегоПакета = ПакетРезультатов.ВГраница();
	
	РезультатЗапросаТаблица = ПакетРезультатов[ИндексПоследнегоПакета];
	ВыборкаТаблица = РезультатЗапросаТаблица.Выбрать();
	
	РезультатКоды = ПакетРезультатов[ИндексПоследнегоПакета - 1];
	Выборка = РезультатКоды.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СсылкаНастройки = Справочники.ОбщиеНастройки.НайтиПоКоду(Выборка.Код);
		Если ЗначениеЗаполнено(СсылкаНастройки) Тогда
			Если СсылкаНастройки.ВерсияДанныхЕРП = Выборка.ВерсияДанныхЕРП Тогда
				Продолжить;
			КонецЕсли;

			НастройкиОбъект = СсылкаНастройки.ПолучитьОбъект();
		Иначе
			НастройкиОбъект = Справочники.ОбщиеНастройки.СоздатьЭлемент();
		КонецЕсли;
		
		ОтборПоКодам = Новый Структура;
		ОтборПоКодам.Вставить("Код", Выборка.Код);
		ОтборПоКодам.Вставить("УИДНастройки", Выборка.УИДНастройки);
		ОтборПоКодам.Вставить("ВерсияДанныхЕРП", Выборка.ВерсияДанныхЕРП);
		СписокВидовНоменклатуры = Новый СписокЗначений;
		ВыборкаТаблица.Сбросить();
		Пока ВыборкаТаблица.НайтиСледующий(ОтборПоКодам) Цикл
			СписокВидовНоменклатуры.Добавить(ВыборкаТаблица.ВидНоменклатуры);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(НастройкиОбъект, Выборка);
		НастройкиОбъект.ЭтоСписокЗначений = Истина;
		НастройкиОбъект.Значение = Новый ХранилищеЗначения(СписокВидовНоменклатуры);
		НастройкиОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНаработкуОЭ(ТаблицаНаработок)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗНаработка.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
	|	ТЗНаработка.Наработка КАК Наработка,
	|	ТЗНаработка.Значение КАК Значение
	|ПОМЕСТИТЬ вт_ТаблицаНаработок
	|ИЗ
	|	&ТаблицаНаработок КАК ТЗНаработка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыЭксплуатации.Ссылка КАК ОбъектЭксплуатации,
	|	ЕСТЬNULL(вт_ТаблицаНаработок.Наработка, ЗНАЧЕНИЕ(Справочник.ПоказателиНаработки.ПустаяСсылка)) КАК Наработка,
	|	ЕСТЬNULL(вт_ТаблицаНаработок.Значение, 0) КАК Значение
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТаблицаНаработок КАК вт_ТаблицаНаработок
	|		ПО (ОбъектыЭксплуатации.Ссылка = вт_ТаблицаНаработок.ОбъектЭксплуатации)
	|ИТОГИ ПО
	|	ОбъектЭксплуатации";

	Запрос.УстановитьПараметр("ТаблицаНаработок", ТаблицаНаработок);
	РезультатЗапроса = Запрос.Выполнить();
	НаработкаНаДату = ТекущаяДатаСеанса();
	ВыборкаОбъектЭксплуатации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаОбъектЭксплуатации.Следующий() Цикл
		СпрОЭ = ВыборкаОбъектЭксплуатации.ОбъектЭксплуатации.ПолучитьОбъект();
		Наработки = СпрОЭ.Наработки.Выгрузить();
		Наработки.Очистить();
		
		ВыборкаНаработка = ВыборкаОбъектЭксплуатации.Выбрать();
		
		Пока ВыборкаНаработка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаНаработка.Наработка) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Наработки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНаработка, "Наработка,Значение");
			НоваяСтрока.НаработкаНаДату = НаработкаНаДату;
		КонецЦикла;
		СпрОЭ.Наработки.Загрузить(Наработки);
		СпрОЭ.ОбменДанными.Загрузка = Истина;
		СпрОЭ.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНаработкуКлассОбъекта(ТаблицаНаработок)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗНаработка.Класс КАК Класс,
	|	ТЗНаработка.Наработка КАК Наработка
	|ПОМЕСТИТЬ вт_ТаблицаНаработок
	|ИЗ
	|	&ТаблицаНаработок КАК ТЗНаработка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассыОбъектовЭксплуатации.Ссылка КАК Класс,
	|	ЕСТЬNULL(вт_ТаблицаНаработок.Наработка, ЗНАЧЕНИЕ(Справочник.ПоказателиНаработки.ПустаяСсылка)) КАК ПоказательНаработки
	|ИЗ
	|	Справочник.КлассыОбъектовЭксплуатации КАК КлассыОбъектовЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТаблицаНаработок КАК вт_ТаблицаНаработок
	|		ПО (КлассыОбъектовЭксплуатации.Ссылка = вт_ТаблицаНаработок.Класс)
	|ИТОГИ ПО
	|	Класс";

	Запрос.УстановитьПараметр("ТаблицаНаработок", ТаблицаНаработок);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаКлассОбъекта = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаКлассОбъекта.Следующий() Цикл
		
		Класс = ВыборкаКлассОбъекта.Класс.ПолучитьОбъект();
		ПоказателиНаработки = Класс.ПоказателиНаработки.Выгрузить();
		
		ПоказателиНаработки.Очистить();
		
		ВыборкаНаработка = ВыборкаКлассОбъекта.Выбрать();
		
		Пока ВыборкаНаработка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаНаработка.ПоказательНаработки) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ПоказателиНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНаработка, "ПоказательНаработки");
		КонецЦикла;
		
		Класс.ПоказателиНаработки.Загрузить(ПоказателиНаработки);
		Класс.ОбменДанными.Загрузка = Истина;
		Класс.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьВидыПроверокКласса(ТаблицаВидыПроверок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВидыПроверок.Класс КАК Класс,
	|	ТаблицаВидыПроверок.ВидПроверокОборудования КАК ВидПроверокОборудования
	|ПОМЕСТИТЬ вт_ТаблицаВидыПроверок
	|ИЗ
	|	&ТаблицаВидыПроверок КАК ТаблицаВидыПроверок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассыОбъектовЭксплуатации.Ссылка КАК Класс,
	|	ЕСТЬNULL(вт_ТаблицаВидыПроверок.ВидПроверокОборудования, ЗНАЧЕНИЕ(Справочник.мп_ВидыПроверокОборудования.ПустаяСсылка)) КАК ВидПроверокОборудования
	|ИЗ
	|	Справочник.КлассыОбъектовЭксплуатации КАК КлассыОбъектовЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТаблицаВидыПроверок КАК вт_ТаблицаВидыПроверок
	|		ПО (КлассыОбъектовЭксплуатации.Ссылка = вт_ТаблицаВидыПроверок.Класс)
	|ИТОГИ ПО
	|	Класс";

	Запрос.УстановитьПараметр("ТаблицаВидыПроверок", ТаблицаВидыПроверок);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаКлассОбъекта = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаКлассОбъекта.Следующий() Цикл
		
		Класс = ВыборкаКлассОбъекта.Класс.ПолучитьОбъект();
		мп_ВидыПроверок = Класс.мп_ВидыПроверок.Выгрузить();
		
		мп_ВидыПроверок.Очистить();
		
		ВыборкаВидПроверки = ВыборкаКлассОбъекта.Выбрать();
		
		Пока ВыборкаВидПроверки.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаВидПроверки.ВидПроверокОборудования) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = мп_ВидыПроверок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаВидПроверки, "ВидПроверокОборудования");
		КонецЦикла;
		
		Класс.мп_ВидыПроверок.Загрузить(мп_ВидыПроверок);
		Класс.ОбменДанными.Загрузка = Истина;
		Класс.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция  КоллекцияXDTO(Элемент)
	Если ТипЗнч(Элемент)=Тип("ОбъектXDTO") Тогда
	МассивXDTO=Новый Массив;
	МассивXDTO.Добавить(Элемент);
		Возврат МассивXDTO;
	КонецЕсли;
	Возврат Элемент;
КонецФункции

Процедура ПрочитатьПакетСервер(СтруктураДанных, ФункцияHTTP) Экспорт
	
	Если СтруктураДанных.ПакетСервер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаНаработок = Новый ТаблицаЗначений;
	ТаблицаНаработок.Колонки.Добавить("ОбъектЭксплуатации",
		Новый ОписаниеТипов("СправочникСсылка.ОбъектыЭксплуатации"));
	ТаблицаНаработок.Колонки.Добавить("Наработка", Новый ОписаниеТипов("СправочникСсылка.ПоказателиНаработки"));
	ТаблицаНаработок.Колонки.Добавить("Значение", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	
	ТаблицаНаработокКлассОбъекта = Новый ТаблицаЗначений;
	ТаблицаНаработокКлассОбъекта.Колонки.Добавить("Класс",
		Новый ОписаниеТипов("СправочникСсылка.КлассыОбъектовЭксплуатации"));
	ТаблицаНаработокКлассОбъекта.Колонки.Добавить("Наработка",
		Новый ОписаниеТипов("СправочникСсылка.ПоказателиНаработки"));
	
	ТаблицаВидыПроверокКласса = Новый ТаблицаЗначений;
	ТаблицаВидыПроверокКласса.Колонки.Добавить("Класс",
		Новый ОписаниеТипов("СправочникСсылка.КлассыОбъектовЭксплуатации"));
	ТаблицаВидыПроверокКласса.Колонки.Добавить(
		"ВидПроверокОборудования", Новый ОписаниеТипов("СправочникСсылка.мп_ВидыПроверокОборудования"));
	
	ТаблицаНастроекВидыНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНастроекВидыНоменклатуры.Колонки.Добавить(
		"ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	ТаблицаНастроекВидыНоменклатуры.Колонки.Добавить(
		"КодНастройки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаНастроекВидыНоменклатуры.Колонки.Добавить(
		"УИДНастройки", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаНастроекВидыНоменклатуры.Колонки.Добавить(
		"ВерсияДанныхЕРП", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	ОстаткиПоНоменклатуре  = Неопределено;
	
	ТекущийУзел = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ЭтотУзел();
	
	ПакетСервер = СтруктураДанных.ПакетСервер;
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПакетСервер);
	
	Если ФункцияHTTP = "updatecatalogs" Тогда
		ОстаткиПоНоменклатуре = РегистрыСведений.ОстаткиПоНоменклатуре.СоздатьНаборЗаписей();
		ОстаткиПоНоменклатуре.Записать(Истина);

		ТоварыДругогоКачества = РегистрыСведений.ТоварыДругогоКачества.СоздатьНаборЗаписей();
		ТоварыДругогоКачества.Записать(Истина);
		Фабрика=Новый ФабрикаXDTO;
		ОбXDTO=Фабрика.ПрочитатьXML(ЧтениеXML);

		СвойстваОбъекта = ОбXDTO.Body.Свойства();

		Если Не СвойстваОбъекта.Получить("CatalogObject_ВидыНоменклатуры") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_ВидыНоменклатуры) Цикл
				ЗаписатьВидыНоменклатуры(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_СерииНоменклатуры") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_СерииНоменклатуры) Цикл
				ЗаписатьСерииНоменклатуры(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_УпаковкиЕдиницыИзмерения") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_УпаковкиЕдиницыИзмерения) Цикл
				ЗаписатьЕдиницыИзмерения(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_Номенклатура") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_Номенклатура) Цикл
				ЗаписатьНоменклатуру(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_ХарактеристикиНоменклатуры") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_ХарактеристикиНоменклатуры) Цикл
				ЗаписатьХарактеристикиНоменклатуры(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_Назначения") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_Назначения) Цикл
				ЗаписатьНазначения(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("Constants_ERP") = Неопределено Тогда
			СвойстваКонстант = ОбXDTO.Body.Constants_ERP.Свойства();
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.Constants_ERP) Цикл
				ИмяКонстанты = "ВидыНоменклатурыИсклИзАнализаПоИндНомерамВРН";
				Если Не СвойстваКонстант.Получить(ИмяКонстанты) = Неопределено Тогда
					ЗначениеКонстанты = ?(Объект.Получить(ИмяКонстанты) = "true", Истина, Ложь);
					Константы.ВидыНоменклатурыИсклИзАнализаПоИндНомерамВРН.Установить(ЗначениеКонстанты);
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("InformationRegisters_ОстаткиПоНоменклатуре") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.InformationRegisters_ОстаткиПоНоменклатуре) Цикл
				ЗаписатьОстаткиПоНоменклатуре(Объект, СтруктураДанных, ОстаткиПоНоменклатуре);
			КонецЦикла;
		КонецЕсли;

		// ТоварыДругогоКачества
		Если Не СвойстваОбъекта.Получить("InformationRegisters_ТоварыДругогоКачества") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.InformationRegisters_ТоварыДругогоКачества) Цикл
				ЗаписатьТоварыДругогоКачества(Объект, СтруктураДанных, ТоварыДругогоКачества);
			КонецЦикла;
		КонецЕсли;

		Если Не ОстаткиПоНоменклатуре = Неопределено Тогда
			ОстаткиПоНоменклатуре.Записать(Истина);
		КонецЕсли;

		Если Не ТоварыДругогоКачества = Неопределено Тогда
			ТоварыДругогоКачества.Записать(Истина);
		КонецЕсли;
		

		Возврат;
		
	ИначеЕсли  ФункцияHTTP = "updateinformationregisters" Тогда
		Период = ТекущаяДатаСеанса();
		Фабрика=Новый ФабрикаXDTO;
		ОбXDTO=Фабрика.ПрочитатьXML(ЧтениеXML);
		СвойстваОбъекта = ОбXDTO.Body.Свойства();
		Если Не СвойстваОбъекта.Получить("CatalogObject_ОбъектыЭксплуатации") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_ОбъектыЭксплуатации) Цикл
				ЗаписатьОбъектыЭксплуатации(Объект, СтруктураДанных);
			КонецЦикла
			
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_УзлыОбъектовЭксплуатации") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_УзлыОбъектовЭксплуатации) Цикл
				ЗаписатьУзелОбъектовЭксплуатации(Объект, СтруктураДанных);
			КонецЦикла
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_Номенклатура") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_Номенклатура) Цикл
				ЗаписатьНоменклатуру(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_ХарактеристикиНоменклатуры") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_ХарактеристикиНоменклатуры) Цикл
				ЗаписатьХарактеристикиНоменклатуры(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;
		
		Если Не СвойстваОбъекта.Получить("CatalogObject_СерииНоменклатуры") = Неопределено Тогда
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.CatalogObject_СерииНоменклатуры) Цикл
				ЗаписатьСерииНоменклатуры(Объект, СтруктураДанных);
			КонецЦикла;
		КонецЕсли;

		Если Не СвойстваОбъекта.Получить("InformationRegisters_Мечел_ТМЦВЭксплуатацииСписанныеНаРасходы") = Неопределено Тогда
			НаборТМЦ = РегистрыСведений.Мечел_ТМЦВЭксплуатацииСписанныеНаРасходы.СоздатьНаборЗаписей();
			НаборТМЦ.Записать(Истина);
			Для Каждого Объект Из КоллекцияXDTO(ОбXDTO.Body.InformationRegisters_Мечел_ТМЦВЭксплуатацииСписанныеНаРасходы) Цикл
				ЗаписатьНаборТМЦ(Объект, СтруктураДанных, НаборТМЦ, Период);
			КонецЦикла;
			НаборТМЦ.Записать(Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ОбновлялиРегистрацияДефекта = Ложь;
	Попытка
		
		ЧтениеСообщение = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщение.НачатьЧтение(ЧтениеXML);
		Пока 
			ВозможностьЧтенияXML(ЧтениеXML)
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.Мечел_ДефектыОборудования"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.Мечел_ТехнологическиеМеста"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.ПоказателиНаработки"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.КлассыОбъектовЭксплуатации"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.ОбъектыЭксплуатации"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.НаработкиОбъектовЭксплуатации"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.УзлыОбъектовЭксплуатации"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.Склады"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.ВидыДефектов"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.Мечел_ПричиныСостоянияОборудования"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.Мечел_ВидыСостоянияОборудования"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.Мечел_ПричиныОтменыРемонтов"

			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.ТехнологическиеОперации"

			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.Организации"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.ВидыРемонтов"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.ФизическиеЛица"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "DocumentObject.НаработкаОбъектовЭксплуатации"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "DocumentObject.мп_РегистрацияПроверокОборудования"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "DocumentObject.РегистрацияДефекта"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "DocumentObject.мп_ЗаданиеНаРемонт"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "DocumentObject.мп_НарядНаРемонт"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.НаработкиКлассов"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.мп_ВидыПроверокКлассов"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.мп_ВидыПроверокОборудования"
			
			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.ЗаписатьОбщиеВидыРемонтов"

			ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "CatalogObject.СтруктураПредприятия" Цикл
			
			Если ЧтениеXML.Имя = "CatalogObject.СтруктураПредприятия" Тогда
				ЗаписатьСтруктураПредприятия(ЧтениеXML, СтруктураДанных);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Склады" Тогда
				ЗаписатьСкладСИерархией(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ВидыДефектов" Тогда
				ЗаписатьВидыДефектов(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Мечел_ПричиныСостоянияОборудования" Тогда
				ЗаписатьПричиныСостоянияОборудования(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Мечел_ВидыСостоянияОборудования" Тогда
				ЗаписатьВидыСостоянияОборудования(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Мечел_ПричиныОтменыРемонтов" Тогда
				ЗаписатьПричиныОтменыРемонтов(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ТехнологическиеОперации" Тогда
				ЗаписатьТехнологическиеОперации(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Мечел_ДефектыОборудования" Тогда
				ЗаписатьДефектыОборудования(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ПоказателиНаработки" Тогда
				ЗаписатьПоказателиНаработки(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.КлассыОбъектовЭксплуатации" Тогда
				ЗаписатьКлассыОбъектовЭксплуатации(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.НаработкиКлассов" Тогда
				ЗаписатьНаработкуКлассов(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель, ТаблицаНаработокКлассОбъекта);

			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.мп_ВидыПроверокКлассов" Тогда
				ЗаписатьВидыПроверокКлассов(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель, ТаблицаВидыПроверокКласса);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.мп_ВидыПроверокОборудования" Тогда
				ЗаписатьВидыПроверокОборудования(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ОбщиеВидыРемонтов" Тогда
				ЗаписатьОбщиеВидыРемонтов(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ВидыРемонтов" Тогда
				ЗаписатьВидыРемонтов(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ОбъектыЭксплуатации" Тогда
				ЗаписатьОбъектыЭксплуатации(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.НаработкиОбъектовЭксплуатации" Тогда
				ЗаписатьНаработкуОбъектовЭксплуатации(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель, ТаблицаНаработок);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.УзлыОбъектовЭксплуатации" Тогда
				ЗаписатьУзелОбъектовЭксплуатации(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
			
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Мечел_ТехнологическиеМеста" Тогда
				ЗаписатьТехнологическиеМеста(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);

			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Организации" Тогда
				ЗаписатьОрганизацию(ЧтениеXML, СтруктураДанных);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Пользователи" Тогда
				ЗаписатьПользователей(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ФизическиеЛица" Тогда
				ЗаписатьФизическихЛиц(ЧтениеXML, СтруктураДанных);

			ИначеЕсли ЧтениеXML.Имя = "DocumentObject.НаработкаОбъектовЭксплуатации" Тогда
				Если ФункцияHTTP = "synchronization" Тогда
					ОбновитьНаработкуОбъектаЭксплуатации(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				КонецЕсли;
				
			ИначеЕсли ЧтениеXML.Имя = "DocumentObject.мп_РегистрацияПроверокОборудования" Тогда
				Если ФункцияHTTP = "synchronization" Тогда
					ОбновитьРегистрациюПроверокОборудования(ЧтениеXML, СтруктураДанных, ЧтениеСообщение.Отправитель);
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ВидыНоменклатуры" Тогда
				Если ФункцияHTTP = "dataformobile" Тогда
					ЗаписатьВидыНоменклатуры(ЧтениеXML, СтруктураДанных, ТаблицаНастроекВидыНоменклатуры);
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "DocumentObject.РегистрацияДефекта" Тогда
				Если ФункцияHTTP = "dataformobile" Тогда
					ОбновитьРегистрациюДефекта(ЧтениеXML, СтруктураДанных);
					ОбновлялиРегистрацияДефекта = Истина;
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "DocumentObject.мп_ЗаданиеНаРемонт" Тогда
				Если ФункцияHTTP = "dataformobile" Тогда
					ЗаписатьДокументЗаданиеНаРемонт(ЧтениеXML, СтруктураДанных);
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "DocumentObject.мп_НарядНаРемонт" Тогда
				Если ФункцияHTTP = "dataformobile" Тогда
					ЗаписатьДокументНарядНаРемонт(ЧтениеXML, СтруктураДанных);
				КонецЕсли;
			Иначе
				Данные = ПрочитатьXML(ЧтениеXML);
				Если НЕ Данные = Неопределено Тогда
					Данные.ОбменДанными.Загрузка = Истина;
					Данные.ОбменДанными.Отправитель = ЧтениеСообщение.Отправитель;
					Данные.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ТаблицаНастроекВидыНоменклатуры.Количество() > 0 Тогда
			ЗаписатьНастройкиВидовНаоменклатуры(ТаблицаНастроекВидыНоменклатуры);
		КонецЕсли;
		Если ТаблицаНаработок.Количество() > 0 Тогда
			ЗаписатьНаработкуОЭ(ТаблицаНаработок);
		КонецЕсли;
		
		Если ТаблицаНаработокКлассОбъекта.Количество() > 0 Тогда
			ЗаписатьНаработкуКлассОбъекта(ТаблицаНаработокКлассОбъекта);
		КонецЕсли;
		
		Если ТаблицаВидыПроверокКласса.Количество() > 0 Тогда
			ЗаписатьВидыПроверокКласса(ТаблицаВидыПроверокКласса);
		КонецЕсли;

		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщение.Отправитель, ЧтениеСообщение.НомерПринятого);

		ЧтениеСообщение.ЗакончитьЧтение();
		
		Если ОбновлялиРегистрацияДефекта Тогда
			ПараметрыПодключения = HTTPExchange.ПолучитьПараметрыСоединения();
			СоединениеHTTP = HTTPExchange.ПолучитьСоединениеHTTP(СтруктураДанных, ПараметрыПодключения);
			РегистрацияДефекта = Документы.РегистрацияДефекта.ВыбратьИзменения();
			
				ОтправитьДанныеНаСерверОбработкаРезультатовПачкой(
					СтруктураДанных, СоединениеHTTP, ПараметрыПодключения, Истина, РегистрацияДефекта, Истина);
		КонецЕсли;
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			"ОбменСервер.ПрочитатьПакетСервер | Ошибка чтения пакета с сервера", СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьОрганизацию(ЧтениеXML, СтруктураДанных)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.Организации.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
		
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);

	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.Организации | Ошибка записи элемента Организации %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьПользователей(ЧтениеXML, СтруктураДанных, Отправитель)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.Пользователи.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
		
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	РолиЕРП = СтрРазделить(ОбъектXDTO.Роли, ",");
	
	РолиПользователя = НовыйЭлемент.Роли.Выгрузить();
	РолиПользователя.Очистить();
	Для Каждого ТекРоль Из РолиЕРП Цикл
		НоваяРоль = РолиПользователя.Добавить();
		НоваяРоль.Роль = ТекРоль;
	КонецЦикла;
	НовыйЭлемент.Роли.Загрузить(РолиПользователя);
	НовыйЭлемент.ИдентификаторПользователяИБ = Новый УникальныйИдентификатор(ОбъектXDTO.ИдентификаторПользователяИБ);
	НовыйЭлемент.Недействителен = ?(ОбъектXDTO.Недействителен = "true", Истина, Ложь);
	НовыйЭлемент.Служебный = ?(ОбъектXDTO.Служебный = "true", Истина, Ложь);
	НовыйЭлемент.DeletionMark = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	
	Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Организация));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Организация);
	
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Организация = Организация;
	КонецЕсли;
	
	Подразделение = Справочники.СтруктураПредприятия.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Подразделение));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Подразделение);
	
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Подразделение = Подразделение;
	КонецЕсли;
	
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.Организации | Ошибка записи элемента Организации %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьФизическихЛиц(ЧтениеXML, СтруктураДанных)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.ФизическиеЛица.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
		
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	НовыйЭлемент.Уволен = ?(ОбъектXDTO.Уволен = "true", Истина, Ложь);
	
	Подразделение = Справочники.СтруктураПредприятия.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Подразделение));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Подразделение);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Подразделение = Подразделение;
	КонецЕсли;
	
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ФизическиеЛица | Ошибка записи элемента ФизическиеЛица %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьСтруктураПредприятия(ЧтениеXML, СтруктураДанных)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.СтруктураПредприятия.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
		
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	
	Родитель = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;
	
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.СтруктураПредприятия | Ошибка записи элемента подразделения %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
	

КонецПроцедуры

Процедура ЗаписатьДефектыОборудования(ЧтениеXML, СтруктураДанных, Отправитель)
	
	СпособыУстранения = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.Мечел_СпособыУстраненияДефектов Цикл 
	
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СпособыУстранения.Вставить(ИдентификаторЗначения, ТекЗначПер);
		
	КонецЦикла;

	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Мечел_ДефектыОборудования.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.Мечел_ДефектыОборудования.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.Мечел_ДефектыОборудования.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.Мечел_ДефектыОборудования.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.Мечел_ДефектыОборудования.ПустаяСсылка();
	КонецЕсли;
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, "Code,Description");
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	Если ОбъектXDTO.IsFolder = "false" Тогда
		Если Не ПустаяСтрока(ОбъектXDTO.СпособУстранения) Тогда
			НовыйЭлемент.СпособУстранения = СпособыУстранения[ОбъектXDTO.СпособУстранения];
		КонецЕсли;
		НовыйЭлемент.Мечел_Флаг_Неустранимый = ?(ОбъектXDTO.Мечел_Флаг_Неустранимый = "true", Истина, Ложь);
		НовыйЭлемент.мп_ФотоОбязательно = ?(ОбъектXDTO.мп_ФотоОбязательно = "true", Истина, Ложь);
	КонецЕсли;
	НовыйЭлемент.Родитель = Родитель;
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.СтруктураПредприятия | Ошибка записи элемента подразделения %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьКлассыОбъектовЭксплуатации(ЧтениеXML, СтруктураДанных, Отправитель)
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.КлассыОбъектовЭксплуатации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.КлассыОбъектовЭксплуатации.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.КлассыОбъектовЭксплуатации.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.КлассыОбъектовЭксплуатации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.КлассыОбъектовЭксплуатации.ПустаяСсылка();
	КонецЕсли;
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, ",Description,ВерсияДанныхЕРП");
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	
	НовыйЭлемент.Родитель = Родитель;
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.КлассыОбъектовЭксплуатации | Ошибка записи элемента %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьВидыРемонтов(ЧтениеXML, СтруктураДанных, Отправитель)

	Мечел_ВидВоздействия = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.Мечел_ВидВоздействия Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		Мечел_ВидВоздействия.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	Мечел_ВидВоздействия.Вставить("ОбъектXDTO", Перечисления.Мечел_ВидВоздействия.ПустаяСсылка());

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.ВидыРемонтов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.ВидыРемонтов.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Владелец = Справочники.КлассыОбъектовЭксплуатации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Владелец);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Владелец = Владелец;
	КонецЕсли;
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, ",Description,ВерсияДанныхЕРП");
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	НовыйЭлемент.Мечел_ВидВоздействия = Мечел_ВидВоздействия[Строка(ОбъектXDTO.Мечел_ВидВоздействия)];
	
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ВидыРемонтов | Ошибка записи элемента %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьВидыПроверокОборудования(ЧтениеXML, СтруктураДанных, Отправитель)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.мп_ВидыПроверокОборудования.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.мп_ВидыПроверокОборудования.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.мп_ВидыПроверокОборудования.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.мп_ВидыПроверокОборудования.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.мп_ВидыПроверокОборудования.ПустаяСсылка();
	КонецЕсли;

	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	Если ОбъектXDTO.IsFolder = "true" Тогда
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, ",Code,Description,ВерсияДанныхЕРП");
	Иначе
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, ",Code,Description,Комментарий,ВерсияДанныхЕРП");
		НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
		НовыйЭлемент.НормативноеЗначение = ?(ОбъектXDTO.НормативноеЗначение = "true", Истина, Ложь);
	КонецЕсли;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ВидыПроверокОборудования | Ошибка записи элемента %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьОбщиеВидыРемонтов(ЧтениеXML, СтруктураДанных, Отправитель)
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.ОбщиеВидыРемонтов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.ОбщиеВидыРемонтов.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, "Description,,ВерсияДанныхЕРП");
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	НовыйЭлемент.ЗаданаСтатьяРасходов = ?(ОбъектXDTO.ЗаданаСтатьяРасходов = "true", Истина, Ложь);
	
	НовыйЭлемент.Мечел_ЭтоАварийныйРемонт = 
		?(ОбъектXDTO.Мечел_ЭтоАварийныйРемонт = "true", Истина, Ложь);
	НовыйЭлемент.Мечел_ЭтоРемонт = 
		?(ОбъектXDTO.Мечел_ЭтоРемонт = "true", Истина, Ложь);
	НовыйЭлемент.Мечел_ТребуетсяДефект = 
		?(ОбъектXDTO.Мечел_ТребуетсяДефект = "true", Истина, Ложь);
	НовыйЭлемент.Мечел_ИспользоватьДляЗакупаТМЦ = 
		?(ОбъектXDTO.Мечел_ИспользоватьДляЗакупаТМЦ = "true", Истина, Ложь);
	НовыйЭлемент.Мечел_ЗапретРедактированияДокументовПоРемциклу = 
		?(ОбъектXDTO.Мечел_ЗапретРедактированияДокументовПоРемциклу = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ОбщиеВидыРемонтов | Ошибка записи элемента %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьНаработкуОбъектовЭксплуатации(ЧтениеXML, СтруктураДанных, Отправитель, ТаблицаНаработок)
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ОбъектЭксплуатации = Справочники.ОбъектыЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ОбъектЭксплуатации));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ОбъектЭксплуатации);
	Если Не СсылкаСуществует Тогда
		Возврат;
	КонецЕсли;
	Наработка = Справочники.ПоказателиНаработки.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Наработка));
	
	НоваяСтрока = ТаблицаНаработок.Добавить();
	НоваяСтрока.ОбъектЭксплуатации = ОбъектЭксплуатации;
	НоваяСтрока.Наработка = Наработка;
	НоваяСтрока.Значение = СериализаторXDTO.XMLЗначение(Тип("Число"), ОбъектXDTO.Значение);
	
КонецПроцедуры

Процедура ЗаписатьНаработкуКлассов(ЧтениеXML, СтруктураДанных, Отправитель, ТаблицаНаработок)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Класс = Справочники.КлассыОбъектовЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Класс));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Класс);
	Если Не СсылкаСуществует Тогда
		Возврат;
	КонецЕсли;
	Наработка = Справочники.ПоказателиНаработки.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Наработка));
		
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Наработка);
	Если Не СсылкаСуществует Тогда
		Возврат;
	КонецЕсли;
	НоваяСтрока = ТаблицаНаработок.Добавить();
	НоваяСтрока.Класс = Класс;
	НоваяСтрока.Наработка = Наработка;
КонецПроцедуры

Процедура ЗаписатьВидыПроверокКлассов(ЧтениеXML, СтруктураДанных, Отправитель, ТаблицаВидыПроверок)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Класс = Справочники.КлассыОбъектовЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Класс));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Класс);
	Если Не СсылкаСуществует Тогда
		Возврат;
	КонецЕсли;
	ВидПроверокОборудования = Справочники.мп_ВидыПроверокОборудования.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ВидПроверокОборудования));
		
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ВидПроверокОборудования);
	Если Не СсылкаСуществует Тогда
		Возврат;
	КонецЕсли;
	НоваяСтрока = ТаблицаВидыПроверок.Добавить();
	НоваяСтрока.Класс = Класс;
	НоваяСтрока.ВидПроверокОборудования = ВидПроверокОборудования;
	
КонецПроцедуры

Процедура ЗаписатьУзелОбъектовЭксплуатации(ЧтениеXML, СтруктураДанных, Отправитель = Неопределено)
	СтатусОС = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.СтатусыОбъектовЭксплуатации Цикл 
	
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СтатусОС.Вставить(ИдентификаторЗначения, ТекЗначПер);
		
	КонецЦикла;
	
	ГруппаТиповУзлов = Новый Соответствие;
	ГруппаТиповУзлов.Вставить("ОбъектXDTO", Перечисления.Мечел_ГруппаТиповУзлов.ПустаяСсылка());
	Для Каждого ТекСтрока Из Перечисления.Мечел_ГруппаТиповУзлов Цикл
		ИдентификаторЗначения = XMLСтрока(ТекСтрока);
		ГруппаТиповУзлов.Вставить(ИдентификаторЗначения, ТекСтрока);
	КонецЦикла;
	
	Если ТипЗнч(ЧтениеXML) = Тип("ОбъектXDTO") Тогда
		ОбъектXDTO = ЧтениеXML;
	Иначе
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	КонецЕсли;
	
	НоваяСсылка = Справочники.УзлыОбъектовЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.УзлыОбъектовЭксплуатации.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	Родитель = Справочники.УзлыОбъектовЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Родитель = Родитель;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, "СерийныйНомер,Description,ВерсияДанныхЕРП");

	НовыйЭлемент.СерийныйНомер = ?(Строка(ОбъектXDTO.СерийныйНомер) = "ОбъектXDTO", "", ОбъектXDTO.СерийныйНомер);
	НовыйЭлемент.КаталожныйНомер = ?(Строка(ОбъектXDTO.КаталожныйНомер) = "ОбъектXDTO", "", ОбъектXDTO.КаталожныйНомер);
	
	Владелец = Справочники.ОбъектыЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Владелец);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Владелец = Владелец;
	КонецЕсли;
	Класс =  Справочники.КлассыОбъектовЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Класс));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Класс);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Класс = Класс;
	КонецЕсли;
	НовыйЭлемент.Статус = СтатусОС[ОбъектXDTO.Статус];
	НовыйЭлемент.ГруппаТиповУзлов = ГруппаТиповУзлов[Строка(ОбъектXDTO.ГруппаТиповУзлов)];
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.УзлыОбъектовЭксплуатации | Ошибка записи элемента %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьОбъектыЭксплуатации(ЧтениеXML, СтруктураДанных, Знач Отправитель = Неопределено)
	
	СтатусОС = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.СтатусыОбъектовЭксплуатации Цикл 
	
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СтатусОС.Вставить(ИдентификаторЗначения, ТекЗначПер);
		
	КонецЦикла;
	
	Если ТипЗнч(ЧтениеXML) = Тип("ОбъектXDTO") Тогда
		ОбъектXDTO = ЧтениеXML;
	Иначе
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	КонецЕсли;
	
	НоваяСсылка = Справочники.ОбъектыЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.ОбъектыЭксплуатации.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, "Code,Description,ИнвентарныйНомер,ВерсияДанныхЕРП");
	НовыйЭлемент.ДатаПринятияКУчету = СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.ДатаПринятияКУчету);
	НовыйЭлемент.Статус = СтатусОС[ОбъектXDTO.Статус];
	
	ТехнологическоеМесто = Справочники.Мечел_ТехнологическиеМеста.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ТехнологическоеМесто));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ТехнологическоеМесто);
	Если Не СсылкаСуществует Тогда
		ТехнологическоеМесто = Справочники.Мечел_ТехнологическиеМеста.ПустаяСсылка();
	КонецЕсли;
	НовыйЭлемент.ТехнологическоеМесто = ТехнологическоеМесто;
	
	Класс = Справочники.КлассыОбъектовЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Класс));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Класс);
	Если Не СсылкаСуществует Тогда
		Класс = Справочники.КлассыОбъектовЭксплуатации.ПустаяСсылка();
	КонецЕсли;
	НовыйЭлемент.Класс = Класс;
	
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.КлассыОбъектовЭксплуатации | Ошибка записи элемента %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
	КонецПопытки;
			
КонецПроцедуры

Процедура ЗаписатьПоказателиНаработки(ЧтениеXML, СтруктураДанных, Отправитель)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.ПоказателиНаработки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.ПоказателиНаработки.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.ПоказателиНаработки.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.ПоказателиНаработки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.ПоказателиНаработки.ПустаяСсылка();
	КонецЕсли;
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, ",Description,ЕдиницаИзмерения,ВерсияДанныхЕРП");
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	
	НовыйЭлемент.Родитель = Родитель;
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ПоказателиНаработки | Ошибка записи элемента показатели наработки %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьТехнологическиеМеста(ЧтениеXML, СтруктураДанных, Отправитель)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Мечел_ТехнологическиеМеста.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.Мечел_ТехнологическиеМеста.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.Мечел_ТехнологическиеМеста.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.Мечел_ТехнологическиеМеста.ПустаяСсылка();
	КонецЕсли;
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO, "Description,Шифр");
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	НовыйЭлемент.Родитель = Родитель;
	Попытка
		
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.СтруктураПредприятия | Ошибка записи элемента подразделения %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьСкладСИерархией(ЧтениеXML, СтруктураДанных, Отправитель)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.Склады.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.Склады.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	Если ОбъектXDTO.IsFolder = "true" Тогда
		НовыйЭлемент.мп_ГруппаСкладовДляТОиР = ?(ОбъектXDTO.мп_ГруппаСкладовДляТОиР = "true", Истина, Ложь);
	Иначе
		НовыйЭлемент.мп_ГруппаСкладовДляТОиР = Ложь;
	КонецЕсли;
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.Склады | Ошибка записи элемента склад %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьПричиныСостоянияОборудования(ЧтениеXML, СтруктураДанных, Отправитель)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Мечел_ПричиныСостоянияОборудования.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.Мечел_ПричиныСостоянияОборудования.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.Мечел_ПричиныСостоянияОборудования.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.Мечел_ПричиныСостоянияОборудования.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.Мечел_ПричиныСостоянияОборудования.ПустаяСсылка();
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ЗаписатьПричиныСостоянияОборудования | Ошибка записи элемента ЗаписатьПричиныСостоянияОборудования %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьВидыСостоянияОборудования(ЧтениеXML, СтруктураДанных, Отправитель)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Мечел_ВидыСостоянияОборудования.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.Мечел_ВидыСостоянияОборудования.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ЗаписатьПричиныСостоянияОборудования | Ошибка записи элемента ЗаписатьПричиныСостоянияОборудования %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьПричиныОтменыРемонтов(ЧтениеXML, СтруктураДанных, Отправитель)

	ТипыПричин = Новый Соответствие;

	Для Каждого ТекЗначение Из Перечисления.Мечел_ТипПричины Цикл
		ТипыПричин.Вставить(XMLСтрока(ТекЗначение), ТекЗначение);
	КонецЦикла;
	ТипыПричин.Вставить("ОбъектXDTO", Перечисления.Мечел_ТипПричины.ПустаяСсылка());

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.Мечел_ПричиныОтменыРемонтов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.Мечел_ПричиныОтменыРемонтов.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	НовыйЭлемент.ТипПричины = ТипыПричин[Строка(ОбъектXDTO.ТипПричины)];
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.Мечел_ПричиныОтменыРемонтов | Ошибка записи элемента Мечел_ПричиныОтменыРемонтов %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьВидыДефектов(ЧтениеXML, СтруктураДанных, Отправитель)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.ВидыДефектов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.ВидыДефектов.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.ВидыДефектов.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.ВидыДефектов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.ВидыДефектов.ПустаяСсылка();
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ВидыДефектов | Ошибка записи элемента ВидыДефектов %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьТехнологическиеОперации(ЧтениеXML, СтруктураДанных, Отправитель)

	СпособыВыполнения = Новый Соответствие;
	Для Каждого ТекСтрока Из Перечисления.Мечел_СпособыВыполненияОпераций Цикл
		СпособыВыполнения.Вставить(XMLСтрока(ТекСтрока), ТекСтрока);
	КонецЦикла;
	СпособыВыполнения.Вставить("ОбъектXDTO", Перечисления.Мечел_СпособыВыполненияОпераций.ПустаяСсылка());
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

	НоваяСсылка = Справочники.ТехнологическиеОперации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);

	Если СсылкаСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.ТехнологическиеОперации.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;

	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.Мечел_СпособВыполнения = СпособыВыполнения[Строка(ОбъектXDTO.Мечел_СпособВыполнения)];
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	НовыйЭлемент.МожноПовторить = ?(ОбъектXDTO.МожноПовторить = "true", Истина, Ложь);
	НовыйЭлемент.МожноПропустить = ?(ОбъектXDTO.МожноПропустить = "true", Истина, Ложь);
	НовыйЭлемент.Мечел_ФотоотчетОбязателен = ?(ОбъектXDTO.Мечел_ФотоотчетОбязателен = "true", Истина, Ложь);
	НовыйЭлемент.Мечел_ИзмерениеОбязательно = ?(ОбъектXDTO.Мечел_ИзмерениеОбязательно = "true", Истина, Ложь);
	НовыйЭлемент.мп_ПроверкаОбязательна = ?(ОбъектXDTO.мп_ПроверкаОбязательна = "true", Истина, Ложь);

	мп_ПоказательИзмерения = Справочники.ПоказателиНаработки.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.мп_ПоказательИзмерения));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(мп_ПоказательИзмерения);

	Если СсылкаСуществует Тогда
		НовыйЭлемент.мп_ПоказательИзмерения = мп_ПоказательИзмерения; 
	КонецЕсли;

	мп_ВидПроверки = Справочники.мп_ВидыПроверокОборудования.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.мп_ВидПроверки));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(мп_ВидПроверки);

	Если СсылкаСуществует Тогда
		НовыйЭлемент.мп_ВидПроверки = мп_ВидПроверки; 
	КонецЕсли;

	Попытка
		НовыйЭлемент.Записать();

	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ТехнологическиеОперации | Ошибка записи элемента ТехнологическиеОперации %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
	КонецПопытки;


КонецПроцедуры

#Область Номенклатура

Процедура ЗаписатьВидыНоменклатуры(Знач ОбъектXDTO, СтруктураДанных, ТаблицаНастроекВидыНоменклатуры = Неопределено)

	Если ТипЗнч(ОбъектXDTO) = Тип("ЧтениеXML") Тогда
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ОбъектXDTO);
	КонецЕсли;
	НоваяСсылка = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);

	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.ВидыНоменклатуры.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	Если Не ОбъектXDTO.IsFolder = "true" Тогда
		НовыйЭлемент.ИспользоватьСерии = ?(СокрЛП(ОбъектXDTO.ИспользоватьСерии) = "true", Истина, Ложь);
		
		ИспользованиеХарактеристик = Новый Соответствие;
		Для Каждого ТекСтрока Из Перечисления.ВариантыИспользованияХарактеристикНоменклатуры Цикл
			ИспользованиеХарактеристик.Вставить(XMLСтрока(ТекСтрока), ТекСтрока);
		КонецЦикла;
		ИспользованиеХарактеристик.Вставить("ОбъектXDTO", Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать);
		НовыйЭлемент.ИспользованиеХарактеристик = ИспользованиеХарактеристик[Строка(ОбъектXDTO.ИспользованиеХарактеристик)];
		
	КонецЕсли;
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.ВидыНоменклатуры | Ошибка записи элемента ВидыНоменклатуры %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
	
	
	Если ТипЗнч(ТаблицаНастроекВидыНоменклатуры) = Тип("ТаблицаЗначений") Тогда
		КодНастройки = ?(Строка(ОбъектXDTO.КодНастройки) = "ОбъектXDTO", "", Строка(ОбъектXDTO.КодНастройки));
		УИДНастройки = ?(Строка(ОбъектXDTO.УИДНастройки) = "ОбъектXDTO", "", Строка(ОбъектXDTO.УИДНастройки));
		ВерсияДанныхНастройки = 
			?(Строка(ОбъектXDTO.ВерсияДанныхНастройки) = "ОбъектXDTO", "", Строка(ОбъектXDTO.ВерсияДанныхНастройки));
		
		Если Не ПустаяСтрока(КодНастройки) И Не ПустаяСтрока(УИДНастройки) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("ВидНоменклатуры", НовыйЭлемент.Ссылка);
			Отбор.Вставить("КодНастройки", КодНастройки);
			СтрокиНастроек = ТаблицаНастроекВидыНоменклатуры.НайтиСтроки(Отбор);
			Если СтрокиНастроек.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаНастроекВидыНоменклатуры.Добавить();
				НоваяСтрока.ВидНоменклатуры = НовыйЭлемент.Ссылка;
				НоваяСтрока.КодНастройки = КодНастройки;
				НоваяСтрока.УИДНастройки = УИДНастройки;
				НоваяСтрока.ВерсияДанныхЕРП = ВерсияДанныхНастройки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьСерииНоменклатуры(ОбъектXDTO, СтруктураДанных)

//	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ВидНоменклатуры));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ВидНоменклатуры);
	
	Если СсылкаСуществует Тогда

		НовыйЭлемент.ВидНоменклатуры = ВидНоменклатуры;

	КонецЕсли;
	
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.СерииНоменклатуры | Ошибка записи элемента СерииНоменклатуры %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьЕдиницыИзмерения(ОбъектXDTO, СтруктураДанных)
	
	ТипыИзмеряемыхВеличин = Новый Соответствие;
	Для Каждого ТекСтрока Из Перечисления.ТипыИзмеряемыхВеличин Цикл
		ТипыИзмеряемыхВеличин.Вставить(XMLСтрока(ТекСтрока), ТекСтрока);
	КонецЦикла;
 	ТипыИзмеряемыхВеличин.Вставить("ОбъектXDTO", Перечисления.ТипыИзмеряемыхВеличин.ПустаяСсылка());
	
//	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

	НоваяСсылка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);

	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.ТипИзмеряемойВеличины = ТипыИзмеряемыхВеличин[Строка(ОбъектXDTO.ТипИзмеряемойВеличины)];
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			СтрШаблон(
				"ОбменСервер.УпаковкиЕдиницыИзмерения | Ошибка записи элемента УпаковкиЕдиницыИзмерения %1",
				ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьНоменклатуру(ОбъектXDTO, СтруктураДанных)

//	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

	НоваяСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);

	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		Если ОбъектXDTO.IsFolder = "true" Тогда
			НовыйЭлемент = Справочники.Номенклатура.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
		КонецЕсли;
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Родитель = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Parent));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Родитель);
	
	Если Не СсылкаСуществует Тогда
		Родитель = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	ГрадацииКачества = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.ГрадацииКачества Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		ГрадацииКачества.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	ГрадацииКачества.Вставить("ОбъектXDTO", Перечисления.ГрадацииКачества.ПустаяСсылка());
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	
	НовыйЭлемент.Артикул = ?(Строка(ОбъектXDTO.Артикул) = "ОбъектXDTO", "", ОбъектXDTO.Артикул);

	ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ВидНоменклатуры));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ВидНоменклатуры);
	
	Если СсылкаСуществует Тогда

		НовыйЭлемент.ВидНоменклатуры = ВидНоменклатуры;

	КонецЕсли;
	
	ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ЕдиницаИзмерения));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ЕдиницаИзмерения);
	
	Если СсылкаСуществует Тогда

		НовыйЭлемент.ЕдиницаИзмерения = ЕдиницаИзмерения;

	КонецЕсли;
	
	Если Не ОбъектXDTO.IsFolder = "true" Тогда
		НовыйЭлемент.Мечел_ПодлежитЛазернойМаркировке = ?(ОбъектXDTO.Мечел_ПодлежитЛазернойМаркировке = "true", Истина, Ложь);
		НовыйЭлемент.Качество = ГрадацииКачества[ОбъектXDTO.Качество];
		НовыйЭлемент.Мечел_БУ = ?(ОбъектXDTO.Мечел_БУ = "true", Истина, Ложь);
	КонецЕсли;
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбъектXDTO.Цена);
	НовыйЭлемент.Родитель = Родитель;
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();

	Исключение
		СтрокаОшибки = СтрШаблон(
			"ОбменСервер.Номенклатура | Ошибка записи элемента Номенклатура %1",
			ОбъектXDTO.Description);
		HTTPCore.ЗаписатьМобильнуюОшибку(СтрокаОшибки, СтруктураДанных, , ОписаниеОшибки());

	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьХарактеристикиНоменклатуры(ОбъектXDTO, СтруктураДанных)

	НоваяСсылка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);

	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;

	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);

	Если ОбъектXDTO.ТипВладельца = "ВИДЫНОМЕНКЛАТУРЫ" Тогда
		Владелец = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	Иначе
		Владелец = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	КонецЕсли;

	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Владелец);

	Если СсылкаСуществует Тогда
		НовыйЭлемент.Владелец = Владелец;
	КонецЕсли;
	
	ОС = Справочники.ОбъектыЭксплуатации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОС));
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ОС);

	Если СсылкаСуществует Тогда
		
		НовыйЭлемент.ОС = ОС;
		
	КонецЕсли;
	
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);

	Попытка
		НовыйЭлемент.Записать();

	Исключение
		СтрокаОшибки = СтрШаблон(
			"ОбменСервер.ХарактеристикиНоменклатуры | Ошибка записи элемента ХарактеристикиНоменклатуры %1",
			ОбъектXDTO.Description);
		HTTPCore.ЗаписатьМобильнуюОшибку(СтрокаОшибки	, СтруктураДанных, , ОписаниеОшибки());

	КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьНазначения(ОбъектXDTO, СтруктураДанных)

	НоваяСсылка = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если СсылкаСуществует Тогда
		Если ОбщегоНазначенияПовтИсп.СовпадаетВерсияДанныхЕРП(НоваяСсылка.ВерсияДанныхЕРП, ОбъектXDTO.ВерсияДанныхЕРП) Тогда
			Возврат;
		КонецЕсли;
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Справочники.Назначения.СоздатьЭлемент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;

	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОбъектXDTO);
	
	НовыйЭлемент.ПометкаУдаления = ?(ОбъектXDTO.DeletionMark = "true", Истина, Ложь);
	
	Попытка
		НовыйЭлемент.Записать();
		
	Исключение
		СтрокаОшибки = СтрШаблон(
			"ОбменСервер.СерииНоменклатуры | Ошибка записи элемента СерииНоменклатуры %1",
			ОбъектXDTO.Description);
		HTTPCore.ЗаписатьМобильнуюОшибку(СтрокаОшибки, СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьНаборТМЦ(ОбъектXDTO, СтруктураДанных, НаборТМЦ, Период)
	ОбъектЭксплуатации = Справочники.ОбъектыЭксплуатации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Объект));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ОбъектЭксплуатации);
	Если Не СсылкаСуществует Тогда
		ОбъектЭксплуатации = Справочники.ОбъектыЭксплуатации.ПустаяСсылка();
	КонецЕсли;
	
	Узел = Справочники.УзлыОбъектовЭксплуатации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Узел));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Узел);
	Если Не СсылкаСуществует Тогда
		Узел = Справочники.УзлыОбъектовЭксплуатации.ПустаяСсылка();
	КонецЕсли;
	
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Номенклатура));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Номенклатура);
	Если Не СсылкаСуществует Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Характеристика));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Характеристика);
	Если Не СсылкаСуществует Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Серия));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Серия);
	Если Не СсылкаСуществует Тогда
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	Количество = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбъектXDTO.Количество);
	
	НоваяЗапись = НаборТМЦ.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.Объект = ОбъектЭксплуатации;
	НоваяЗапись.Узел = Узел;
	НоваяЗапись.Номенклатура = Номенклатура;
	НоваяЗапись.Характеристика = Характеристика;
	НоваяЗапись.Серия = Серия;
	НоваяЗапись.Количество = Количество;

КонецПроцедуры

Процедура ЗаписатьОстаткиПоНоменклатуре(ОбъектXDTO, СтруктураДанных, ОстаткиПоНоменклатуре)

	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Номенклатура));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Номенклатура);
	Если Не СсылкаСуществует Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Характеристика));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Характеристика);
	Если Не СсылкаСуществует Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Назначение));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Назначение);
	Если Не СсылкаСуществует Тогда
		Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Склад);
	Если Не СсылкаСуществует Тогда
		Склад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Серия));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Серия);
	Если Не СсылкаСуществует Тогда
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	НоваяЗапись = ОстаткиПоНоменклатуре.Добавить();
	НоваяЗапись.Период = НачалоДня(ТекущаяДатаСеанса());
	НоваяЗапись.Номенклатура = Номенклатура;
	НоваяЗапись.Характеристика = Характеристика;
	НоваяЗапись.Назначение = Назначение;
	НоваяЗапись.Склад = Склад;
	НоваяЗапись.Серия = Серия;
	НоваяЗапись.ВНаличии = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбъектXDTO.ВНаличии);
	НоваяЗапись.КОтгрузке = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбъектXDTO.КОтгрузке);
	НоваяЗапись.Остаток = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбъектXDTO.Остаток);
	
КонецПроцедуры

Процедура ЗаписатьТоварыДругогоКачества(ОбъектXDTO, СтруктураДанных, ТоварыДругогоКачества)
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Номенклатура));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Номенклатура);
	Если Не СсылкаСуществует Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	НоменклатураБрак = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.НоменклатураБрак));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоменклатураБрак);
	Если Не СсылкаСуществует Тогда
		НоменклатураБрак = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	ГрадацииКачества = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.ГрадацииКачества Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		ГрадацииКачества.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	ГрадацииКачества.Вставить("ОбъектXDTO", Перечисления.ГрадацииКачества.ПустаяСсылка());

	Движение = ТоварыДругогоКачества.Добавить();
	Движение.Номенклатура = Номенклатура;
	Движение.НоменклатураБрак = НоменклатураБрак;
	Движение.ГрадацияКачества = ГрадацииКачества[ОбъектXDTO.ГрадацияКачества];
КонецПроцедуры

#КонецОбласти

#Область Документы

// ОбновитьРегистрациюПроверокОборудования
//
// Параметры:
//  ЧтениеXML		 - 	 - 
//  СтруктураДанных	 - 	 - 
//  Отправитель		 - 	 - 
//
Процедура ОбновитьРегистрациюПроверокОборудования(ЧтениеXML, СтруктураДанных, Отправитель)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Документы.мп_РегистрацияПроверокОборудования.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если Не СсылкаСуществует Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОбмена = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.мп_СтатусыОбмена Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СтатусыОбмена.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	СтатусыОбмена.Вставить("ОбъектXDTO", Перечисления.мп_СтатусыОбмена.ПустаяСсылка());
	
	НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.СтатусОбмена = СтатусыОбмена[Строка(ОбъектXDTO.СтатусОбмена)];
	
	Попытка
		
		НовыйЭлемент.Записать();
		
	Исключение
	
		HTTPCore.ЗаписатьМобильнуюОшибку(
		СтрШаблон(
		"ОбменСервер.ОбновитьРегистрациюПроверокОборудования | Ошибка записи элемента мп_РегистрацияПроверокОборудования %1",
			ОбъектXDTO.Description), СтруктураДанных, , ОписаниеОшибки());
	
	КонецПопытки;
	
КонецПроцедуры

Функция СоздатьДокументРегистрацияДефекта(НоваяСсылка, ОбъектXDTO, ОтветственныйЗаУстранение)

	СсылкаНаДокумент = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	Если СсылкаНаДокумент Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Документы.РегистрацияДефекта.СоздатьДокумент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;

	НовыйЭлемент.ВерсияДанныхЕРП = ОбъектXDTO.ВерсияДанныхЕРП;
	НовыйЭлемент.Дата = СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.Дата);
	НовыйЭлемент.НомерКИС = ОбъектXDTO.Номер;

	Подразделение = Справочники.СтруктураПредприятия.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Подразделение));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Подразделение);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Подразделение = Подразделение;
	КонецЕсли;

	 ОбъектЭксплуатации = Справочники.ОбъектыЭксплуатации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ОбъектЭксплуатации));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ОбъектЭксплуатации);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.ОбъектЭксплуатации = ОбъектЭксплуатации;
	КонецЕсли;
	
	Ответственный = Справочники.Пользователи.ПолучитьСсылку(
	Новый УникальныйИдентификатор(ОбъектXDTO.Ответственный));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Ответственный);
	Если Не СсылкаСуществует Тогда
		Ответственный = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	Если РольДоступна("мп_БригадирТОиР") Тогда
		Если СсылкаНаДокумент И ОтветственныйЗаУстранение = Справочники.Пользователи.ПустаяСсылка() Тогда
			НовыйЭлемент.Ответственный = Ответственный;
		КонецЕсли;
	Иначе
		НовыйЭлемент.Ответственный = ОтветственныйЗаУстранение;
	КонецЕсли;

	НовыйЭлемент.ОтветственныйЗаУстранение = ОтветственныйЗаУстранение;

	НовыйЭлемент.КраткоеОписаниеДефекта =
		?(Строка(ОбъектXDTO.КраткоеОписаниеДефекта) = "ОбъектXDTO", "", ОбъектXDTO.КраткоеОписаниеДефекта);
	
	НовыйЭлемент.СпособУстранения = ?(ОбъектXDTO.СпособУстранения = "true", Истина, Ложь);
	
	Источник = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.мп_ИсточникиДокументов Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		Источник.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	Источник.Вставить("ОбъектXDTO", Перечисления.мп_ИсточникиДокументов.ПустаяСсылка());
	НовыйЭлемент.Источник = Источник[ОбъектXDTO.Источник];

	СтатусыДефектов = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.СтатусыДефектов Цикл
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СтатусыДефектов.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	СтатусыДефектов.Вставить("ОбъектXDTO", Перечисления.СтатусыДефектов.ПустаяСсылка());
	НовыйЭлемент.Статус = СтатусыДефектов[ОбъектXDTO.Статус];
	
	Критичность = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.Мечел_КритичностьДефекта Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		Критичность.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	Критичность.Вставить("ОбъектXDTO", Перечисления.мп_СтатусыОбмена.ПустаяСсылка());
	НовыйЭлемент.Критичность = Критичность[Строка(ОбъектXDTO.Критичность)];
	
	НовыйЭлемент.Комментарий = ?(Строка(ОбъектXDTO.Комментарий) = "ОбъектXDTO", "", ОбъектXDTO.Комментарий);

	Организация = Справочники.Организации.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.Организация));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Организация);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.Организация = Организация;
	КонецЕсли;

	ВидДефекта = Справочники.ВидыДефектов.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ВидДефекта));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ВидДефекта);
	Если СсылкаСуществует Тогда
		НовыйЭлемент.ВидДефекта = ВидДефекта;
	КонецЕсли;

	ДвоичныеДанные = Base64Значение(ОбъектXDTO.ДефектныеУзлы);
	РезультатСтрBase64 = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, "UTF-8");
	РезультатХранилище = XMLЗначение(Тип("ХранилищеЗначения"), РезультатСтрBase64);
	ТЗРезультат = РезультатХранилище.Получить();

	Если ТипЗнч(ТЗРезультат) = Тип("ТаблицаЗначений") Тогда
	
		Дефекты = НовыйЭлемент.Дефекты.Выгрузить();
		Дефекты.Очистить();
		Для Каждого ТекСтрока Из ТЗРезультат Цикл
			
			НоваяСтрока = Дефекты.Добавить();
			ЗаполнитьЗначенияСвойств(
				НоваяСтрока, ТекСтрока, "ДефектУстранен,ОписаниеУстранения,ИдентификаторСтроки,ДатаУстранения");
			
			Узел = Справочники.УзлыОбъектовЭксплуатации.ПолучитьСсылку(
				Новый УникальныйИдентификатор(ТекСтрока.Узел));
			СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Узел);
			Если СсылкаСуществует Тогда
				НоваяСтрока.Узел = Узел;
			КонецЕсли;
			
			Дефект = Справочники.Мечел_ДефектыОборудования.ПолучитьСсылку(
				Новый УникальныйИдентификатор(ТекСтрока.Дефект));
			СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Дефект);
			Если СсылкаСуществует Тогда
				НоваяСтрока.Дефект = Дефект;
				НоваяСтрока.СпособУстранения = Дефект.СпособУстранения;
			КонецЕсли;
			
		КонецЦикла;
		НовыйЭлемент.Дефекты.Загрузить(Дефекты);
	КонецЕсли;

	Возврат НовыйЭлемент;
	
КонецФункции

Процедура ЗаписатьДокументНарядНаРемонт(ЧтениеXML, СтруктураДанных)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	НоваяСсылка = Документы.мп_НарядНаРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаНаДокументСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);

	ВерсияДанныхЕРП = ?(Строка(ОбъектXDTO.ВерсияДанныхЕРП) = "ОбъектXDTO", "", ОбъектXDTO.ВерсияДанныхЕРП);
	
	Если СсылкаНаДокументСуществует Тогда
		Если ВерсияДанныхЕРП = НоваяСсылка.ВерсияДанныхЕРП Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	РеквизитыДокумента = Новый Структура;
	
	РеквизитыДокумента.Вставить("ВерсияДанныхЕРП", ВерсияДанныхЕРП);
	
	Дата = СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.Дата);
	РеквизитыДокумента.Вставить("Дата", Дата);
	
	НомерКИС = ОбъектXDTO.Номер;
	РеквизитыДокумента.Вставить("НомерКИС", НомерКИС);
	
	ПометкаУдаления = ?(ОбъектXDTO.ПометкаУдаления = "false", Ложь, Истина);
	РеквизитыДокумента.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	Проведен = ?(ОбъектXDTO.Проведен = "false", Ложь, Истина);
	РеквизитыДокумента.Вставить("Проведен", Проведен);

	СтатусыНаряд = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.СтатусыНарядаНаРемонт Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СтатусыНаряд.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	СтатусыНаряд.Вставить("ОбъектXDTO", Перечисления.СтатусыНарядаНаРемонт.ПустаяСсылка());
	Статус = СтатусыНаряд[Строка(ОбъектXDTO.Статус)];
	РеквизитыДокумента.Вставить("Статус", Статус);
	
	Подразделение = РеквизитСправочникаПоУИД("СтруктураПредприятия", ОбъектXDTO.Подразделение);
	РеквизитыДокумента.Вставить("Подразделение", Подразделение);
	
	Если СсылкаНаДокументСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Документы.мп_НарядНаРемонт.СоздатьДокумент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, РеквизитыДокумента);
	
	ТЗРезультат = ТаблицаЗначенийИзДвоичныхДанных(ОбъектXDTO, "Работы");
	Если ТипЗнч(ТЗРезультат) = Тип("ТаблицаЗначений") Тогда
		Работы = НовыйЭлемент.Работы.Выгрузить();
		Работы.Очистить();
		Для Каждого ТекСтрока Из ТЗРезультат Цикл
			ИмяДокумента = ТекСтрока.ВидДокумента;
			ЗначениеРеквизита = ТекСтрока.Работа;
			Работа = РеквизитДокументаПоУИД(ИмяДокумента, ЗначениеРеквизита);
			ИдентификаторСтроки = ТекСтрока.ИдентификаторСтроки;
			
			НоваяСтрока = Работы.Добавить();
			НоваяСтрока.Работа = Работа;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			
		КонецЦикла;
		НовыйЭлемент.Работы.Загрузить(Работы);
	КонецЕсли;
	
	ТЗРезультат = ТаблицаЗначенийИзДвоичныхДанных(ОбъектXDTO, "Исполнители");
	Если ТипЗнч(ТЗРезультат) = Тип("ТаблицаЗначений") Тогда
		Исполнители = НовыйЭлемент.Исполнители.Выгрузить();
		Исполнители.Очистить();
		Для Каждого ТекСтрока Из ТЗРезультат Цикл
			ИмяСправочника = "Пользователи";
			ЗначениеРеквизита = ТекСтрока.Ответственный;
			Ответственный = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			ИдентификаторСтрокиРаботы = ТекСтрока.ИдентификаторСтрокиРаботы;
			
			НоваяСтрока = Исполнители.Добавить();
			НоваяСтрока.Ответственный = Ответственный;
			НоваяСтрока.ИдентификаторСтрокиРаботы = ИдентификаторСтрокиРаботы;
			
		КонецЦикла;
		НовыйЭлемент.Исполнители.Загрузить(Исполнители);
	КонецЕсли;
	НовыйЭлемент.СтатусОбмена = Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС;
	НовыйЭлемент.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

Процедура ЗаписатьДокументЗаданиеНаРемонт(ЧтениеXML, СтруктураДанных)
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

	НоваяСсылка = Документы.мп_ЗаданиеНаРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаНаДокументСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);

	ВерсияДанныхЕРП = ?(Строка(ОбъектXDTO.ВерсияДанныхЕРП) = "ОбъектXDTO", "", ОбъектXDTO.ВерсияДанныхЕРП);
	
	Если СсылкаНаДокументСуществует Тогда
		Если ВерсияДанныхЕРП = НоваяСсылка.ВерсияДанныхЕРП Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	РеквизитыДокумента = Новый Структура;

	ИстинаСтрокой = "true";
	ЗаказНаРемонтУИД = ?(ОбъектXDTO.ЗаказНаРемонтУИД = "ОбъектXDTO", "", ОбъектXDTO.ЗаказНаРемонтУИД);
	ЗаказНаРемонтВерсияДанныхЕРП =
		?(Строка(ОбъектXDTO.ЗаказНаРемонтВерсияДанныхЕРП) = "ОбъектXDTO", "", ОбъектXDTO.ЗаказНаРемонтВерсияДанныхЕРП);
	ЗаказНаРемонтДата = СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.ЗаказНаРемонтДата);
	ЗаказНаРемонтНомер =
		?(Строка(ОбъектXDTO.ЗаказНаРемонтНомер) = "ОбъектXDTO", "", ОбъектXDTO.ЗаказНаРемонтНомер);
	ЗаказНаРемонтПредставление =
		?(Строка(ОбъектXDTO.ЗаказНаРемонтПредставление) = "ОбъектXDTO", "", ОбъектXDTO.ЗаказНаРемонтПредставление);
	ЗаказНаРемонтПроведен =
		?(ОбъектXDTO.ЗаказНаРемонтПроведен = ИстинаСтрокой, Истина, Ложь);
		
	ЗаказНаРемонтПометкаУдаления =
		?(ОбъектXDTO.ЗаказНаРемонтПометкаУдаления = ИстинаСтрокой, Истина, Ложь);

	РеквизитыЗаказНаРемонт = Новый Структура;
	РеквизитыЗаказНаРемонт.Вставить("ЗаказНаРемонтУИД", ЗаказНаРемонтУИД);
	РеквизитыЗаказНаРемонт.Вставить("ЗаказНаРемонтВерсияДанныхЕРП", ЗаказНаРемонтВерсияДанныхЕРП);
	РеквизитыЗаказНаРемонт.Вставить("ЗаказНаРемонтДата", ЗаказНаРемонтДата);
	РеквизитыЗаказНаРемонт.Вставить("ЗаказНаРемонтНомер", ЗаказНаРемонтНомер);
	РеквизитыЗаказНаРемонт.Вставить("ЗаказНаРемонтПредставление", ЗаказНаРемонтПредставление);
	РеквизитыЗаказНаРемонт.Вставить("ЗаказНаРемонтПроведен", ЗаказНаРемонтПроведен);
	РеквизитыЗаказНаРемонт.Вставить("ЗаказНаРемонтПометкаУдаления", ЗаказНаРемонтПометкаУдаления);

	ЗаказНаРемонт =
		Справочники.ЗаказНаРемонт.ПолучитьЗаказНаРемонт(РеквизитыЗаказНаРемонт);
	РеквизитыДокумента.Вставить("ЗаказНаРемонт", ЗаказНаРемонт);
	
	ОбъектЭксплуатации = РеквизитСправочникаПоУИД("ОбъектыЭксплуатации", ОбъектXDTO.ОбъектЭксплуатации);
	РеквизитыДокумента.Вставить("ОбъектЭксплуатации", ОбъектЭксплуатации);
	
	Узел = РеквизитСправочникаПоУИД("УзлыОбъектовЭксплуатации", ОбъектXDTO.Узел);
	РеквизитыДокумента.Вставить("Узел", Узел);

	НаименованиеРабот = РеквизитСправочникаПоУИД("ТехнологическиеОперации", ОбъектXDTO.НаименованиеРабот);
	РеквизитыДокумента.Вставить("НаименованиеРабот", НаименованиеРабот);

	ПоказательИзмерения = РеквизитСправочникаПоУИД("ПоказателиНаработки", ОбъектXDTO.ПоказательИзмерения);
	РеквизитыДокумента.Вставить("ПоказательИзмерения", ПоказательИзмерения);

	ВидПроверки = РеквизитСправочникаПоУИД("мп_ВидыПроверокОборудования", ОбъектXDTO.ВидПроверки);
	РеквизитыДокумента.Вставить("ВидПроверки", ВидПроверки);

	ОбщийВидРемонта = РеквизитСправочникаПоУИД("ОбщиеВидыРемонтов", ОбъектXDTO.ОбщийВидРемонта);
	РеквизитыДокумента.Вставить("ОбщийВидРемонта", ОбщийВидРемонта);

	Исполнитель = РеквизитСправочникаПоУИД("СтруктураПредприятия", ОбъектXDTO.Исполнитель);
	РеквизитыДокумента.Вставить("Исполнитель", Исполнитель);

	ВидРемонта = РеквизитСправочникаПоУИД("ВидыРемонтов", ОбъектXDTO.ВидРемонта);
	РеквизитыДокумента.Вставить("ВидРемонта", ВидРемонта);

	РеквизитыДокумента.Вставить("ВерсияДанныхЕРП", ВерсияДанныхЕРП);
	
	ПометкаУдаления = ?(ОбъектXDTO.ПометкаУдаления = "true", Истина, Ложь);
	РеквизитыДокумента.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	НомерКИС = ?(Строка(ОбъектXDTO.НомерКИС) = "ОбъектXDTO", "", ОбъектXDTO.НомерКИС);
	РеквизитыДокумента.Вставить("НомерКИС", НомерКИС);
	
	Дата = СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.Дата);
	РеквизитыДокумента.Вставить("Дата", Дата);
	
	Проведен = ?(ОбъектXDTO.Проведен = "true", Истина, Ложь);
	РеквизитыДокумента.Вставить("Проведен", Проведен);
	
	РеквизитыДокумента.Вставить("СтатусОбмена", Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);
	
	ИдентификаторСтроки = ?(Строка(ОбъектXDTO.ИдентификаторСтроки) = "ОбъектXDTO", "", ОбъектXDTO.ИдентификаторСтроки);
	РеквизитыДокумента.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	ДатаНачала = СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.ДатаНачала);
	РеквизитыДокумента.Вставить("ДатаНачала", ДатаНачала);
	
	ДатаЗавершения = СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.ДатаЗавершения);
	РеквизитыДокумента.Вставить("ДатаЗавершения", ДатаЗавершения);
	
	ВыполнениеОперации = ?(Строка(ОбъектXDTO.ВыполнениеОперации) = "ОбъектXDTO", "", ОбъектXDTO.ВыполнениеОперации);
	Если Не ПустаяСтрока(ВыполнениеОперации) Тогда
		ВыполнениеОперации = """" + ВыполнениеОперации  + """";
	КонецЕсли;
	РеквизитыДокумента.Вставить("ВыполнениеОперации", ВыполнениеОперации);
	ТипЧисло = Тип("Число");
	ЗначениеПоказателяИзмерения = СериализаторXDTO.XMLЗначение(ТипЧисло, ОбъектXDTO.ЗначениеПоказателяИзмерения);
	РеквизитыДокумента.Вставить("ЗначениеПоказателяИзмерения", ЗначениеПоказателяИзмерения);
	
	РезультатПроверки = ?(ОбъектXDTO.РезультатПроверки = "true", Истина, Ложь);
	РеквизитыДокумента.Вставить("РезультатПроверки", РезультатПроверки);
	
	ДатаИзмеренияПроверкиВыполнения
		= СериализаторXDTO.XMLЗначение(Тип("Дата"), ОбъектXDTO.ДатаИзмеренияПроверкиВыполнения);
	РеквизитыДокумента.Вставить("ДатаИзмеренияПроверкиВыполнения", ДатаИзмеренияПроверкиВыполнения);
	
	ФотоотчетОбязателен = ?(ОбъектXDTO.ФотоотчетОбязателен = "true", Истина, Ложь);
	РеквизитыДокумента.Вставить("ФотоотчетОбязателен", ФотоотчетОбязателен);
	
	Продолжительность = ?(Строка(ОбъектXDTO.Продолжительность) = "ОбъектXDTO", "", ОбъектXDTO.Продолжительность);
	РеквизитыДокумента.Вставить("Продолжительность", Продолжительность);
	
	Трудоемкость = СериализаторXDTO.XMLЗначение(ТипЧисло, ОбъектXDTO.Трудоемкость);
	РеквизитыДокумента.Вставить("Трудоемкость", Трудоемкость);
	
	ТабличнаяЧасть = СериализаторXDTO.XMLЗначение(ТипЧисло, ОбъектXDTO.ТабличнаяЧасть);
	РеквизитыДокумента.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	
	КоличествоЧеловек = СериализаторXDTO.XMLЗначение(ТипЧисло, ОбъектXDTO.КоличествоЧеловек);
	РеквизитыДокумента.Вставить("КоличествоЧеловек", КоличествоЧеловек);
	
	Комментарий = ?(Строка(ОбъектXDTO.Комментарий) = "ОбъектXDTO", "", ОбъектXDTO.Комментарий);
	РеквизитыДокумента.Вставить("Комментарий", Комментарий);
	
	ТехРешение = ?(Строка(ОбъектXDTO.ТехРешение) = "ОбъектXDTO", "", ОбъектXDTO.ТехРешение);
	РеквизитыДокумента.Вставить("ТехРешение", ТехРешение);

	Если СсылкаНаДокументСуществует Тогда
		НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	Иначе
		НовыйЭлемент = Документы.мп_ЗаданиеНаРемонт.СоздатьДокумент();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, РеквизитыДокумента);
	
	ТЗРезультат = ТаблицаЗначенийИзДвоичныхДанных(ОбъектXDTO, "МатериалыКОприходованию");
	Если ТипЗнч(ТЗРезультат) = Тип("ТаблицаЗначений") Тогда
		МатериалыКОприходованию = НовыйЭлемент.МатериалыКОприходованию.Выгрузить();
		МатериалыКОприходованию.Очистить();
		Для Каждого ТекСтрока Из ТЗРезультат Цикл
			ИмяСправочника = "Номенклатура";
			ЗначениеРеквизита = ТекСтрока.Номенклатура;
			Номенклатура = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ЗначениеРеквизита = ТекСтрока.НоменклатураВозврат;
			НоменклатураВозврат = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ИмяСправочника = "ХарактеристикиНоменклатуры";
			ЗначениеРеквизита = ТекСтрока.Характеристика;
			Характеристика = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ЗначениеРеквизита = ТекСтрока.ХарактеристикаВозврат;
			ХарактеристикаВозврат = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ИмяСправочника = "СерииНоменклатуры";
			ЗначениеРеквизита = ТекСтрока.Серия;
			Серия = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ИмяСправочника = "Склады";
			ЗначениеРеквизита = ТекСтрока.Склад;
			Склад = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);

			НоваяСтрока = МатериалыКОприходованию.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.НоменклатураВозврат = НоменклатураВозврат;
			НоваяСтрока.Характеристика = Характеристика;
			НоваяСтрока.ХарактеристикаВозврат = ХарактеристикаВозврат;
			НоваяСтрока.Серия = Серия;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.СтатусУказанияСерий = ТекСтрока.СтатусУказанияСерий;
			НоваяСтрока.Количество = ТекСтрока.Количество;
			
		КонецЦикла;
		НовыйЭлемент.МатериалыКОприходованию.Загрузить(МатериалыКОприходованию);
		
	КонецЕсли;
	
	ТЗРезультат = ТаблицаЗначенийИзДвоичныхДанных(ОбъектXDTO, "МатериалыКСписанию");
	Если ТипЗнч(ТЗРезультат) = Тип("ТаблицаЗначений") Тогда
		МатериалыКСписанию = НовыйЭлемент.МатериалыКСписанию.Выгрузить();
		МатериалыКСписанию.Очистить();
		Для Каждого ТекСтрока Из ТЗРезультат Цикл
			ИмяСправочника = "Номенклатура";
			ЗначениеРеквизита = ТекСтрока.Номенклатура;
			Номенклатура = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ЗначениеРеквизита = ТекСтрока.ЗаменаНоменклатура;
			ЗаменаНоменклатура = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ИмяСправочника = "ХарактеристикиНоменклатуры";
			ЗначениеРеквизита = ТекСтрока.Характеристика;
			Характеристика = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ЗначениеРеквизита = ТекСтрока.ЗаменаХарактеристика;
			ЗаменаХарактеристика = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ИмяСправочника = "СерииНоменклатуры";
			ЗначениеРеквизита = ТекСтрока.Серия;
			Серия = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ЗначениеРеквизита = ТекСтрока.ЗаменаСерия;
			ЗаменаСерия = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			ИмяСправочника = "Склады";
			ЗначениеРеквизита = ТекСтрока.Склад;
			Склад = РеквизитСправочникаПоУИД(ИмяСправочника, ЗначениеРеквизита);
			
			План = ТекСтрока.План;
			Факт = План;

			НоваяСтрока = МатериалыКСписанию.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Характеристика = Характеристика;
			НоваяСтрока.Серия = Серия;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.План = План;
			НоваяСтрока.Факт = Факт;
			НоваяСтрока.СтатусУказанияСерий = ТекСтрока.СтатусУказанияСерий;
			НоваяСтрока.ЗаменаНоменклатура = ЗаменаНоменклатура;
			НоваяСтрока.ЗаменаХарактеристика = ЗаменаХарактеристика;
			НоваяСтрока.ЗаменаСерия = ЗаменаСерия;
		КонецЦикла;
		НовыйЭлемент.МатериалыКСписанию.Загрузить(МатериалыКСписанию);
	КонецЕсли;
	НовыйЭлемент.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

Процедура ОбновитьРегистрациюДефекта(ЧтениеXML, СтруктураДанных)

	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

	НоваяСсылка = Документы.РегистрацияДефекта.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаНаДокументСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	ОтветОтЕРП = ?(ОбъектXDTO.ОтветОтЕРП = "true", Истина, Ложь);
 	Если Не ОтветОтЕРП Тогда

		ВерсияДанныхЕРП = ?(ОбъектXDTO.ВерсияДанныхЕРП = "ОбъектXDTO", "", ОбъектXDTO.ВерсияДанныхЕРП);
		СовпадаетВерсияДанных = (НоваяСсылка.ВерсияДанныхЕРП = ВерсияДанныхЕРП);
		Если СсылкаНаДокументСуществует И СовпадаетВерсияДанных Тогда
			Возврат;
		КонецЕсли;

		РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();

		ОтветственныйЗаУстранение = Справочники.Пользователи.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОбъектXDTO.ОтветственныйЗаУстранение));
		СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(ОтветственныйЗаУстранение);
		Если Не СсылкаСуществует Тогда
			ОтветственныйЗаУстранение = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
		ИмяРолиБригадира = "мп_БригадирТОиР";
		Если РольДоступна(ИмяРолиБригадира) И Не СсылкаНаДокументСуществует Тогда
			ЗагружаемДокумент = Истина;
		ИначеЕсли РольДоступна(ИмяРолиБригадира) И Не СовпадаетВерсияДанных Тогда
			ЗагружаемДокумент = Истина;
		ИначеЕсли СсылкаСуществует И ОтветственныйЗаУстранение = РеквизитыКонстант["ТекущийПользователь"] Тогда
			ЗагружаемДокумент = Истина;
		Иначе
			ЗагружаемДокумент = Ложь;
		КонецЕсли;

		Если ЗагружаемДокумент Тогда
			НовыйЭлемент = СоздатьДокументРегистрацияДефекта(НоваяСсылка, ОбъектXDTO, ОтветственныйЗаУстранение);
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
		Если СсылкаСуществует Тогда
			НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтатусыОбмена = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.мп_СтатусыОбмена Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СтатусыОбмена.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	СтатусыОбмена.Вставить("ОбъектXDTO", Перечисления.мп_СтатусыОбмена.ПустаяСсылка());
	
	Если ОтветОтЕРП Тогда
		НовыйЭлемент.СтатусОбмена = СтатусыОбмена[Строка(ОбъектXDTO.СтатусОбмена)];
	ИначеЕсли СтатусыОбмена[Строка(ОбъектXDTO.СтатусОбмена)] = Перечисления.мп_СтатусыОбмена.КВыгрузкеВМП Тогда
		НовыйЭлемент.СтатусОбмена = Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС;
		Если РольДоступна("мп_БригадирТОиР") Тогда
			НовыйЭлемент.ДополнительныеСвойства.Вставить("ЗагруженИзКИС", Истина);
		КонецЕсли;
	Иначе
		НовыйЭлемент.СтатусОбмена = СтатусыОбмена[Строка(ОбъектXDTO.СтатусОбмена)];
	КонецЕсли;

	Попытка
		Если Не НовыйЭлемент.ПометкаУдаления Тогда
			НовыйЭлемент.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НовыйЭлемент.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
	Исключение
		ТекстОшибки = СтрШаблон(
			"ОбменСервер.РегистрацияДефекта | Ошибка записи элемента РегистрацияДефекта %1", "");
		HTTPCore.ЗаписатьМобильнуюОшибку(ТекстОшибки, СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

Процедура ОбновитьНаработкуОбъектаЭксплуатации(ЧтениеXML, СтруктураДанных, Отправитель)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НоваяСсылка = Документы.НаработкаОбъектовЭксплуатации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ref));
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(НоваяСсылка);
	
	Если Не СсылкаСуществует Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОбмена = Новый Соответствие;
	Для Каждого ТекЗначПер Из Перечисления.мп_СтатусыОбмена Цикл 
		ИдентификаторЗначения = XMLСтрока(ТекЗначПер);
		СтатусыОбмена.Вставить(ИдентификаторЗначения, ТекЗначПер);
	КонецЦикла;
	СтатусыОбмена.Вставить("ОбъектXDTO", Перечисления.мп_СтатусыОбмена.ПустаяСсылка());
	
	НовыйЭлемент = НоваяСсылка.ПолучитьОбъект(); 
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.мп_СтатусОбмена = СтатусыОбмена[Строка(ОбъектXDTO.мп_СтатусОбмена)];
	
	Попытка
		
		НовыйЭлемент.Записать();
		
	Исключение
		ТекстОшибки = СтрШаблон(
			"ОбменСервер.НаработкаОбъектовЭксплуатации | Ошибка записи элемента НаработкаОбъектовЭксплуатации %1",
			ОбъектXDTO.Description);
			
		HTTPCore.ЗаписатьМобильнуюОшибку(ТекстОшибки, СтруктураДанных, , ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаписатьПакетКлиентПачкой(СтруктураДанных, ОбъектыОбмена = Неопределено, ОтветДляКИС = Ложь)

	Попытка
		УзелОбмена = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		Если УзелОбмена.Пустая() Тогда
			ВызватьИсключение "Узел обмена ЦБ не найден. Произведите регистрацию устройства.";

		КонецЕсли;

		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();

		ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
		ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);

		Если ОтветДляКИС Тогда
			ЗаписьXML.ЗаписатьАтрибут("MessageType", "Response");
		КонецЕсли;
		
		ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(
			УзелОбмена, ЗаписьСообщения.НомерСообщения, ОбъектыОбмена);
			
		Пока ВыборкаИзменений.Следующий() Цикл
			ОбъектОбменаУзел = ВыборкаИзменений.Получить();
			ЗаписатьXML(ЗаписьXML, ОбъектОбменаУзел);
		КонецЦикла;
		
		ЗаписьСообщения.ЗакончитьЗапись();
		
		СтруктураДанных.ПакетКлиент = ЗаписьXML.Закрыть();
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			"ОбменСервер.ЗаписатьПакетКлиент | Ошибка формирования пакета данных на клиенте", СтруктураДанных, ,
			ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Функция ОчиститьПакетОтСоставногоРеквизита(ПакетКлиент, ВидДокумента, СоставнойРеквизит)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ПакетКлиент);
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	
	ВНужномДокументе = Ложь;
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если Чтение.Имя = ВидДокумента Тогда
				ВНужномДокументе = Истина;
				Запись.ЗаписатьТекущий(Чтение);
				Продолжить;
			КонецЕсли;
			
			Если ВНужномДокументе И Чтение.Имя = СоставнойРеквизит Тогда
				Чтение.Пропустить();
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = ВидДокумента Тогда
			ВНужномДокументе = Ложь;
		КонецЕсли;
		
		Запись.ЗаписатьТекущий(Чтение);
		
	КонецЦикла;
	
	Возврат Запись.Закрыть();
	
КонецФункции

Процедура ЗаписатьПакетКлиент(СтруктураДанных, ОбъектОбмена = Неопределено)
	
	Попытка
		УзелОбмена = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		Если УзелОбмена.Пустая() Тогда
			ВызватьИсключение "Узел обмена ЦБ не найден. Произведите регистрацию устройства.";
			
		КонецЕсли;
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		
		ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
		ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
		
		ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(
			УзелОбмена, ЗаписьСообщения.НомерСообщения, ОбъектОбмена);
			
		Пока ВыборкаИзменений.Следующий() Цикл
			ОбъектОбменаУзел = ВыборкаИзменений.Получить();
			ЗаписатьXML(ЗаписьXML, ОбъектОбменаУзел);
		КонецЦикла;
		
		ЗаписьСообщения.ЗакончитьЗапись();
		ПакетКлиент = ЗаписьXML.Закрыть();
		ПакетКлиент = ОчиститьПакетОтСоставногоРеквизита(ПакетКлиент, "DocumentObject.мп_НарядНаРемонт", "Работа");
		СтруктураДанных.ПакетКлиент = ПакетКлиент;
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			"ОбменСервер.ЗаписатьПакетКлиент | Ошибка формирования пакета данных на клиенте", СтруктураДанных, ,
			ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти