#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Данные плана обмена
//
// Параметры:
//  СтруктурДанных - Структура - Структура описываемых данных
Процедура ДанныеПланаОбмена(СтруктураДанных) Экспорт
	
	ЭтотУзел = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ЭтотУзел();
	Если ЗначениеЗаполнено(ЭтотУзел.Код) И ЗначениеЗаполнено(ЭтотУзел.Наименование) Тогда
		СтруктураДанных.ПланОбмена.ПланОбменаКод = ЭтотУзел.Код;
		СтруктураДанных.ПланОбмена.ПланОбменаНаименование = ЭтотУзел.Наименование;
		УИДУзелОбменаОстатков = УИДУзлаОбменаОстатков();
		СтруктураДанных.ПланОбменаОстатки.УИДУзелОбменаОстатков = УИДУзелОбменаОстатков;
		
		НаименованиеОбмена = Строка(УИДУзелОбменаОстатков) + " UpdateCatalogs";
		РезультатЗапроса = НайтиУзелПоУИД(УИДУзелОбменаОстатков);
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтруктураДанных.ПланОбменаОстатки.Код = Выборка.Код;
			СтруктураДанных.ПланОбменаОстатки.Наименование = Выборка.Наименование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создание узла плана обмена, сброс счетчика сообщений.
//
// Параметры:
//  СтруктураДанных	 - Структура - Данные иницилизированной структуры, 
//    см. HTTPCore.ПолучитьСтруктуруОбрабатываемыхДанных()
//
Процедура ИнициализацияПланаОбмена(СтруктураДанных) Экспорт
	
	Попытка
		ИдентификаторМП = Строка(Константы.ID.Получить());
		
		ЭтотУзел = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ЭтотУзел();
		
		УзелОбъект = ЭтотУзел.ПолучитьОбъект();
		УзелОбъект.Код = СтруктураДанных.ПланОбмена.ПланОбменаКод;
		УзелОбъект.Наименование = СтруктураДанных.ПланОбмена.ПланОбменаНаименование;
		УзелОбъект.ДатаВремяПоследнегоОбмена = ТекущаяДатаСеанса();
		УзелОбъект.Записать();
		
		Если ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.НайтиПоКоду("ЦБ")
			= ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ПустаяСсылка() Тогда
			ГлавныйУзел = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.СоздатьУзел();
			ЗаполнитьЗначенияСвойств(ГлавныйУзел, СтруктураДанных.ПланОбмена.ПланОбменаУзелЦБ);
			ГлавныйУзел.ЭтотУзел = Ложь;
			ГлавныйУзел.Записать();
			
		Иначе
			ГлавныйУзел = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.НайтиПоКоду("ЦБ").ПолучитьОбъект();
			ГлавныйУзел.НомерОтправленного = 0;
			ГлавныйУзел.НомерПринятого = 0;
			ГлавныйУзел.Записать();
			
		КонецЕсли;
		
		УИДУзелОбменаОстатков = СтруктураДанных.ПланОбменаОстатки.УИДУзелОбменаОстатков;
		РезультатЗапроса = НайтиУзелПоУИД(УИДУзелОбменаОстатков);
		
		Если РезультатЗапроса.Пустой() Тогда
			СсылкаНаУзелОстатков = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.ПолучитьСсылку(УИДУзелОбменаОстатков);
			УзелЗагрузкиОстатков = ПланыОбмена.мп_ОбменМобильноеПриложениеТОИР.СоздатьУзел();
			УзелЗагрузкиОстатков.УстановитьСсылкуНового(СсылкаНаУзелОстатков);
			УзелЗагрузкиОстатков.Код = СтруктураДанных.ПланОбменаОстатки.Код;
			УзелЗагрузкиОстатков.Наименование = СтруктураДанных.ПланОбменаОстатки.Наименование;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			УзелЗагрузкиОстатков = Выборка.Узел.ПолучитьОбъект();
			УзелЗагрузкиОстатков.НомерОтправленного = 0;
			УзелЗагрузкиОстатков.НомерПринятого = 0;
		КонецЕсли;
		УзелЗагрузкиОстатков.Записать();

		Константы.ГруппаСкладовОбменаДанными.Установить(Справочники.Склады.ПустаяСсылка());
		
	Исключение
		HTTPCore.ЗаписатьМобильнуюОшибку(
			"ИнициализацияПланаОбмена | Ошибка инициализации узла обмена", ,
			СтруктураДанных,
			ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Функция УИДУзлаОбменаОстатков() Экспорт
	Если Не ЗначениеЗаполнено(Константы.УИДУзелОбменаОстатков.Получить()) Тогда
		Константы.УИДУзелОбменаОстатков.Установить(Новый УникальныйИдентификатор);
	КонецЕсли;
	Возврат Константы.УИДУзелОбменаОстатков.Получить();
КонецФункции

#КонецОбласти

Функция НайтиУзелПоУИД(УИДУзелОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	мп_ОбменМобильноеПриложениеТОИР.Ссылка КАК Узел,
	|	мп_ОбменМобильноеПриложениеТОИР.Код КАК Код,
	|	мп_ОбменМобильноеПриложениеТОИР.Наименование КАК Наименование
	|ИЗ
	|	ПланОбмена.мп_ОбменМобильноеПриложениеТОИР КАК мп_ОбменМобильноеПриложениеТОИР
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(мп_ОбменМобильноеПриложениеТОИР.Ссылка) = &УИДУзелОбмена";
	
	
	Запрос.УстановитьПараметр("УИДУзелОбмена", УИДУзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецЕсли