
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.СохранитьИзменения = Ложь;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ТаблицаРаботы");
	Если Параметры.Свойство("Подразделение") Тогда
		ВыбранноеПодразделение = Параметры.Подразделение;
	Иначе
		ВыбранноеПодразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Подразделение", ВыбранноеПодразделение, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЭтотОбъект.Ответственный.Очистить();
	Для Каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ЭтотОбъект.Ответственный.Добавить(ТекСтрока);
	КонецЦикла;
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("Ответственный", ЭтотОбъект.Ответственный);
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ОповеститьОВыборе(ЗначенияСтроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ЭтотОбъект.Ответственный = Значение;
	ЭтотОбъект.СохранитьИзменения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)

	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();

КонецПроцедуры

#КонецОбласти

