#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") Тогда
		ЭтотОбъект.Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	ЗначенияКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ЭтотОбъект.ВыбранныйСклад = ЗначенияКонстант["ГруппаСкладовОбменаДанными"];
	УстановкаПараметроСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	УстановкаПараметроСписка();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановкаПараметроСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоОстаткам", ЗначениеЗаполнено(ЭтотОбъект.Номенклатура));
	Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", ЭтотОбъект.Номенклатура);
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйСклад", ЭтотОбъект.ВыбранныйСклад);

КонецПроцедуры

#КонецОбласти