
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаЭлементов = "Подразделение";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);
	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ЭтотОбъект.Ответственный = РеквизитыКонстант["ТекущийПользователь"];
	Для Каждого ТекСтрока Из Параметры.ИсключаемыеДокументы Цикл
		ЭтотОбъект.ИсключаемыеДокументы.Добавить(ТекСтрока);
	КонецЦикла;
	ЭтотОбъект.ПлановаяДата = ТекущаяДатаСеанса() + 86400;
	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЭтотОбъект.ВыбранныеДокументы.Очистить();
	Для Каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ЭтотОбъект.ВыбранныеДокументы.Добавить(ТекСтрока);
	КонецЦикла;
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("ВыбранныеДокументы", ЭтотОбъект.ВыбранныеДокументы);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ОповеститьОВыборе(ЗначенияСтроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборСпискаНаСервере()

	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", ЭтотОбъект.Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ЭтотОбъект.Ответственный);
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	Список.Параметры.УстановитьЗначениеПараметра("ПлановаяДата", ЭтотОбъект.ПлановаяДата);
	Список.Параметры.УстановитьЗначениеПараметра("ИсключаемыеДокументы", ЭтотОбъект.ИсключаемыеДокументы);
	
	СортировкаПоДате();

КонецПроцедуры

&НаСервере
Процедура СортировкаПоДате()
	Порядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		Список.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Дата");
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование = Истина;
	ОбновитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()

	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти