
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборГруппыСкадовДляОбменаДанными(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВыборГруппыСкладовОбмена");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиHTTPПодключения(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиHTTPПодключения");
	
КонецПроцедуры

&НаКлиенте
Процедура Регистрация(Команда)
	ОткрытьФорму("ОбщаяФорма.РегистрацияУстройства");
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновлений(Команда)
	ОткрытьФорму("ОбщаяФорма.СписокОбновленийПриложения", , , , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтильОформленияПриИзменении(Элемент)
	
	СтильОформленияПриИзмененииНаСервере();
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СтильОформленияПриИзмененииНаСервере()
	
	Константы.СтильОформления.Установить(НаборКонстант.СтильОформления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОнлайнОбменДаннымиПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.ОнлайнОбменДанными Тогда
		Элементы.КаталогЗагрузкиДанныхПоУмолчанию.Видимость = Истина;
		Элементы.КаталогВыгрузкиДанныхПоУмолчанию.Видимость = Истина;
		Элементы.НастройкиHTTPПодключения.Видимость = Ложь;
	Иначе
		Элементы.КаталогЗагрузкиДанныхПоУмолчанию.Видимость = Ложь;
		Элементы.КаталогВыгрузкиДанныхПоУмолчанию.Видимость = Ложь;
		Элементы.НастройкиHTTPПодключения.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти