
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ЭтотОбъект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
	ЭтотОбъект.ПлановаяДата = ТекущаяДатаСеанса();

	РеквизитыОтбора = ДоступностьРедактированияОтбора();
	Для Каждого ТекРеквизит Из РеквизитыОтбора Цикл
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, ТекРеквизит.Ключ, "Доступность", ТекРеквизит.Значение);
	КонецЦикла;

	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	ЭтотОбъект.СтатусОбмена.Добавить(Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС);

	ЭтотОбъект.СтатусОбмена = ОбщегоНазначенияВызовСервера.ПерсональнаяНастройка(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);

	ОтборСпискаНаСервере();

	СортировкаПоДате();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ПриЗакрытииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеОчистка(Элемент, СтандартнаяОбработка)

	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если ПраваДоступа.БригадирТОиР Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФактическаяДатаПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаРемонтПриИзменении(Элемент)
	ОтборСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СтатусОбменаОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокВыбора = ОбщегоНазначенияКлиент.СтатусыОбменаКлиент(ЭтотОбъект.СтатусОбмена);

	ВыбранноеЗначение = Ждать СписокВыбора.ОтметитьЭлементыАсинх("Выберите статусы");
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ЭтотОбъект.СтатусОбмена.Очистить();
	Для Каждого ТекСтатус Из ВыбранноеЗначение Цикл
		Если ТекСтатус.Пометка Тогда
			ЭтотОбъект.СтатусОбмена.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;

	ОтборСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтатусОбменаОтборУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Для Каждого ТекИдентификатор Из Идентификаторы Цикл
		УдаляемыйЭлемент = ЭтотОбъект.СтатусОбмена.НайтиПоИдентификатору(ТекИдентификатор);
		ЭтотОбъект.СтатусОбмена.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	ОтборСпискаНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	ДокПроведения = ЭтотОбъект.ТекущийЭлемент.ТекущаяСтрока;
	РеквизитыДокумента = РеквизитыДокумента(ДокПроведения);
	ТекущийИсточник = РеквизитыДокумента.Источник;
	СтатусОбмена = РеквизитыДокумента.СтатусОбмена;
	ПометкаУдаления = РеквизитыДокумента.ПометкаУдаления;
	
	Если ПометкаУдаления Тогда
		ПоказатьПредупреждение(,
			"Нельзя проводить помеченный на удаление документ, перед удалением снимите пометку удаления", 30, "Ошибка");
		Возврат;
	КонецЕсли;
	СписокОшибок = КонтрольОстатковМатериаловСписания(ДокПроведения);
	Если СписокОшибок.Количество() Тогда
		Отказ = Истина;
		СтрСообщение = "Превышен остаток:";
		РаздСтрок = Символы.ПС;
		Для Каждого ТекСтрока Из СписокОшибок Цикл
			ОписаниеОшибки = СтрШаблон("Для %1 на %2", ТекСтрока.Номенклатура, ТекСтрока.Факт - ТекСтрока.Остаток);
			СтрСообщение = СтрСообщение + РаздСтрок + ОписаниеОшибки;
		КонецЦикла;
		СтрСообщение = СтрСообщение +РаздСтрок + "Обновить остатки?";
		ОповещениеОшибки = Новый ОписаниеОповещения("ОбновлениеОстатков", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОшибки, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		ПровестиДокументСервер(ДокПроведения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеДокумента(Команда)
	ПометкаУдаленияОтменаПроведения("ИнтерактивнаяОтменаПроведения");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)
	ПометкаУдаленияОтменаПроведения("ИнтерактивнаяПометкаУдаления");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборСпискаНаСервере()

	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", ЭтотОбъект.Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный", ЭтотОбъект.Ответственный);
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	Список.Параметры.УстановитьЗначениеПараметра("ФактическаяДата", ЭтотОбъект.ФактическаяДата);
	Список.Параметры.УстановитьЗначениеПараметра("ПлановаяДата", ЭтотОбъект.ПлановаяДата);
	Список.Параметры.УстановитьЗначениеПараметра("ЗаказНаРемонт", ЭтотОбъект.ЗаказНаРемонт);
	
	СтатусыОбменаВЗапрос = Новый Массив;
	Для Каждого ТекСтатус Из ЭтотОбъект.СтатусОбмена Цикл
		СтатусыОбменаВЗапрос.Добавить(ТекСтатус.Значение);
	КонецЦикла;
	Список.Параметры.УстановитьЗначениеПараметра("СтатусыОбмена", СтатусыОбменаВЗапрос);
	
	СортировкаПоДате();
	
КонецПроцедуры

&НаСервере
Процедура СортировкаПоДате()
	Порядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		Список.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Дата");
	НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрольОстатковМатериаловСписания(ДокПроведния)

	ТЗ = ДокПроведния.МатериалыКСписанию.Выгрузить();
	СписокОшибок = ЗаданиеНаРемонтВызовСервераЛокализация.КонтрольОстатковМатериаловСписания(ТЗ, ДокПроведния.Дата);
	Возврат СписокОшибок;

КонецФункции

&НаКлиенте
Процедура ОбновлениеОстатков(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = ОбновлениеНоменклатуры();
		Если Результат Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"Остатки обновлены, можно повторно провести документ.");
		иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				"Ошибка загрузки остатков. Запишите документ без проведения и попробуйте обновить остатки");
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Запишите документ без проведения и попробуйте обновить остатки");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновлениеНоменклатуры()
	Возврат ОбменСервер.ОбновлениеНоменклатуры();
КонецФункции

&НаСервере
Процедура ПровестиДокументСервер(Знач ДокПроведения)

	Если Не ПравоНаДокумент("ИнтерактивноеПроведение") Тогда
		Возврат;
	КонецЕсли;

	Если ДокПроведения.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	ДокОбъект = ДокПроведения.ПолучитьОбъект();
	ПроверкаПройдена = ДокОбъект.ПроверитьЗаполнение();
	Если ПроверкаПройдена Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоНаДокумент(Знач ВидПроверки)

	Возврат ПравоДоступа(ВидПроверки, Метаданные.Документы.мп_ЗаданиеНаРемонт);

КонецФункции

&НаСервереБезКонтекста
Функция ДоступностьРедактированияОтбора()

	РеквизитыОтбора = Новый Структура;
	РеквизитыОтбора.Вставить("Подразделение", Ложь);
	РеквизитыОтбора.Вставить("Ответственный", Истина);
	РеквизитыОтбора.Вставить("ОбъектЭксплуатации", Истина);
	РеквизитыОтбора.Вставить("ПлановаяДата", Ложь);
	РеквизитыОтбора.Вставить("ФактическаяДата", Ложь);
	
	Если РольДоступна("мп_АдминистрированиеТОиР") Или РольДоступна("мп_ПросмотрДокументовТОиР") Тогда
		РеквизитыОтбора.Подразделение = Истина;
		РеквизитыОтбора.Ответственный = Истина;
		РеквизитыОтбора.ОбъектЭксплуатации = Истина;
		РеквизитыОтбора.ПлановаяДата = Истина;
		РеквизитыОтбора.ФактическаяДата = Истина;
	ИначеЕсли  РольДоступна("мп_БригадирТОиР") Тогда
		РеквизитыОтбора.Подразделение = Истина;
		РеквизитыОтбора.Ответственный = Истина;
		РеквизитыОтбора.ОбъектЭксплуатации = Истина;
		РеквизитыОтбора.ПлановаяДата = Истина;
		РеквизитыОтбора.ФактическаяДата = Истина;
	ИначеЕсли  РольДоступна("мп_ДобавлениеИзменениеДокументовТОиР") Тогда
		РеквизитыОтбора.Подразделение = Ложь;
		РеквизитыОтбора.ОбъектЭксплуатации = Истина;
		РеквизитыОтбора.ПлановаяДата = Истина;
		РеквизитыОтбора.ФактическаяДата = Истина;
	КонецЕсли;
	Возврат РеквизитыОтбора;
КонецФункции

&НаКлиенте
Процедура ОтменаПроведенияДокументаАдминистратором(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокПроведения = ДопПараметры.ДокПроведения;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, "ИнтерактивнаяОтменаПроведения");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаленияДокументаАдминистратором(РезультатВопроса, ДопПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокПроведения = ДопПараметры.ДокПроведения;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, "ИнтерактивнаяПометкаУдаления");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаленияОтменаПроведения(ДействиеСДокументом)
	ДокПроведения = ЭтотОбъект.ТекущийЭлемент.ТекущаяСтрока;
	РеквизитыДокумента = РеквизитыДокумента(ДокПроведения);
	ПометкаУдаления = РеквизитыДокумента.ПометкаУдаления;
	ТекущийИсточник = РеквизитыДокумента.Источник;
	СтатусОбмена = РеквизитыДокумента.СтатусОбмена;
	Проведен = РеквизитыДокумента.Проведен;
	АдминТОиР = ОбщегоНазначенияВызовСервера.АдминистраторТОиР();
	ИсточникКИС = 
		(РеквизитыДокумента.Источник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.КИС"));
	ИсточникМП = 
		(РеквизитыДокумента.Источник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.МечелТОиР"));
		
	ВыполнениеОперации = РеквизитыДокумента.ВыполнениеОперации;
	СтатусВыполненияОперации = СостояниеВыполнениеОперации(ВыполнениеОперации);

	Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
		Если Проведен И ИсточникМП И СтатусВыполненияОперации И АдминТОиР Тогда
			СтрСообщение = "Информация об отмене проведения задания на ремонт будет выгружена в КИС"
				+ ", но заказ на ремонт не будет изменён. Необходимо будет внести изменения вручную. Продолжить?";

			ПроцедураОповещенияСтр = "ОтменаПроведенияДокументаАдминистратором";
			ДопПараметр = Новый Структура;
			ДопПараметр.Вставить("ДокПроведения", ДокПроведения);
			ПроцедураОповещения = Новый ОписаниеОповещения(ПроцедураОповещенияСтр, ЭтотОбъект, ДопПараметр);
			ПоказатьВопрос(ПроцедураОповещения, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
			Возврат;
		ИначеЕсли (Проведен И СтатусВыполненияОперации) Или ИсточникКИС Тогда
			СтрСообщение = "Нельзя отменять проведение";
			ПоказатьПредупреждение(, СтрСообщение, 30);
			Возврат;
		КонецЕсли;
	
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, ДействиеСДокументом);
	ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
		Если Проведен И ИсточникМП И СтатусВыполненияОперации И АдминТОиР Тогда
			СтрСообщение = "Информация об установке пометки удаления задания на ремонт будет выгружена в КИС"
				+ ", но заказ на ремонт не будет изменён. Необходимо будет внести изменения вручную. Продолжить?";

			ПроцедураОповещенияСтр = "ПометкаУдаленияДокументаАдминистратором";
			ДопПараметр = Новый Структура;
			ДопПараметр.Вставить("ДокПроведения", ДокПроведения);
			ПроцедураОповещения = Новый ОписаниеОповещения(ПроцедураОповещенияСтр, ЭтотОбъект, ДопПараметр);
			ПоказатьВопрос(ПроцедураОповещения, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
			Возврат;
		ИначеЕсли (Проведен И СтатусВыполненияОперации И Не ПометкаУдаления) Или ИсточникКИС Тогда
			СтрСообщение = "Нельзя помечать на удаление";
			ПоказатьПредупреждение(, СтрСообщение, 30);
			Возврат;
		КонецЕсли;
		ПометкаОтменаПроведенияДокументСервер(ДокПроведения, ДействиеСДокументом);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеВыполнениеОперации(ВыполнениеОперации)
	Возврат Документы.мп_ЗаданиеНаРемонт.СостояниеВыполнениеОперации(ВыполнениеОперации);
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыДокумента(ДокПроведения)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокПроведения
		, "Источник, ПометкаУдаления, СтатусОбмена, Проведен, ВыполнениеОперации");
КонецФункции

&НаСервере
Процедура ПометкаОтменаПроведенияДокументСервер(Знач ДокПроведения, ДействиеСДокументом)
	ДокОбъект = ДокПроведения.ПолучитьОбъект();
	Если ДействиеСДокументом = "ИнтерактивнаяОтменаПроведения" Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	ИначеЕсли ДействиеСДокументом = "ИнтерактивнаяПометкаУдаления" Тогда
		Действие = Не ДокПроведения.ПометкаУдаления;
		ДокОбъект.УстановитьПометкуУдаления(Действие);
	КонецЕсли;
	ОбновитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()

	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ОбщегоНазначенияВызовСервера.СохранитьПерсональнуюНастройку(
		ТекущийПользователь, ЭтотОбъект.ИмяФормы, "СтатусОбмена", ЭтотОбъект.СтатусОбмена);

КонецПроцедуры

#КонецОбласти