
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ДляПоказателейНаработки = Ложь;
	ЭтотОбъект.ДляВидовПроверокОборудования = Ложь;
	ЭтотОбъект.ДляРегистрацииДефекта = Ложь;
	
	УстановкаПараметроСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДляПоказателейНаработкиПриИзменении(Элемент)
	
	УстановкаПараметроСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ДляВидовПроверокОборудованияПриИзменении(Элемент)
	
	УстановкаПараметроСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ДляРегистрацииДефектаПриИзменении(Элемент)
	
	УстановкаПараметроСписка();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановкаПараметроСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьПоказателиНаработки", ЭтотОбъект.ДляПоказателейНаработки);
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьВидыПроверок", ЭтотОбъект.ДляВидовПроверокОборудования);
	Список.Параметры.УстановитьЗначениеПараметра("ЭтоРемУзел", ЭтотОбъект.ДляРегистрацииДефекта);
	
КонецПроцедуры

#КонецОбласти