#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ОбщегоНазначенияСервер.ОткрытиеПросмотр() Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресФото) Тогда
		Сжатие = Новый СжатиеДанных(9);
		ТекущийОбъект.ФотоФайл = 
			Новый ХранилищеЗначения(
				ПолучитьИзВременногоХранилища(АдресФото), Сжатие);
				
		ТекущийОбъект.ФотоФайлДвоичный = Строка64;
	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДанныеКартинки = ТекущийОбъект.ФотоФайл.Получить();
	Если ДанныеКартинки <> Неопределено Тогда
		АдресФото = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура СделатьФото(Команда)
	
	#Если НЕ МобильноеПриложениеКлиент Тогда
		Сообщить ("Функция не поддерживается");
		Возврат;
	#КонецЕсли
	Результат = Вычислить("СредстваМультимедиа.СделатьФотоснимок()");
	//Результат = 
	//	СредстваМультимедиа.СделатьФотоснимок();

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИнициализироватьКартинкуНаФорме(Результат.ПолучитьДвоичныеДанные());

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьКартинкуНаФорме(ДанныеКартинки)

	Если ДанныеКартинки <> Неопределено Тогда
		АдресФото = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
		ПоместитьКартинку_ФотоФайлДвоичный(ДанныеКартинки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьКартинку_ФотоФайлДвоичный(ДанныеКартинки)
	Строка64 = Base64Строка(ДанныеКартинки);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФото(Команда)

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл'; en = 'Select file'");
	ПараметрыДиалога.Фильтр =  "Изображения|*.png;*.jpg;*.jpeg";
	ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеОбратныйВызов", ЭтотОбъект);
	ПрогрессОбратныйВызов = Новый ОписаниеОповещения("ПрогрессОбратныйВызов", ЭтотОбъект);
	ПередНачаломОбратныйВызов = Новый ОписаниеОповещения("ПередНачаломОбратныйВызов", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЗавершениеОбратныйВызов, ПрогрессОбратныйВызов, ПередНачаломОбратныйВызов, , ПараметрыДиалога, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбратныйВызов(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеПомещенногоФайла.Адрес);
	ИнициализироватьКартинкуНаФорме(ДвоичныеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПрогрессОбратныйВызов(ПомещаемыйФайл, Помещено, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт

	ТекстСообщения = СтрШаблон(НСтр("ru = 'Загрузка файла %1'; en = 'Uploading file %1'"), ПомещаемыйФайл.Имя);
	РазмерФайла = СтрШаблон(Нстр("ru = 'Размер файла %1 байт'; en = 'File size %1 bytes'"), ПомещаемыйФайл.Размер());
	
	Состояние(ТекстСообщения, Помещено, РазмерФайла, БиблиотекаКартинок.Картинка);

КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломОбратныйВызов(ПомещаемыйФайл, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт
	ЗначенияКонстант = ЗначенияКонстант();
	МаксимальныйРазмерФото = ЗначенияКонстант["МаксимальныйРазмерФото"];
	МегабайтВБайтах = МаксимальныйРазмерФото*1000000;
	Если ПомещаемыйФайл.Размер() > МегабайтВБайтах Тогда
		ОтказОтПомещенияФайла = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Отказ. Загружаемый файл «%1» имеет размер более 5 мегабайт';
		|en = 'Failure. The uploaded file «%1» is larger than 1 megabyte'"), ПомещаемыйФайл.Имя);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		ОтказОтПомещенияФайла = Истина;
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка файла'; en = 'Uploading file'"),, ПомещаемыйФайл.Имя);
	КонецЕсли;  

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияКонстант()
	ЗначенияКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	Возврат ЗначенияКонстант;
КонецФункции

