#Область ОбработчикиКомандФормы

#Область Синхронизация

&НаКлиенте
Процедура Синхронизация(Команда)

	Результат = СинхронизацияНаСервере();
	ПроверитьРезультат(Результат, "Синхронизация");

КонецПроцедуры

&НаСервере
Функция СинхронизацияНаСервере()

	Возврат ОбменСервер.Синхронизация();

КонецФункции

#КонецОбласти

#Область ПроверкаСвязи

&НаКлиенте
Процедура ПроверкаСвязи(Команда)

	Результат = ПроверкаСвязиНаСервере();
	ПроверитьРезультат(Результат, "Проверка связи");

КонецПроцедуры

&НаСервере
Функция ПроверкаСвязиНаСервере()

	Возврат ОбменСервер.ПроверкаСвязи();

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьРезультат(Результат, ВидПроцедуры)

	Если Результат = Истина Тогда
		Информация = СтрШаблон("%1 завершилась успешно", ВидПроцедуры);
	Иначе
		Информация = СтрШаблон("%1 завершилась с ошибками. %2 Смотрите журнал результатов.", ВидПроцедуры, Символы.ПС);
	КонецЕсли;

КонецПроцедуры

#Область ФоновыйОбмен

// Надо подумать как сделать фоновый обмен документов. Возможна нужна будет форма где будет иницилизирована
// проверка по времени и запуск обмена.
// при этом надо проверить если есть пользователи в базе и склады заполнены, только тогда нужно запускать фоновый обмен
//
// ИнтервалОбмена = константа.
// ПодключитьОбработчикОжидания("ЗапускФоновогоОбмена", ИнтервалОбмена, Ложь);

&НаКлиенте
Процедура ЗапускФоновогоОбмена()

	ФоновыеЗаданияВызовСервера.ЗапуститьФоновыйОбмен();

КонецПроцедуры

#КонецОбласти

#КонецОбласти