#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выбрать изменения (регистрация) документа 
//
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Результат запроса.
//
Функция ВыбратьИзменения() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияДефектаИзменения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РегистрацияДефекта.Изменения КАК РегистрацияДефектаИзменения
	|ГДЕ
	|	РегистрацияДефектаИзменения.Ссылка.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли