#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		Если ОбщегоНазначенияСервер.ЗапретПометкиУдаленияДокументовТОиР(СтатусОбмена) Тогда
			Отказ = Истина;
			СтатусДокумента = Перечисления.мп_СтатусыОбмена.СтатусПредставленияДокумента(СтатусОбмена);
			ОбщегоНазначения.СообщитьПользователю(СтатусДокумента + ": нельзя помечать на удаление", , , Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если Не ЭтотОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		
		Возврат;
		
	КонецЕсли;

	УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
	ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;
	
	Если ОбщегоНазначенияСервер.ЗапретПометкиУдаленияДокументовТОиР(СтатусОбмена) Тогда
		
		Отказ = Истина;
		СтатусДокумента = Перечисления.мп_СтатусыОбмена.СтатусПредставленияДокумента(СтатусОбмена);
		ОбщегоНазначения.СообщитьПользователю(СтатусДокумента + ": нельзя отменять проведение", , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе

	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли