#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполняетсяЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь;;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "Работа, ИдентификаторСтроки,НомерСтроки,Подразделение";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);
	Для Каждого ТекСтрока Из Параметры.Исполнители Цикл
		НоваяСтрока = ЭтотОбъект.Исполнители.Добавить();
		НоваяСтрока.Ответственный = ТекСтрока;
	КонецЦикла;

	Если Параметры.ТолькоПросмотр Тогда
		ЗакрытьДоступ = Новый Массив;
		ЗакрытьДоступ.Добавить("ФормаСохранить");
		ЗакрытьДоступ.Добавить("Исполнители");
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ЗакрытьДоступ, "Доступность", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ВыполняетсяЗакрытие Тогда
		Если ЭтотОбъект.Модифицированность И Не ЭтотОбъект.СохранитьИзменения Тогда
			ПроцедураОповещения = Новый ОписаниеОповещения("ВопросПередЗакрытием", ЭтотОбъект);
			СтрСообщение = "Есть изменения, сохранить?";
			ПоказатьВопрос(ПроцедураОповещения, СтрСообщение, РежимДиалогаВопрос.ДаНет, 60);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ВыполняетсяЗакрытие Тогда
		ЗначенияСтроки = Новый Структура;
		ЗначенияСтроки.Вставить("Работа", ЭтотОбъект.Работа);
		ЗначенияСтроки.Вставить("Исполнители", Исполнители());
		ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
		ОповеститьОВыборе(ЗначенияСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытием(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		ЭтотОбъект.СохранитьИзменения = Истина;
		Закрыть();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ВыполняетсяЗакрытие = Истина;
		ЭтотОбъект.Модифицированность = Ложь;
		ЭтотОбъект.СохранитьИзменения = Ложь;
		Закрыть();
	Иначе
		ВыполняетсяЗакрытие = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.Пользователи.Форма.ФормаВыбораИзДокумента" Тогда
		ДанныеСтроки = ЭтотОбъект.Исполнители.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ИсточникВыбора.СохранитьИзменения Тогда
			ВыбранныеИсполнители(ИсточникВыбора.Ответственный);
			ЭтотОбъект.Модифицированность = Истина;
		Иначе
			Если ДанныеСтроки.ЭтоНоваяСтрока Тогда
				НомерСтроки = ЭтотОбъект.Исполнители.Количество();
				ЭтотОбъект.Исполнители.Удалить(НомерСтроки - 1);
				ЭтотОбъект.Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсполнители

&НаКлиенте
Процедура ИсполнителиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИсполнителя(Команда)
	//Строка = ЭтотОбъект.Исполнители.Добавить();
	//Строка.ЭтоНоваяСтрока = Истина;

	//ОткрытьФормуРедактированияИсполнителя(Строка);
	ОткрытьФормуРедактированияИсполнителя();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИсполнителя(Команда)
	ЭтотОбъект.Исполнители.Удалить(Элементы.Исполнители.ТекущиеДанные);
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция Исполнители()
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(ЭтотОбъект.Исполнители, "Ответственный", Истина);
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРедактированияИсполнителя()

	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("НомерСтроки", Строка(ЭтотОбъект.УникальныйИдентификатор));
	ДанныеСтроки.Вставить("ТаблицаРаботы", Ложь);
	ПраваДоступа = ОбщегоНазначенияВызовСервера.ДоступныеПрава();
	Если Не ПраваДоступа.АдминТОиР Тогда
		ДанныеСтроки.Вставить("Подразделение", ЭтотОбъект.Подразделение);
	КонецЕсли;

	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбораИзДокумента",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Процедура ВыбранныеИсполнители(Знач Ответственные)

	ТЗИсполнители = ЭтотОбъект.Исполнители.Выгрузить();
	
	Для Каждого ТекСтрока Из Ответственные Цикл
		Если ТЗИсполнители.Найти(ТекСтрока.Значение, "Ответственный") = Неопределено Тогда
			НоваяСтрока = ТЗИсполнители.Добавить();
			НоваяСтрока.Ответственный = ТекСтрока.Значение;
		КонецЕсли;
	КонецЦикла;
	ЭтотОбъект.Исполнители.Загрузить(ТЗИсполнители);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	ВыполняетсяЗакрытие = Истина;
	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти
