#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Проверяет есть ли хоть один пользователь в ИБ
//
// Возвращаемое значение:
//   - Булево - Истина, пользователь есть; Ложь, пользователей нет.
//
Функция ЕстьПользователиВБазе() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Пользователи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	НЕ Пользователи.Служебный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция - Поиск пользователя по логину в ИБ
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Ссылка на пользователя информационной базы
//
// Возвращаемое значение:
//   - Структура - В качестве ключа передается строка, в качестве значения данные из запроса.
//
Функция НайтиПользователяПоЛогину(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка КАК Пользователь,
		|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
		|	Пользователи.Логин КАК Логин
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ДанныеПользователя = Новый Соответствие;
	ДанныеПользователя.Вставить("Пользователь", ВыборкаДетальныеЗаписи.Пользователь);
	ДанныеПользователя.Вставить("ИдентификаторПользователяИБ", ВыборкаДетальныеЗаписи.ИдентификаторПользователяИБ);
	ДанныеПользователя.Вставить("Логин", ВыборкаДетальныеЗаписи.Логин);
	
	Возврат ДанныеПользователя;
	
КонецФункции

Функция АктуальныеПользователиМП() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК УИДПользователяМП
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПользователиМП = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПользователиМП.Добавить(Строка(Выборка.УИДПользователяМП));
	КонецЦикла;
	
	Возврат СтрСоединить(ПользователиМП, ";");

КонецФункции

Функция ДанныеПользователя() Экспорт

	РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	ТекущийПользователь = РеквизитыКонстант["ТекущийПользователь"];
	ТекущееПодразделение = РеквизитыКонстант["ПодразделениеПользователя"];
	
	РолиТекущегоПользователя = Новый Массив;
	Для Каждого ТекРоль Из ТекущийПользователь.Роли Цикл
		РолиТекущегоПользователя.Добавить(ТекРоль.Роль);
	КонецЦикла;
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("УИДТекущегоПользователя", ТекущийПользователь.УникальныйИдентификатор());
	ДанныеПользователя.Вставить("УИДТекущегоПодразделения", ТекущееПодразделение.УникальныйИдентификатор());
	ДанныеПользователя.Вставить("РолиТекущегоПользователя", СтрСоединить(РолиТекущегоПользователя, ";"));
	
	Возврат ДанныеПользователя;

КонецФункции

#КонецОбласти

#КонецЕсли