#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выбрать изменения
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Результат запроса.
Функция ВыбратьИзменения() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятияИзменения.Ссылка.Ссылка КАК Ссылка,
		|	СтруктураПредприятияИзменения.Ссылка.ФотоФайл КАК ФотоФайл,
		|	СтруктураПредприятияИзменения.Ссылка.ФотоФайлДвоичный КАК ФотоФайлДвоичный
		|ИЗ
		|	Справочник.СтруктураПредприятия.Изменения КАК СтруктураПредприятияИзменения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли