#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗначениеНастройки(КодНастройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Мечел_ОбщиеНастройки.Значение КАК Значение,
		|	Мечел_ОбщиеНастройки.Ссылка КАК Ссылка,
		|	Мечел_ОбщиеНастройки.ЭтоСписокЗначений КАК ЭтоСписокЗначений
		|ИЗ
		|	Справочник.ОбщиеНастройки КАК Мечел_ОбщиеНастройки
		|ГДЕ
		|	Мечел_ОбщиеНастройки.Код = &КодНастройки";
	
	Запрос.УстановитьПараметр("КодНастройки", КодНастройки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка.Следующий();
	Попытка
		Результат = Выборка.Значение.Получить();
	Исключение
		Результат = Неопределено;
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли