#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтатусПредставленияДокумента(Статус) Экспорт
	
	Если Статус = Перечисления.мп_СтатусыОбмена.Создан Тогда
		Возврат "Документ создан";
	ИначеЕсли Статус = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		Возврат "Документ зарегистрирован к выгрузке";
	ИначеЕсли Статус = Перечисления.мп_СтатусыОбмена.ВыгруженвКИС Тогда
		Возврат "Документ выгружен в КИС";
	ИначеЕсли Статус = Перечисления.мп_СтатусыОбмена.ЗагруженизКИС Тогда
		Возврат "Документ загружен из КИС";
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	Список.Добавить(Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС);
	
	ДанныеВыбора = Список;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли