////////////////////////////////////////////////////////////////////////////////
// ФоновыеЗаданияВызовСервера: Фоновый обмен, задания.
// Copyright (c) 2023, ООО "Мечел-Инфотех"
// Все права защищены.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция  ОбновлениеНоменклатуры() Экспорт

	Если ОбщегоНазначенияСервер.СоединениеВозможно() Тогда
		Константы.ДатаОбновленияНоменклатуры.Установить(Дата(1, 1, 1));

		Результат = ОбменСервер.ОбновлениеОстатков("updatecatalogs");

		Если Результат Тогда
			Константы.ДатаОбновленияНоменклатуры.Установить(ТекущаяДатаСеанса());
		КонецЕсли;
	Иначе
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ОстаткиТМЦ() Экспорт
	
	Если ОбщегоНазначенияСервер.СоединениеВозможно() Тогда
		Результат = ОбменСервер.ОбновлениеОстатков("updateinformationregisters");
	Иначе
		Результат = Ложь;
	КонецЕсли;

	Константы.ДатаПолученияОстатковТМЦ.Установить(ТекущаяДатаСеанса());
	Константы.ОшибкаСинхронизацииОстатковТМЦ.Установить(Не Результат);
	Возврат Результат;
	
КонецФункции

// Процедура - Запуск фонового обмена мобильного приложения.
//
Процедура ЗапуститьФоновыйОбмен() Экспорт
	
	ФоновыеЗаданияМобильногоОбмена = "ФоновыеЗадания";
	
	Попытка
		Если ОбщегоНазначенияСервер.СоединениеВозможно() Тогда
			Результат = ОбменСервер.Синхронизация();
			Если Результат Тогда
				HTTPCore.ЗаписатьИнформациюВЖурналСтрокой(ФоновыеЗаданияМобильногоОбмена, "Выполнен фоновый обмен.");
				
			КонецЕсли;
			
		Иначе
			СкоростьИнтернетСоединения = ОбщегоНазначенияСервер.ПолучитьОжидаемуюСкоростьСоединения();
			ТекстОшибки = СтрШаблон("Недостаточная скорость интернет соединения. Скорость = %1",
					СкоростьИнтернетСоединения);
			HTTPCore.ЗаписатьОшибкуВЖурналСтрокой(ФоновыеЗаданияМобильногоОбмена, ТекстОшибки);
			
		КонецЕсли;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстОшибки = СтрШаблон("Ошибка выполнения фонового задания. %1 %2", Символы.ПС, ОписаниеОшибки);
		HTTPCore.ЗаписатьОшибкуВЖурналСтрокой(ФоновыеЗаданияМобильногоОбмена, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти