#Область ОбработчикиКомандФормы

#Область Регистрация

&НаКлиенте
Процедура Регистрация(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения(
			"РегистрацияЗавершение", ЭтотОбъект), 
			"Произвести регистрацию/перерегистрацию устройства?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = РегистрацияНаСервере();
		ПроверитьРезультат(Результат, "Регистрация");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РегистрацияНаСервере()
	
	Возврат ОбменСервер.Регистрация();
	
КонецФункции

#КонецОбласти

#Область ПроверкаСвязи

&НаКлиенте
Процедура ПроверкаСвязи(Команда)
	
	Результат = ПроверкаСвязиНаСервере();
	ПроверитьРезультат(Результат, "Проверка связи");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСвязиАПИ(Команда)
	Результат = ПроверкаСвязиНаСервере("echoapi");
	ПроверитьРезультат(Результат, "Проверка связи");
КонецПроцедуры

&НаСервере
Функция ПроверкаСвязиНаСервере(Знач Шаблон = "")
	
	Возврат ОбменСервер.ПроверкаСвязи(Шаблон);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьРезультат(Результат, ВидПроцедуры)
	
	Если Результат = Истина Тогда
		Информация = СтрШаблон("%1 завершилась успешно", ВидПроцедуры);
	Иначе
		Информация = СтрШаблон("%1 завершилась с ошибками. %2 Смотрите журнал результатов.", ВидПроцедуры, Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти