///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция УсловиеОтбораДокумента(Статус, Источник, СтатусОбмена) Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.СтатусыДефектов.Отклонен);
	Статусы.Добавить(Перечисления.СтатусыДефектов.Устранен);

	СтатусыОбмена = Новый Массив;
	СтатусыОбмена.Добавить(Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС);
	СтатусыОбмена.Добавить(Перечисления.мп_СтатусыОбмена.ВыгруженВКИС);
	
	
	Если (Не Статусы.Найти(Статус) = Неопределено
		И Источник = Перечисления.мп_ИсточникиДокументов.КИС)
		Или
		(Источник = Перечисления.мп_ИсточникиДокументов.МечелТОиР
		И Не СтатусыОбмена.Найти(СтатусОбмена) = Неопределено) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти