#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выбрать изменения (регистрация) документа 
//
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Результат запроса.
//
Функция ВыбратьИзменения() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	мп_НарядНаРемонтИзменения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.мп_НарядНаРемонт.Изменения КАК мп_НарядНаРемонтИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_НарядНаРемонт КАК мп_НарядНаРемонт
	|		ПО мп_НарядНаРемонтИзменения.Ссылка = мп_НарядНаРемонт.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли