#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УникальныеИсполнители = ОбщегоНазначения.ВыгрузитьКолонку(Исполнители, "Ответственный", Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗРаботы", Работы);
	Запрос.Текст = ТекстЗапросаИсполнителиЗаданияНаРемонт();

	Результат = Запрос.Выполнить();
	КВыгрузке = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавилиИсполнителей = Ложь;
		ДокЗадание = Выборка.ЗаданиеНаРемонт.ПолучитьОбъект();
		Для Каждого ТекСтрока Из УникальныеИсполнители Цикл
			ИсполнительДокумента = ДокЗадание.Исполнители.Найти(ТекСтрока, "Ответственный");
			Если ИсполнительДокумента = Неопределено Тогда
				ДобавилиИсполнителей = Истина;
				НоваяСтрока = ДокЗадание.Исполнители.Добавить();
				НоваяСтрока.Ответственный = ТекСтрока;
			КонецЕсли;
		КонецЦикла;
		Если ДобавилиИсполнителей Тогда
			ДокЗадание.СтатусОбмена = КВыгрузке;
			ДокЗадание.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого ТекСтрока Из Работы Цикл
		ТекСтрока.УИДДокументаРабота = Строка(ТекСтрока.Работа.УникальныйИдентификатор());
		ТекСтрока.ВидДокументаРабота = ТекСтрока.Работа.Метаданные().Имя;
	КонецЦикла;
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаИсполнителиЗаданияНаРемонт()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЗРаботы.Работа КАК Работа
	|ПОМЕСТИТЬ вт_Работы
	|ИЗ
	|	&ТЗРаботы КАК ТЗРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мп_ЗаданиеНаРемонт.Ссылка КАК ЗаданиеНаРемонт
	|ИЗ
	|	Документ.мп_ЗаданиеНаРемонт КАК мп_ЗаданиеНаРемонт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Работы КАК вт_Работы
	|		ПО ((ВЫРАЗИТЬ(вт_Работы.Работа КАК Документ.мп_ЗаданиеНаРемонт)) = мп_ЗаданиеНаРемонт.Ссылка)";

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти
#Иначе

	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли

