#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ ОбщегоНазначенияВызовСервера.ПриложениеЗарегистрировано() Тогда
	//	Константы.ОнлайнОбменДанными.Установить(Истина);
	//КонецЕсли;
	//
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
//	НаборКонстант.ОнлайнОбменДанными = Константы.ОнлайнОбменДанными.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ОбщегоНазначенияВызовСервера.ПриложениеЗарегистрировано() Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкиHTTPПодключения");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти