#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура СохранитьНастройку(Пользователь, ОбъектНастройки, ВидНастройки, Значение) Экспорт

	Набор = РегистрыСведений.ХранилищеПерсональныхНастроек.СоздатьНаборЗаписей();

	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.ОбъектНастройки.Установить(ОбъектНастройки);
	Набор.Отбор.ВидНастройки.Установить(ВидНастройки);
	Набор.Записать(Истина);
	
	НоваяСтрока = Набор.Добавить();
	НоваяСтрока.Пользователь  = Пользователь;
	НоваяСтрока.ОбъектНастройки   = ОбъектНастройки;
	НоваяСтрока.ВидНастройки  = ВидНастройки;
	НоваяСтрока.ЗначениеНастройки = Новый ХранилищеЗначения(Значение);

	Набор.Записать(Истина);

КонецПроцедуры

Функция ЗагрузитьНастройку(Пользователь, ОбъектНастройки, ВидНастройки, ЗначениеПоУмолчанию) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.ХранилищеПерсональныхНастроек КАК Настройки
	|ГДЕ
	|	Настройки.Пользователь = &Пользователь
	|	И Настройки.ОбъектНастройки = &ОбъектНастройки
	|	И Настройки.ВидНастройки = &ВидНастройки";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Запрос.УстановитьПараметр("ВидНастройки", ВидНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Если Не ЗначениеЗаполнено(Выборка.ЗначениеНастройки) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;

		Попытка
			Возврат Выборка.ЗначениеНастройки.Получить();
		Исключение
			Возврат ЗначениеПоУмолчанию;
		КонецПопытки;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

КонецФункции

Функция ЗагрузитьНастройки(Пользователь, ОбъектНастройки, НастройкиПоУмолчанию) Экспорт

	ВидыНастроек = Новый Массив;
	Для Каждого ТекНастройка Из НастройкиПоУмолчанию Цикл
		ВидыНастроек.Добавить(ТекНастройка.Ключ);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.ВидНастройки КАК ВидНастройки,
	|	Настройки.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.ХранилищеПерсональныхНастроек КАК Настройки
	|ГДЕ
	|	Настройки.Пользователь = &Пользователь
	|	И Настройки.ОбъектНастройки = &ОбъектНастройки
	|	И Настройки.ВидНастройки В(&ВидНастройки)";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Запрос.УстановитьПараметр("ВидНастройки", ВидыНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			НастройкиПоУмолчанию[Выборка.ВидНастройки] = Выборка.ЗначениеНастройки.Получить();
		Исключение
			// При ошибке чтения оставляем значение по умолчанию
		КонецПопытки;
	КонецЦикла;

	Возврат НастройкиПоУмолчанию;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли