#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ГруппаСкладовОбменаДанными = Справочники.Склады.ПустаяСсылка() Тогда
		ТекстОшибки = "Не выбрана группа складов для обмена данными. 
			| Выберите группу складов чтобы продолжить настройку!";
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
//	ЭтотУзел = ПланыОбмена.Мечел_ОбменМобильноеПриложение.ЭтотУзел();
//	ПланОбменаОбъект = ЭтотУзел.ПолучитьОбъект();
//	ПланОбменаОбъект.ГруппаСкладовОбменаДанными = ТекущийОбъект.ГруппаСкладовОбменаДанными;
//	ПланОбменаОбъект.Записать();
	
//	ОбменСервер.Синхронизация(ТекущийОбъект.ГруппаСкладовОбменаДанными);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти