
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "НомерСтроки, ТехнологическоеМесто, ОбъектЭксплуатации, Узел,"
		+ "ПоказательНаработки, Значение";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ИменаЭлементов + ", ФормаЗаписать", "Доступность", Не Параметры.ТолькоПросмотр);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЭтотОбъект.СохранитьИзменения Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("ТехнологическоеМесто", ЭтотОбъект.ТехнологическоеМесто);
	ЗначенияСтроки.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	ЗначенияСтроки.Вставить("Узел", ЭтотОбъект.Узел);
	ЗначенияСтроки.Вставить("ПоказательНаработки", ЭтотОбъект.ПоказательНаработки);
	ЗначенияСтроки.Вставить("Значение", ЭтотОбъект.Значение);

	ОповеститьОВыборе(ЗначенияСтроки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТехнологическоеМестоПриИзменении(Элемент)

	ВыбранныйЭлемент = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
		ЭтотОбъект.ТехнологическоеМесто, Истина);
	
	Если ТипЗнч(ВыбранныйЭлемент) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		Если ЭтотОбъект.ОбъектЭксплуатации <> ВыбранныйЭлемент Тогда
			ЭтотОбъект.ОбъектЭксплуатации = ВыбранныйЭлемент;
			ОчиститьПодчиненныеЭлементыТехМеста();
		КонецЕсли;
	Иначе
		ЭтотОбъект.ВыбранныйЭлемент =
			ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
			
		ОчиститьПодчиненныеЭлементыТехМеста();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)

	ЭтотОбъект.ТехнологическоеМесто =
		НаработкиОбъектЭксплуатацииПриИзмененииНаСервере(ЭтотОбъект.ОбъектЭксплуатации);

	ОчиститьПодчиненныеЭлементыТехМеста();

КонецПроцедуры

&НаКлиенте
Процедура УзелНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ОбъектЭксплуатации = ЭтотОбъект.ОбъектЭксплуатации;
	Если Не ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда
		Возврат;
	КонецЕсли;
	ДоступныеУзлы =
		УзлыПоНаработке(ОбъектЭксплуатации);
		
	Если ДоступныеУзлы = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеУзлы);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
КонецПроцедуры

&НаКлиенте
Процедура УзелПриИзменении(Элемент)

	ЭтотОбъект.ПоказательНаработки =
		ПредопределенноеЗначение("Справочник.ПоказателиНаработки.ПустаяСсылка");

	ЭтотОбъект.Значение = 0;

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)

	ПустойУзел = ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");
	ПустойПоказатель = ПредопределенноеЗначение("Справочник.ПоказателиНаработки.ПустаяСсылка");
	Если ПустойУзел = ЭтотОбъект.Узел Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите узел объекта эксплуатации", , "Узел");
		Возврат;
	КонецЕсли;
	
	Если ПустойПоказатель = ЭтотОбъект.ПоказательНаработки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите показатель", , "ПоказательНаработки");
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.Значение = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите значение показателя", , "Значение");
		Возврат;
	КонецЕсли;

	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьПодчиненныеЭлементыТехМеста()

	ЭтотОбъект.Узел =
		ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");

	ЭтотОбъект.ПоказательНаработки =
		ПредопределенноеЗначение("Справочник.ПоказателиНаработки.ПустаяСсылка");

	ЭтотОбъект.Значение = 0;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НаработкиОбъектЭксплуатацииПриИзмененииНаСервере(Знач ОбъектЭксплуатации)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЭксплуатации, "ТехнологическоеМесто");

КонецФункции

&НаСервереБезКонтекста
Функция УзлыПоНаработке(Знач ОбъектЭксплуатации)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УзлыОбъектовЭксплуатации.Ссылка КАК Узел,
	|	УзлыОбъектовЭксплуатации.Класс КАК Класс
	|ПОМЕСТИТЬ вт_Узлы
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|ГДЕ
	|	УзлыОбъектовЭксплуатации.Владелец = &ОбъектЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Узлы.Узел КАК Узел
	|ИЗ
	|	вт_Узлы КАК вт_Узлы";
	
	Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Узел");
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПоказательНаработкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Узел = ЭтотОбъект.Узел;
	МассивЭлементов = Новый Массив;
	Если ЗначениеЗаполнено(Узел) Тогда
		Наработки = НаработкиУзла(Узел);
		Если Не Наработки = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Наработки);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(, "У класса узла нет показателей наработки", 30);
			Возврат;
		КонецЕсли;
	Иначе
			СтандартнаяОбработка = Ложь;
	КонецЕсли;
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаработкиУзла(Знач Узел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассыОбъектовЭксплуатации.Ссылка КАК Класс
	|ПОМЕСТИТЬ вт_КлассОбъект
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассыОбъектовЭксплуатации КАК КлассыОбъектовЭксплуатации
	|		ПО УзлыОбъектовЭксплуатации.Класс = КлассыОбъектовЭксплуатации.Ссылка
	|			И (&Узел = УзлыОбъектовЭксплуатации.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассыОбъектовЭксплуатацииПоказателиНаработки.ПоказательНаработки КАК Наработки
	|ИЗ
	|	вт_КлассОбъект КАК вт_КлассОбъект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассыОбъектовЭксплуатации.ПоказателиНаработки КАК КлассыОбъектовЭксплуатацииПоказателиНаработки
	|		ПО вт_КлассОбъект.Класс = КлассыОбъектовЭксплуатацииПоказателиНаработки.Ссылка";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Наработки");
	КонецЕсли;
	
КонецФункции

#КонецОбласти