#Область ОписаниеПеременных

Перем глАвторизацияВыполнена Экспорт;
Перем глПолучитьОстаткиФоном Экспорт;

#КонецОбласти

Процедура ПриНачалеРаботыСистемы()
	
	Если ОбщегоНазначенияВызовСервера.ПриложениеЗарегистрировано() Тогда
		глПолучитьОстаткиФоном = Ложь;
		ОткрытьФорму("ОбщаяФорма.АвторизацияПользователя", , , , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ОбщегоНазначенияВызовСервера.ДобавитьАдминистратораУстройства();
		ОбщегоНазначенияВызовСервера.ПервоначальнаяНастройка();
		ОткрытьФорму("ОбщаяФорма.СпособОбмена");
	КонецЕсли;

КонецПроцедуры

