#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизическиеЛицаПользователиПриИзменении(Элемент)
	Если ЭтотОбъект.ФизическиеЛица Или ЭтотОбъект.Пользователи Тогда
		ЭтотОбъект.Подразделения = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеВкл(Команда)
	ИзменитьВсе(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВсеВыкл(Команда)
	ИзменитьВсе(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОбновление(Команда)
	
	СписокЭлементов = ОбщегоНазначенияКлиентСервер.СписокЭлементоОбновленияСправочников();
	
	ОбновлятьСправочники = Ложь;
	ОбновлятьДанные = Новый Структура;
	Для Каждого ТекЭлемент Из СписокЭлементов Цикл
		ОбновлениеСправочника = ЭтотОбъект[ТекЭлемент];
		ОбновлятьДанные.Вставить(ТекЭлемент, ОбновлениеСправочника);
		Если ОбновлениеСправочника Тогда
			ОбновлятьСправочники = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтотОбъект.ОстаткиНоменклатуры Тогда
		ОстаткиНоменклатурыНаСервере();
	КонецЕсли;
	
	Если ОбновлятьСправочники Тогда
		РегистрацияНаСервере(ОбновлятьДанные);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РегистрацияНаСервере(СписокЭлементов)
	
	Результат =  ОбменСервер.Регистрация(СписокЭлементов);
	
	Если Результат Тогда
		ОбщегоНазначения.СообщитьПользователю("Обновление прошло успешно");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсе(Статус)
	
	СписокЭлементов = Новый Массив;
	СписокЭлементов.Добавить("Склады");
	СписокЭлементов.Добавить("Подразделения");
	СписокЭлементов.Добавить("ДефектыОборудования");
	СписокЭлементов.Добавить("ТехнологическиеМеста");
	СписокЭлементов.Добавить("ВидыПроверокОборудования");
	СписокЭлементов.Добавить("ОбъектыЭксплуатации");
	СписокЭлементов.Добавить("ВидыДефектов");
	СписокЭлементов.Добавить("ТехнологическиеОперации");
	СписокЭлементов.Добавить("СостоянияОборудования");
	СписокЭлементов.Добавить("ПричиныОтменыРемонтов");
	СписокЭлементов.Добавить("ФизическиеЛица");
	СписокЭлементов.Добавить("Пользователи");
	
	Для Каждого ТекЭлемент Из СписокЭлементов Цикл
		ЭтотОбъект[ТекЭлемент] = Статус;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОстаткиНоменклатурыНаСервере()
	
	Результат = ОбменСервер.ОбновлениеОстатков("updatecatalogs");;
	
	Если Результат Тогда
		Константы.ДатаОбновленияНоменклатуры.Установить(ТекущаяДатаСеанса());
		ОбщегоНазначения.СообщитьПользователю("Успешно обновление остатков номенклатуры");
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Ошибка обновления остатков номенклатуры");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти